{"title": "A Dynamic Hierarchical Framework for IoT-assisted Metaverse Synchronization.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse has recently attracted much attention from both academia and\nindustry. Virtual services, ranging from virtual driver training to online\nroute optimization for smart goods delivery, are emerging in the Metaverse. To\nmake the human experience of virtual life more real, digital twins (DTs),\nnamely digital replicas of physical objects, are key enablers. However, DT\nstatus may not always accurately reflect that of its real-world twin because\nthe latter may be subject to changes with time. As such, it is necessary to\nsynchronize a DT with its physical counterpart to ensure that its status is\naccurate for virtual businesses in the Metaverse. In this paper, we propose a\ndynamic hierarchical framework in which a group of IoT devices is incentivized\nto sense and collect physical objects' status information collectively so as to\nassists virtual service providers (VSPs) in synchronizing DTs. Based on the\ncollected sensing data and the value decay rate of the DTs, the VSPs can\ndetermine synchronization intensities to maximize their payoffs. In our\nproposed dynamic hierarchical framework, the lower-level evolutionary game\ncaptures the VSPs selection by the IoT device population, and the upper-level\ndifferential game captures the VSPs payoffs, which are affected by the\nsynchronization strategy, IoT devices selections, and the DTs value status,\ngiven VSPs are simultaneous decision makers. We further consider the case in\nwhich some VSPs are first movers and extend it as a Stackelberg differential\ngame. We theoretically and experimentally show that the equilibrium to the\nlower-level game exists and is evolutionarily robust, and provide a sensitivity\nanalysis with respect to various system parameters. Experiments show that the\nproposed dynamic hierarchical game outperform the baseline.", "source": "arxiv", "author": ["Yue Han", "Dusit Niyato", "Cyril Leung", "Dong In Kim", "Kun Zhu 0001", "Shaohan Feng", "Xuemin Sherman Shen", "Chunyan Miao"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.03969", "citation": 7}
---------------------------------
{"title": "Unified Resource Allocation Framework for the Edge Intelligence-Enabled Metaverse.", "publish": "CoRR", "date": "2021", "abstract": "Dubbed as the next-generation Internet, the metaverse is a virtual world that\nallows users to interact with each other or objects in real-time using their\navatars. The metaverse is envisioned to support novel ecosystems of service\nprovision in an immersive environment brought about by an intersection of the\nvirtual and physical worlds. The native AI systems in metaverse will\npersonalized user experience over time and shape the experience in a scalable,\nseamless, and synchronous way. However, the metaverse is characterized by\ndiverse resource types amid a highly dynamic demand environment. In this paper,\nwe propose the case study of virtual education in the metaverse and address the\nunified resource allocation problem amid stochastic user demand. We propose a\nstochastic optimal resource allocation scheme (SORAS) based on stochastic\ninteger programming with the objective of minimizing the cost of the virtual\nservice provider. The simulation results show that SORAS can minimize the cost\nof the virtual service provider while accounting for the users' demands\nuncertainty.", "source": "arxiv", "author": ["Wei Chong Ng", "Wei Yang Bryan Lim", "Jer Shyuan Ng", "Zehui Xiong", "Dusit Niyato", "Chunyan Miao"], "author_location": [], "link": "https://arxiv.org/abs/2110.14325", "citation": 22}
---------------------------------
{"title": "Attention-aware Resource Allocation and QoE Analysis for Metaverse xURLLC Services.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse encapsulates our expectations of the next-generation Internet,\nwhile bringing new key performance indicators (KPIs). Although conventional\nultra-reliable and low-latency communications (URLLC) can satisfy objective\nKPIs, it is difficult to provide a personalized immersive experience that is a\ndistinctive feature of the Metaverse. Since the quality of experience (QoE) can\nbe regarded as a comprehensive KPI, the URLLC is evolved towards the next\ngeneration URLLC (xURLLC) with a personalized resource allocation scheme to\nachieve higher QoE. To deploy Metaverse xURLLC services, we study the\ninteraction between the Metaverse service provider (MSP) and the network\ninfrastructure provider (InP), and provide an optimal contract design\nframework. Specifically, the utility of the MSP, defined as a function of\nMetaverse users' QoE, is to be maximized, while ensuring the incentives of the\nInP. To model the QoE mathematically, we propose a novel metric named\nMeta-Immersion that incorporates both the objective KPIs and subjective\nfeelings of Metaverse users. Furthermore, we develop an attention-aware\nrendering capacity allocation scheme to improve QoE in xURLLC. Using a\nuser-object-attention level dataset, we validate that the xURLLC can achieve an\naverage of 20.1% QoE improvement compared to the conventional URLLC with a\nuniform resource allocation scheme.", "source": "arxiv", "author": ["Hongyang Du", "Jiazhen Liu", "Dusit Niyato", "Jiawen Kang", "Zehui Xiong", "Junshan Zhang", "Dong In Kim"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.05438", "citation": 0}
---------------------------------
{"title": "Optimal Targeted Advertising Strategy For Secure Wireless Edge Metaverse.", "publish": "CoRR", "date": "2021", "abstract": "Recently, Metaverse has attracted increasing attention from both industry and\nacademia, because of the significant potential to integrate real and digital\nworlds ever more seamlessly. By combining advanced wireless communications,\nedge computing and virtual reality (VR) technologies into Metaverse, a\nmultidimensional, intelligent and powerful wireless edge Metaverse is created\nfor future human society. In this paper, we design a privacy preserving\ntargeted advertising strategy for the wireless edge Metaverse. Specifically, a\nMetaverse service provider (MSP) allocates bandwidth to the VR users so that\nthe users can access Metaverse from edge access points. To protect users'\nprivacy, the covert communication technique is used in the downlink. Then, the\nMSP can offer high-quality access services to earn more profits. Motivated by\nthe concept of \"covert\", targeted advertising is used to promote the sale of\nbandwidth and ensure that the advertising strategy cannot be detected by\ncompetitors who may make counter-offer and by attackers who want to disrupt the\nservices. We derive the best advertising strategy in terms of budget input,\nwith the help of the Vidale-Wolfe model and Hamiltonian function. Furthermore,\nwe propose a novel metric named Meta-Immersion to represent the user's\nexperience feelings. The performance evaluation shows that the MSP can boost\nits revenue with an optimal targeted advertising strategy, especially compared\nwith that without the advertising.", "source": "arxiv", "author": ["Hongyang Du", "Dusit Niyato", "Jiawen Kang", "Dong In Kim", "Chunyan Miao"], "author_location": [], "link": "https://arxiv.org/abs/2111.00511", "citation": 11}
---------------------------------
{"title": "Wireless Edge-Empowered Metaverse: A Learning-Based Incentive Mechanism for Virtual Reality.", "publish": "CoRR", "date": "2021", "abstract": "The Metaverse is regarded as the next-generation Internet paradigm that\nallows humans to play, work, and socialize in an alternative virtual world with\nimmersive experience, for instance, via head-mounted display for Virtual\nReality (VR) rendering. With the help of ubiquitous wireless connections and\npowerful edge computing technologies, VR users in wireless edge-empowered\nMetaverse can immerse in the virtual through the access of VR services offered\nby different providers. However, VR applications are computation- and\ncommunication-intensive. The VR service providers (SPs) have to optimize the VR\nservice delivery efficiently and economically given their limited communication\nand computation resources. An incentive mechanism can be thus applied as an\neffective tool for managing VR services between providers and users. Therefore,\nin this paper, we propose a learning-based Incentive Mechanism framework for VR\nservices in the Metaverse. First, we propose the quality of perception as the\nmetric for VR users immersing in the virtual world. Second, for quick trading\nof VR services between VR users (i.e., buyers) and VR SPs (i.e., sellers), we\ndesign a double Dutch auction mechanism to determine optimal pricing and\nallocation rules in this market. Third, for auction communication reduction, we\ndesign a deep reinforcement learning-based auctioneer to accelerate this\nauction process. Experimental results demonstrate that the proposed framework\ncan achieve near-optimal social welfare while reducing at least half of the\nauction information exchange cost than baseline methods.", "source": "arxiv", "author": ["Minrui Xu", "Dusit Niyato", "Jiawen Kang", "Zehui Xiong", "Chunyan Miao", "Dong In Kim"], "author_location": [], "link": "https://arxiv.org/abs/2111.03776", "citation": 22}
---------------------------------
{"title": "Money and Trust in Metaverses, Bitcoin and Stablecoins in global social XR.", "publish": "CoRR", "date": "2022", "abstract": "We present a state of the art and positioning book, about Digital society\ntools, namely; Web3, Bitcoin, Metaverse, AI/ML, accessibility, safeguarding and\ntelecollaboration. A high level overview of Web3 technologies leads to a\ndescription of blockchain, and the Bitcoin network is specifically selected for\ndetailed examination. Suitable components of the extended Bitcoin ecosystem are\ndescribed in more depth. Other mechanisms for native digital value transfer are\ndescribed, with a focus on `money'. Metaverse technology is over-viewed,\nprimarily from the perspective of Bitcoin and extended reality. Bitcoin is\nselected as the best contender for value transfer in metaverses because of it's\nfree and open source nature, and network effect. Challenges and risks of this\napproach are identified. A cloud deployable virtual machine based technology\nstack deployment guide with a focus on cybersecurity best practice can be\ndownloaded from GitHub to experiment with the technologies. This deployable lab\nis designed to inform development of secure value transaction, for small and\nmedium sized companies.", "source": "arxiv", "author": ["John Joseph O'Hare", "Allen Fairchild", "Umran Ali"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2207.09460", "citation": 0}
---------------------------------
{"title": "What is the Metaverse? An Immersive Cyberspace and Open Challenges.", "publish": "CoRR", "date": "2022", "abstract": "The Metaverse refers to a virtual-physical blended space in which multiple\nusers can concurrently interact with a unified computer-generated environment\nand other users, which can be regarded as the next significant milestone of the\ncurrent cyberspace. This article primarily discusses the development and\nchallenges of the Metaverse. We first briefly describe the development of\ncyberspace and the necessity of technology enablers. Accordingly, our bottom-up\napproach highlights three critical technology enablers for the Metaverse:\nnetworks, systems, and users. Also, we highlight a number of indispensable\nissues, under technological and ecosystem perspectives, that build and sustain\nthe Metaverse.", "source": "arxiv", "author": ["Lik-Hang Lee", "Pengyuan Zhou", "Tristan Braud", "Pan Hui 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2206.03018", "citation": 0}
---------------------------------
{"title": "MetaSlicing: A Novel Resource Allocation Framework for Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Creating and maintaining the Metaverse requires enormous resources that have\nnever been seen before, especially computing resources for intensive data\nprocessing to support the extended reality, enormous storage resources, and\nmassive networking resources for maintaining ultra high-speed and low-latency\nconnections. Therefore, this work aims to propose a novel framework, namely\nMetaSlicing, that can provide a highly effective and comprehensive solution in\nmanaging and allocating different types of resources for Metaverse\napplications. In particular, by observing that Metaverse applications may have\ncommon functions, we first propose grouping applications into clusters, called\nMetaInstances. In a MetaInstance, common functions can be shared among\napplications. As such, the same resources can be used by multiple applications\nsimultaneously, thereby enhancing resource utilization dramatically. To address\nthe real-time characteristic and resource demand's dynamic and uncertainty in\nthe Metaverse, we develop an effective framework based on the semi-Markov\ndecision process and propose an intelligent admission control algorithm that\ncan maximize resource utilization and enhance the Quality-of-Service for\nend-users. Extensive simulation results show that our proposed solution\noutperforms the Greedy-based policy by up to 80% and 47% in terms of long-term\nrevenue for Metaverse providers and request acceptance probability,\nrespectively.", "source": "arxiv", "author": ["Nam H. Chu", "Dinh Thai Hoang", "Diep N. Nguyen", "Khoa T. Phan", "Eryk Dutkiewicz"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2205.11087", "citation": 0}
---------------------------------
{"title": "Sense The Physical, Walkthrough The Virtual, Manage The Metaverse: A Data-centric Perspective.", "publish": "CoRR", "date": "2022", "abstract": "In the Metaverse, the physical space and the virtual space co-exist, and\ninteract simultaneously. While the physical space is virtually enhanced with\ninformation, the virtual space is continuously refreshed with real-time,\nreal-world information. To allow users to process and manipulate information\nseamlessly between the real and digital spaces, novel technologies must be\ndeveloped. These include smart interfaces, new augmented realities, efficient\nstorage and data management and dissemination techniques. In this paper, we\nfirst discuss some promising co-space applications. These applications offer\nexperiences and opportunities that neither of the spaces can realize on its\nown. We then argue that the database community has much to offer to this field.\nFinally, we present several challenges that we, as a community, can contribute\ntowards managing the Metaverse.", "source": "arxiv", "author": ["Beng Chin Ooi", "Kian-Lee Tan", "Anthony K. H. Tung", "Gang Chen 0001", "Mike Zheng Shou", "Xiaokui Xiao", "Meihui Zhang 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2206.10326", "citation": 0}
---------------------------------
{"title": "AI and 6G into the Metaverse: Fundamentals, Challenges and Future Research Trends.", "publish": "CoRR", "date": "2022", "abstract": "Since Facebook was renamed Meta, a lot of attention, debate, and exploration\nhave intensified about what the Metaverse is, how it works, and the possible\nways to exploit it. It is anticipated that Metaverse will be a continuum of\nrapidly emerging technologies, usecases, capabilities, and experiences that\nwill make it up for the next evolution of the Internet. Several researchers\nhave already surveyed the literature on artificial intelligence (AI) and\nwireless communications in realizing the Metaverse. However, due to the rapid\nemergence and continuous evolution of technologies, there is a need for a\ncomprehensive and in-depth survey of the role of AI, 6G, and the nexus of both\nin realizing the immersive experiences of Metaverse. Therefore, in this survey,\nwe first introduce the background and ongoing progress in augmented reality\n(AR), virtual reality (VR), mixed reality (MR) and spatial computing, followed\nby the technical aspects of AI and 6G. Then, we survey the role of AI in the\nMetaverse by reviewing the state-of-the-art in deep learning, computer vision,\nand Edge AI to extract the requirements of 6G in Metaverse. Next, we\ninvestigate the promising services of B5G/6G towards Metaverse, followed by\nidentifying the role of AI in 6G networks and 6G networks for AI in support of\nMetaverse applications, and the need for sustainability in Metaverse. Finally,\nwe enlist the existing and potential applications, usecases, and projects to\nhighlight the importance of progress in the Metaverse. Moreover, in order to\nprovide potential research directions to researchers, we underline the\nchallenges, research gaps, and lessons learned identified from the literature\nreview of the aforementioned technologies.", "source": "arxiv", "author": ["Muhammad Zawish", "Fayaz Ali Dharejo", "Sunder Ali Khowaja", "Kapal Dev", "Steven Davy", "Nawab Muhammad Faseeh Qureshi", "Paolo Bellavista"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.10921", "citation": 0}
---------------------------------
{"title": "Re-shaping Post-COVID-19 Teaching and Learning: A Blueprint of Virtual-Physical Blended Classrooms in the Metaverse Era.", "publish": "CoRR", "date": "2022", "abstract": "During the COVID-19 pandemic, most countries have experienced some form of\nremote education through video conferencing software platforms. However, these\nsoftware platforms fail to reduce immersion and replicate the classroom\nexperience. The currently emerging Metaverse addresses many of such limitations\nby offering blended physical-digital environments. This paper aims to assess\nhow the Metaverse can support and improve e-learning. We first survey the\nlatest applications of blended environments in education and highlight the\nprimary challenges and opportunities. Accordingly, we derive our proposal for a\nvirtual-physical blended classroom configuration that brings students and\nteachers into a shared educational Metaverse. We focus on the system\narchitecture of the Metaverse classroom to achieve real-time synchronization of\na large number of participants and activities across physical (mixed reality\nclassrooms) and virtual (remote VR platform) learning spaces. Our proposal\nattempts to transform the traditional physical classroom into virtual-physical\ncyberspace as a new social network of learners and educators connected at an\nunprecedented scale.", "source": "arxiv", "author": ["Yuyang Wang", "Lik-Hang Lee", "Tristan Braud", "Pan Hui 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.09228", "citation": 3}
---------------------------------
{"title": "Slicing4Meta: An Intelligent Integration Framework with Multi-dimensional Network Resources for Metaverse-as-a-Service in Web 3.0.", "publish": "CoRR", "date": "2022", "abstract": "As the next-generation Internet paradigm, Web 3.0 encapsulates the\nexpectations of user-centric immersion and interaction experiences in a\ndecentralized manner. Metaverse, a virtual world interacting with the physical\nworld, is becoming one of the most potential technology to push forward with\nWeb 3.0. In the Metaverse, users expect to tailor immersive and interactive\nexperiences by customizing real-time Metaverse services (e.g.,\naugmented/virtual reality and digital twin) in the three-dimensional virtual\nworld. Nevertheless, there are still no unified solutions for the Metaverse\nservices in terms of management and orchestration. It is calling for a\ncontinuous evolution of scalable solutions and mobile systems to support\nMetaverse services, and thus bring Metaverse into reality. In this paper, to\nprovide scalable subscription solutions for Metaverse services, we propose a\nnew concept, named Metaverse-as-a-Service (MaaS), in which various\nphysical-virtual components and technologies in the Metaverse can be delivered\nas services. Furthermore, to unify the management and orchestration of MaaS, we\npropose a novel framework, called Slicing4Meta, to customize Metaverse services\nby intelligently integrating MaaS models and the associated multi-dimensional\nresources on the components and technologies. Additionally, we propose the\nclassification for typical Metaverse services based on the quality of\nexperience (QoE) requirements and illustrate how to fulfill the QoE\nrequirements under the Slicing4Meta framework. We then illustrate a virtual\ntraveling study case, in which we examine the relationship between the QoE and\nthe multi-dimensional resources by quantitatively modeling the QoE of Metaverse\nusers. Finally, we discuss some open challenges of Slicing4Meta and propose\npotential solutions to address the challenges.", "source": "arxiv", "author": ["Yi-Jing Liu", "Hongyang Du", "Dusit Niyato", "Gang Feng 0004", "Jiawen Kang", "Zehui Xiong"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.06081", "citation": 0}
---------------------------------
{"title": "Blockchain-based Edge Resource Sharing for Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Although Metaverse has recently been widely studied, its practical\napplication still faces many challenges. One of the severe challenges is the\nlack of sufficient resources for computing and communication on local devices,\nresulting in the inability to access the Metaverse services. To address this\nissue, this paper proposes a practical blockchain-based mobile edge computing\n(MEC) platform for resource sharing and optimal utilization to complete the\nrequested offloading tasks, given the heterogeneity of servers' available\nresources and that of users' task requests. To be specific, we first elaborate\nthe design of our proposed system and then dive into the task allocation\nmechanism to assign offloading tasks to proper servers. To solve the multiple\ntask allocation (MTA) problem in polynomial time, we devise a learning-based\nalgorithm. Since the objective function and constraints of MTA are\nsignificantly affected by the servers uploading the tasks, we reformulate it as\na reinforcement learning problem and calculate the rewards for each state and\naction considering the influences of servers. Finally, numerous experiments are\nconducted to demonstrate the effectiveness and efficiency of our proposed\nsystem and algorithms.", "source": "arxiv", "author": ["Zhilin Wang", "Qin Hu 0001", "Minghui Xu 0001", "Honglu Jiang"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.05120", "citation": 1}
---------------------------------
{"title": "Edge-enabled Metaverse: The Convergence of Metaverse and Mobile Edge Computing.", "publish": "CoRR", "date": "2022", "abstract": "The Metaverse is a virtual environment where users are represented by avatars\nto navigate a virtual world, which has strong links with the physical one.\nState-of-the-art Metaverse architectures rely on a cloud-based approach for\navatar physics emulation and graphics rendering computation. Such centralized\ndesign is unfavorable as it suffers from several drawbacks caused by the long\nlatency required for cloud access, such as low quality visualization. To solve\nthis issue, in this paper, we propose a Fog-Edge hybrid computing architecture\nfor Metaverse applications that leverage an edge-enabled distributed computing\nparadigm, which makes use of edge devices computing power to fulfil the\nrequired computational cost for heavy tasks such as collision detection in\nvirtual universe and computation of 3D physics in virtual simulation. The\ncomputational cost related to an entity in the Metaverse such as collision\ndetection or physics emulation are performed at the end-device of the\nassociated physical entity. To prove the effectiveness of the proposed\narchitecture, we simulate a distributed social metaverse application.\nSimulation results shows that the proposed architecture can reduce the latency\nby 50% when compared with the legacy cloud-based Metaverse applications.", "source": "arxiv", "author": ["Sahraoui Dhelim", "M. Tahar Kechadi", "Liming Chen 0001", "Nyothiri Aung", "Huansheng Ning", "Luigi Atzori"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2205.02764", "citation": 7}
---------------------------------
{"title": "Metaverse for Social Good: A University Campus Prototype.", "publish": "CoRR", "date": "2021", "abstract": "In recent years, the metaverse has attracted enormous attention from around\nthe world with the development of related technologies. The expected metaverse\nshould be a realistic society with more direct and physical interactions, while\nthe concepts of race, gender, and even physical disability would be weakened,\nwhich would be highly beneficial for society. However, the development of\nmetaverse is still in its infancy, with great potential for improvement.\nRegarding metaverse's huge potential, industry has already come forward with\nadvance preparation, accompanied by feverish investment, but there are few\ndiscussions about metaverse in academia to scientifically guide its\ndevelopment. In this paper, we highlight the representative applications for\nsocial good. Then we propose a three-layer metaverse architecture from a macro\nperspective, containing infrastructure, interaction, and ecosystem. Moreover,\nwe journey toward both a historical and novel metaverse with a detailed\ntimeline and table of specific attributes. Lastly, we illustrate our\nimplemented blockchain-driven metaverse prototype of a university campus and\ndiscuss the prototype design and insights.", "source": "arxiv", "author": ["Haihan Duan", "Jiaye Li", "Sizheng Fan", "Zhonghao Lin", "Xiao Wu", "Wei Cai 0002"], "author_location": [], "link": "https://arxiv.org/abs/2108.08985", "citation": 176}
---------------------------------
{"title": "Artificial Intelligence for the Metaverse: A Survey.", "publish": "CoRR", "date": "2022", "abstract": "Along with the massive growth of the Internet from the 1990s until now,\nvarious innovative technologies have been created to bring users breathtaking\nexperiences with more virtual interactions in cyberspace. Many virtual\nenvironments with thousands of services and applications, from social networks\nto virtual gaming worlds, have been developed with immersive experience and\ndigital transformation, but most are incoherent instead of being integrated\ninto a platform. In this context, metaverse, a term formed by combining meta\nand universe, has been introduced as a shared virtual world that is fueled by\nmany emerging technologies, such as fifth-generation networks and beyond,\nvirtual reality, and artificial intelligence (AI). Among such technologies, AI\nhas shown the great importance of processing big data to enhance immersive\nexperience and enable human-like intelligence of virtual agents. In this\nsurvey, we make a beneficial effort to explore the role of AI in the foundation\nand development of the metaverse. We first deliver a preliminary of AI,\nincluding machine learning algorithms and deep learning architectures, and its\nrole in the metaverse. We then convey a comprehensive investigation of AI-based\nmethods concerning six technical aspects that have potentials for the\nmetaverse: natural language processing, machine vision, blockchain, networking,\ndigital twin, and neural interface, and being potential for the metaverse.\nSubsequently, several AI-aided applications, such as healthcare, manufacturing,\nsmart cities, and gaming, are studied to be deployed in the virtual worlds.\nFinally, we conclude the key contribution of this survey and open some future\nresearch directions in AI for the metaverse.", "source": "arxiv", "author": ["Thien Huynh-The", "Quoc-Viet Pham", "Xuan-Qui Pham", "Thanh Thi Nguyen", "Zhu Han 0001", "Dong-Seong Kim 0003"], "author_location": [], "link": "https://arxiv.org/abs/2202.10336", "citation": 4}
---------------------------------
{"title": "Metaverse for Wireless Systems: Vision, Enablers, Architecture, and Future Directions.", "publish": "CoRR", "date": "2022", "abstract": "Recently, significant research efforts have been initiated to enable the\nnext-generation, namely, the sixth-generation (6G) wireless systems. In this\narticle, we present a vision of metaverse towards effectively enabling the\ndevelopment of 6G wireless systems. A metaverse will use virtual representation\n(e.g., digital twin), digital avatars, and interactive experience technologies\n(e.g., extended reality) to assist analyses, optimizations, and operations of\nvarious wireless applications. Specifically, the metaverse can offer virtual\nwireless system operations through the digital twin that allows network\ndesigners, mobile developers, and telecommunications engineers to monitor,\nobserve, analyze, and simulations their solutions collaboratively and\nvirtually. We first introduce a general architecture for metaverse-based\nwireless systems. We discuss key driving applications, design trends, and key\nenablers of metaverse-based wireless systems. Finally, we present several open\nchallenges and their potential solutions.", "source": "arxiv", "author": ["Latif U. Khan", "Zhu Han 0001", "Dusit Niyato", "Ekram Hossain 0001", "Choong Seon Hong"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2207.00413", "citation": 2}
---------------------------------
{"title": "Singer Identification for Metaverse with Timbral and Middle-Level Perceptual Features.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse is an interactive world that combines reality and virtuality, where\nparticipants can be virtual avatars. Anyone can hold a concert in a virtual\nconcert hall, and users can quickly identify the real singer behind the virtual\nidol through the singer identification. Most singer identification methods are\nprocessed using the frame-level features. However, expect the singer's timbre,\nthe music frame includes music information, such as melodiousness, rhythm, and\ntonal. It means the music information is noise for using frame-level features\nto identify the singers. In this paper, instead of only the frame-level\nfeatures, we propose to use another two features that address this problem.\nMiddle-level feature, which represents the music's melodiousness, rhythmic\nstability, and tonal stability, and is able to capture the perceptual features\nof music. The timbre feature, which is used in speaker identification,\nrepresents the singers' voice features. Furthermore, we propose a convolutional\nrecurrent neural network (CRNN) to combine three features for singer\nidentification. The model firstly fuses the frame-level feature and timbre\nfeature and then combines middle-level features to the mix features. In\nexperiments, the proposed method achieves comparable performance on an average\nF1 score of 0.81 on the benchmark dataset of Artist20, which significantly\nimproves related works.", "source": "arxiv", "author": ["Xulong Zhang", "Jianzong Wang", "Ning Cheng", "Jing Xiao 0006"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2205.11817", "citation": 5}
---------------------------------
{"title": "Will Metaverse be NextG Internet? Vision, Hype, and Reality.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse, with the combination of the prefix \"meta\" (meaning transcending)\nand the word \"universe\", has been deemed as the next-generation (NextG)\nInternet. It aims to create a shared virtual space that connects all virtual\nworlds via the Internet, where users, represented as digital avatars, can\ncommunicate and collaborate as if they are in the physical world. Nevertheless,\nthere is still no unified definition of the Metaverse. This article first\npresents our vision of what the key requirements of Metaverse should be and\nreviews what has been heavily advocated by the industry and the positions of\nvarious high-tech companies. It then briefly introduces existing social virtual\nreality (VR) platforms that can be viewed as early prototypes of Metaverse and\nconducts a reality check by diving into the network operation and performance\nof two representative platforms, Workrooms from Meta and AltspaceVR from\nMicrosoft. Finally, it concludes by discussing several opportunities and future\ndirections for further innovation.", "source": "arxiv", "author": ["Ruizhi Cheng", "Nan Wu", "Songqing Chen", "Bo Han 0001"], "author_location": [], "link": "https://arxiv.org/abs/2201.12894", "citation": 16}
---------------------------------
{"title": "Going Incognito in the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Virtual reality (VR) telepresence applications and the so-called \"metaverse\"\npromise to be the next major medium of interaction with the internet. However,\nwith numerous recent studies showing the ease at which VR users can be\nprofiled, deanonymized, and data harvested, metaverse platforms carry all the\nprivacy risks of the current internet and more while at present having none of\nthe defensive privacy tools we are accustomed to using on the web. To remedy\nthis, we present the first known method of implementing an \"incognito mode\" for\nVR. Our technique leverages local differential privacy to quantifiably obscure\nsensitive user data attributes, with a focus on intelligently adding noise when\nand where it is needed most to maximize privacy while minimizing usability\nimpact. Moreover, our system is capable of flexibly adapting to the unique\nneeds of each metaverse application to further optimize this trade-off. We\nimplement our solution as a universal Unity (C#) plugin that we then evaluate\nusing several popular VR applications. Upon faithfully replicating the most\nwell-known VR privacy attack studies, we show a significant degradation of\nattacker capabilities when using our proposed solution.", "source": "arxiv", "author": ["Vivek Nair", "Gonzalo Munilla Garrido", "Dawn Song"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.05604", "citation": 1}
---------------------------------
{"title": "Life, the Metaverse and Everything: An Overview of Privacy, Ethics, and Governance in Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "The metaverse is expected to be the next major evolution phase of the\ninternet. The metaverse will have an impact on human society, production, and\nlife. In this work, we analyze the current trends and challenges that building\nsuch a virtual environment will face. We focus on three major pillars to guide\nthe development of the metaverse: privacy, governance, and ethical design, to\nguide the development of the metaverse. Finally, we propose a preliminary\nmodular-based framework for an ethical design of the metaverse.", "source": "arxiv", "author": ["Carlos Bermejo Fernandez", "Pan Hui 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.01480", "citation": 7}
---------------------------------
{"title": "Sampling, Communication, and Prediction Co-Design for Synchronizing the Real-World Device and Digital Model in Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "The metaverse has the potential to revolutionize the next generation of the\nInternet by supporting highly interactive services with the help of Mixed\nReality (MR) technologies; still, to provide a satisfactory experience for\nusers, the synchronization between the physical world and its digital models is\ncrucial. This work proposes a sampling, communication and prediction co-design\nframework to minimize the communication load subject to a constraint on\ntracking the Mean Squared Error (MSE) between a real-world device and its\ndigital model in the metaverse. To optimize the sampling rate and the\nprediction horizon, we exploit expert knowledge and develop a constrained Deep\nReinforcement Learning (DRL) algorithm, named Knowledge-assisted Constrained\nTwin-Delayed Deep Deterministic (KC-TD3) policy gradient algorithm. We validate\nour framework on a prototype composed of a real-world robotic arm and its\ndigital model. Compared with existing approaches: (1) When the tracking error\nconstraint is stringent (MSE=0.002 degrees), our policy degenerates into the\npolicy in the sampling-communication co-design framework. (2) When the tracking\nerror constraint is mild (MSE=0.007 degrees), our policy degenerates into the\npolicy in the prediction-communication co-design framework. (3) Our framework\nachieves a better trade-off between the average MSE and the average\ncommunication load compared with a communication system without sampling and\nprediction. For example, the average communication load can be reduced up to\n87% when the track error constraint is 0.002 degrees. (4) Our policy\noutperforms the benchmark with the static sampling rate and prediction horizon\noptimized by exhaustive search, in terms of the tail probability of the\ntracking error. Furthermore, with the assistance of expert knowledge, the\nproposed algorithm KC-TD3 achieves better convergence time, stability, and\nfinal policy performance.", "source": "arxiv", "author": ["Zhen Meng", "Changyang She", "Guodong Zhao 0001", "Daniele De Martini"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.04233", "citation": 1}
---------------------------------
{"title": "Toward Imagined Speech based Smart Communication System: Potential Applications on Metaverse Conditions.", "publish": "CoRR", "date": "2021", "abstract": "Metaverse provides an alternative platform for human interaction in the\nvirtual world. Since virtual platform holds few restrictions in changing the\nsurrounding environments or the appearance of the avatars, it can serve as a\nplatform that reflects human thoughts or even dreams at least in the metaverse\nworld. When it is merged together with the current brain-computer interface\n(BCI) technology, which enables system control via brain signals, a new\nparadigm of human interaction through mind may be established in the metaverse\nconditions. Recent BCI systems are aiming to provide user-friendly and\nintuitive means of communication using brain signals. Imagined speech has\nbecome an alternative neuro-paradigm for communicative BCI since it relies\ndirectly on a person's speech production process, rather than using\nspeech-unrelated neural activity as the means of communication. In this paper,\nwe propose a brain-to-speech (BTS) system for real-world smart communication\nusing brain signals. Also, we show a demonstration of imagined speech based\nsmart home control through communication with a virtual assistant, which can be\none of the future applications of brain-metaverse system. We performed\npseudo-online analysis using imagined speech electroencephalography data of\nnine subjects to investigate the potential use of virtual BTS system in the\nreal-world. Average accuracy of 46.54 % (chance level = 7.7 %) and 75.56 %\n(chance level = 50 %) was acquired in the thirteen-class and binary\npseudo-online analysis, respectively. Our results support the potential of\nimagined speech based smart communication to be applied in the metaverse world.", "source": "arxiv", "author": ["Seo-Hyun Lee", "Young Eun Lee", "Seong-Whan Lee"], "author_location": [], "link": "https://arxiv.org/abs/2112.08569", "citation": 3}
---------------------------------
{"title": "Reliable Coded Distributed Computing for Metaverse Services: Coalition Formation and Incentive Mechanism Design.", "publish": "CoRR", "date": "2021", "abstract": "The metaverse is regarded as a new wave of technological transformation that\nprovides a virtual space for people to interact through digital avatars. To\nachieve immersive user experiences in the metaverse, real-time rendering is the\nkey technology. However, computing-intensive tasks of real-time rendering from\nmetaverse service providers cannot be processed efficiently on a single\nresource-limited mobile device. Alternatively, such mobile devices can offload\nthe metaverse rendering tasks to other mobile devices by adopting the\ncollaborative computing paradigm based on Coded Distributed Computing (CDC).\nTherefore, this paper introduces a hierarchical game-theoretic CDC framework\nfor the metaverse services, especially for the vehicular metaverse. In the\nframework, idle resources from vehicles, acting as CDC workers, are aggregated\nto handle intensive computation tasks in the vehicular metaverse. Specifically,\nin the upper layer, a miner coalition formation game is formulated based on a\nreputation metric to select reliable workers. To guarantee the reliable\nmanagement of reputation values, the reputation values calculated based on the\nsubjective logical model are maintained in a blockchain database. In the lower\nlayer, a Stackelberg game-based incentive mechanism is considered to attract\nreliable workers selected in the upper layer to participate in rendering tasks.\nThe simulation results illustrate that the proposed framework is resistant to\nmalicious workers. Compared with the best-effort worker selection scheme, the\nproposed scheme can improve the utility of metaverse service provider and the\naverage profit of CDC workers.", "source": "arxiv", "author": ["Yuna Jiang", "Jiawen Kang", "Dusit Niyato", "Xiaohu Ge", "Zehui Xiong", "Chunyan Miao"], "author_location": [], "link": "https://arxiv.org/abs/2111.10548", "citation": 14}
---------------------------------
{"title": "A Survey on Metaverse: Fundamentals, Security, and Privacy.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse, as an evolving paradigm of the next-generation Internet, aims to\nbuild a fully immersive, hyper spatiotemporal, and self-sustaining virtual\nshared space for humans to play, work, and socialize. Driven by recent advances\nin emerging technologies such as extended reality, artificial intelligence, and\nblockchain, metaverse is stepping from science fiction to an upcoming reality.\nHowever, severe privacy invasions and security breaches (inherited from\nunderlying technologies or emerged in the new digital ecology) of metaverse can\nimpede its wide deployment. At the same time, a series of fundamental\nchallenges (e.g., scalability and interoperability) can arise in metaverse\nsecurity provisioning owing to the intrinsic characteristics of metaverse, such\nas immersive realism, hyper spatiotemporality, sustainability, and\nheterogeneity. In this paper, we present a comprehensive survey of the\nfundamentals, security, and privacy of metaverse. Specifically, we first\ninvestigate a novel distributed metaverse architecture and its key\ncharacteristics with ternary-world interactions. Then, we discuss the security\nand privacy threats, present the critical challenges of metaverse systems, and\nreview the state-of-the-art countermeasures. Finally, we draw open research\ndirections for building future metaverse systems.", "source": "arxiv", "author": ["Yuntao Wang 0004", "Zhou Su", "Ning Zhang 0007", "Dongxiao Liu", "Rui Xing", "Tom H. Luan", "Xuemin Shen"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.02662", "citation": 38}
---------------------------------
{"title": "MetaGraspNet: A Large-Scale Benchmark Dataset for Scene-Aware Ambidextrous Bin Picking via Physics-based Metaverse Synthesis.", "publish": "CoRR", "date": "2022", "abstract": "Autonomous bin picking poses significant challenges to vision-driven robotic\nsystems given the complexity of the problem, ranging from various sensor\nmodalities, to highly entangled object layouts, to diverse item properties and\ngripper types. Existing methods often address the problem from one perspective.\nDiverse items and complex bin scenes require diverse picking strategies\ntogether with advanced reasoning. As such, to build robust and effective\nmachine-learning algorithms for solving this complex task requires significant\namounts of comprehensive and high quality data. Collecting such data in real\nworld would be too expensive and time prohibitive and therefore intractable\nfrom a scalability perspective. To tackle this big, diverse data problem, we\ntake inspiration from the recent rise in the concept of metaverses, and\nintroduce MetaGraspNet, a large-scale photo-realistic bin picking dataset\nconstructed via physics-based metaverse synthesis. The proposed dataset\ncontains 217k RGBD images across 82 different article types, with full\nannotations for object detection, amodal perception, keypoint detection,\nmanipulation order and ambidextrous grasp labels for a parallel-jaw and vacuum\ngripper. We also provide a real dataset consisting of over 2.3k fully annotated\nhigh-quality RGBD images, divided into 5 levels of difficulties and an unseen\nobject set to evaluate different object and layout properties. Finally, we\nconduct extensive experiments showing that our proposed vacuum seal model and\nsynthetic dataset achieves state-of-the-art performance and generalizes to real\nworld use-cases.", "source": "arxiv", "author": ["Maximilian Gilles", "Yuhao Chen", "Tim Robin Winter", "E. Zhixuan Zeng", "Alexander Wong"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.03963", "citation": 0}
---------------------------------
{"title": "Beyond the Blue Sky of Multimodal Interaction: A Centennial Vision of Interplanetary Virtual Spaces in Turn-based Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Human habitation across multiple planets requires communication and social\nconnection between planets. When the infrastructure of a deep space network\nbecomes mature, immersive cyberspace, known as the Metaverse, can exchange\ndiversified user data and host multitudinous virtual worlds. Nevertheless, such\nimmersive cyberspace unavoidably encounters latency in minutes, and thus\noperates in a turn-taking manner. This Blue Sky paper illustrates a vision of\nan interplanetary Metaverse that connects Earthian and Martian users in a\nturn-based Metaverse. Accordingly, we briefly discuss several grand challenges\nto catalyze research initiatives for the `Digital Big Bang' on Mars.", "source": "arxiv", "author": ["Lik Hang Lee", "Carlos Bermejo Fernandez", "Ahmad Alhilal", "Tristan Braud", "Simo Hosio", "Pan Hui 0001", "Esmée Henrieke Henrieke Anne de Haas"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.05517", "citation": 0}
---------------------------------
{"title": "MetaGraspNet: A Large-Scale Benchmark Dataset for Vision-driven Robotic Grasping via Physics-based Metaverse Synthesis.", "publish": "CoRR", "date": "2021", "abstract": "There has been increasing interest in smart factories powered by robotics\nsystems to tackle repetitive, laborious tasks. One impactful yet challenging\ntask in robotics-powered smart factory applications is robotic grasping: using\nrobotic arms to grasp objects autonomously in different settings. Robotic\ngrasping requires a variety of computer vision tasks such as object detection,\nsegmentation, grasp prediction, pick planning, etc. While significant progress\nhas been made in leveraging of machine learning for robotic grasping,\nparticularly with deep learning, a big challenge remains in the need for\nlarge-scale, high-quality RGBD datasets that cover a wide diversity of\nscenarios and permutations. To tackle this big, diverse data problem, we are\ninspired by the recent rise in the concept of metaverse, which has greatly\nclosed the gap between virtual worlds and the physical world. Metaverses allow\nus to create digital twins of real-world manufacturing scenarios and to\nvirtually create different scenarios from which large volumes of data can be\ngenerated for training models. In this paper, we present MetaGraspNet: a\nlarge-scale benchmark dataset for vision-driven robotic grasping via\nphysics-based metaverse synthesis. The proposed dataset contains 100,000 images\nand 25 different object types and is split into 5 difficulties to evaluate\nobject detection and segmentation model performance in different grasping\nscenarios. We also propose a new layout-weighted performance metric alongside\nthe dataset for evaluating object detection and segmentation performance in a\nmanner that is more appropriate for robotic grasp applications compared to\nexisting general-purpose performance metrics. Our benchmark dataset is\navailable open-source on Kaggle, with the first phase consisting of detailed\nobject detection, segmentation, layout annotations, and a layout-weighted\nperformance metric script.", "source": "arxiv", "author": ["Yuhao Chen", "E. Zhixuan Zeng", "Maximilian Gilles", "Alexander Wong"], "author_location": [], "link": "https://arxiv.org/abs/2112.14663", "citation": 0}
---------------------------------
{"title": "Compute- and Data-Intensive Networks: The Key to the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "The worlds of computing, communication, and storage have for a long time been\ntreated separately, and even the recent trends of cloud computing, distributed\ncomputing, and mobile edge computing have not fundamentally changed the role of\nnetworks, still designed to move data between end users and pre-determined\ncomputation nodes, without true optimization of the end-to-end\ncompute-communication process. However, the emergence of Metaverse\napplications, where users consume multimedia experiences that result from the\nreal-time combination of distributed live sources and stored digital assets,\nhas changed the requirements for, and possibilities of, systems that provide\ndistributed caching, computation, and communication. We argue that the\nreal-time interactive nature and high demands on data storage, streaming rates,\nand processing power of Metaverse applications will accelerate the merging of\nthe cloud into the network, leading to highly-distributed tightly-integrated\ncompute- and data-intensive networks becoming universal compute platforms for\nnext-generation digital experiences. In this paper, we first describe the\nrequirements of Metaverse applications and associated supporting\ninfrastructure, including relevant use cases. We then outline a comprehensive\ncloud network flow mathematical framework, designed for the end-to-end\noptimization and control of such systems, and show numerical results\nillustrating its promising role for the efficient operation of Metaverse-ready\nnetworks.", "source": "arxiv", "author": ["Yang Cai 0004", "Jaime Llorca", "Antonia Maria Tulino", "Andreas F. Molisch"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.02001", "citation": 15}
---------------------------------
{"title": "Rethinking Quality of Experience for Metaverse Services: A Consumer-based Economics Perspective.", "publish": "CoRR", "date": "2022", "abstract": "The Metaverse is considered to be one prototype of the next-generation\nInternet, which contains people's expectations for the future world. However,\nthe academic discussion of the Metaverse still mainly focused on the system\ntechnical design, and few research studied Metaverse challenges from the\nperspective of consumers, i.e., Metaverse users. One difficulty is that the\nanalysis from the consumer's perspective requires interdisciplinary theoretical\nframework and quantifiable Quality of Experience (QoE) measurements. In this\narticle, pioneering from consumers' point of view, we explore an interaction\nbetween Metaverse system design and consumer behaviors. Specifically, we\nrethink the QoE and propose an interdisciplinary framework that encompasses\nboth the Metaverse service providers (MSPs) and consumer considerations. From\nthe macro perspective, we introduce a joint optimization scheme that\nsimultaneously considers the Metaverse system design, consumers' utility, and\nprofitability of the MSPs. From the micro perspective, we advocate the\nWillingness-to-Pay (WTP) as an easy-to-implement QoE measurement for future\nMetaverse system studies. To illustrate the usability of the proposed\nintegrated framework, a use case of Metaverse, i.e., virtual traveling, is\npresented. We show that our framework can benefit the MSPs in offering\ncompetitive and economical service design to consumers while maximizing the\nprofit.", "source": "arxiv", "author": ["Hongyang Du", "Bohao Ma", "Dusit Niyato", "Jiawen Kang"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.01076", "citation": 0}
---------------------------------
{"title": "A Full Dive into Realizing the Edge-enabled Metaverse: Visions, Enabling Technologies, and Challenges.", "publish": "CoRR", "date": "2022", "abstract": "Dubbed \"the successor to the mobile Internet\", the concept of the Metaverse\nhas grown in popularity. While there exist lite versions of the Metaverse\ntoday, they are still far from realizing the full vision of an immersive,\nembodied, and interoperable Metaverse. Without addressing the issues of\nimplementation from the communication and networking, as well as computation\nperspectives, the Metaverse is difficult to succeed the Internet, especially in\nterms of its accessibility to billions of users today. In this survey, we focus\non the edge-enabled Metaverse to realize its ultimate vision. We first provide\nreaders with a succinct tutorial of the Metaverse, an introduction to the\narchitecture, as well as current developments. To enable ubiquitous, seamless,\nand embodied access to the Metaverse, we discuss the communication and\nnetworking challenges and survey cutting-edge solutions and concepts that\nleverage next-generation communication systems for users to immerse as and\ninteract with embodied avatars in the Metaverse. Moreover, given the high\ncomputation costs required, e.g., to render 3D virtual worlds and run\ndata-hungry artificial intelligence-driven avatars, we discuss the computation\nchallenges and cloud-edge-end computation framework-driven solutions to realize\nthe Metaverse on resource-constrained edge devices. Next, we explore how\nblockchain technologies can aid in the interoperable development of the\nMetaverse, not just in terms of empowering the economic circulation of virtual\nuser-generated content but also to manage physical edge resources in a\ndecentralized, transparent, and immutable manner. Finally, we discuss the\nfuture research directions towards realizing the true vision of the\nedge-enabled Metaverse.", "source": "arxiv", "author": ["Minrui Xu", "Wei Chong Ng", "Wei Yang Bryan Lim", "Jiawen Kang", "Zehui Xiong", "Dusit Niyato", "Qiang Yang 0001", "Xuemin Sherman Shen", "Chunyan Miao"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.05471", "citation": 32}
---------------------------------
{"title": "6G-enabled Edge AI for Metaverse: Challenges, Methods, and Future Research Directions.", "publish": "CoRR", "date": "2022", "abstract": "6G-enabled edge intelligence opens up a new era of Internet of Everything and\nmakes it possible to interconnect people-devices-cloud anytime, anywhere. More\nand more next-generation wireless network smart service applications are\nchanging our way of life and improving our quality of life. As the hottest new\nform of next-generation Internet applications, Metaverse is striving to connect\nbillions of users and create a shared world where virtual and reality merge.\nHowever, limited by resources, computing power, and sensory devices, Metaverse\nis still far from realizing its full vision of immersion, materialization, and\ninteroperability. To this end, this survey aims to realize this vision through\nthe organic integration of 6G-enabled edge AI and Metaverse. Specifically, we\nfirst introduce three new types of edge-Metaverse architectures that use\n6G-enabled edge AI to solve resource and computing constraints in Metaverse.\nThen we summarize technical challenges that these architectures face in\nMetaverse and the existing solutions. Furthermore, we explore how the\nedge-Metaverse architecture technology helps Metaverse to interact and share\ndigital data. Finally, we discuss future research directions to realize the\ntrue vision of Metaverse with 6G-enabled edge AI.", "source": "arxiv", "author": ["Luyi Chang", "Zhe Zhang", "Pei Li", "Shan Xi", "Wei Guo", "Yukang Shen", "Zehui Xiong", "Jiawen Kang", "Dusit Niyato", "Xiuquan Qiao", "Yi Wu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.06192", "citation": 8}
---------------------------------
{"title": "MetaFi: Device-Free Pose Estimation via Commodity WiFi for Metaverse Avatar Simulation.", "publish": "CoRR", "date": "2022", "abstract": "Avatar refers to a representative of a physical user in the virtual world\nthat can engage in different activities and interact with other objects in\nmetaverse. Simulating the avatar requires accurate human pose estimation.\nThough camera-based solutions yield remarkable performance, they encounter the\nprivacy issue and degraded performance caused by varying illumination,\nespecially in smart home. In this paper, we propose a WiFi-based IoT-enabled\nhuman pose estimation scheme for metaverse avatar simulation, namely MetaFi.\nSpecifically, a deep neural network is designed with customized convolutional\nlayers and residual blocks to map the channel state information to human pose\nlandmarks. It is enforced to learn the annotations from the accurate computer\nvision model, thus achieving cross-modal supervision. WiFi is ubiquitous and\nrobust to illumination, making it a feasible solution for avatar applications\nin smart home. The experiments are conducted in the real world, and the results\nshow that the MetaFi achieves very high performance with a PCK@50 of 95.23%.", "source": "arxiv", "author": ["Jianfei Yang", "Yunjiao Zhou", "He Huang", "Han Zou", "Lihua Xie"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.10414", "citation": 2}
---------------------------------
{"title": "All One Needs to Know about Metaverse: A Complete Survey on Technological Singularity, Virtual Ecosystem, and Research Agenda.", "publish": "CoRR", "date": "2021", "abstract": "Since the popularisation of the Internet in the 1990s, the cyberspace has\nkept evolving. We have created various computer-mediated virtual environments\nincluding social networks, video conferencing, virtual 3D worlds (e.g., VR\nChat), augmented reality applications (e.g., Pokemon Go), and Non-Fungible\nToken Games (e.g., Upland). Such virtual environments, albeit non-perpetual and\nunconnected, have bought us various degrees of digital transformation. The term\n`metaverse' has been coined to further facilitate the digital transformation in\nevery aspect of our physical lives. At the core of the metaverse stands the\nvision of an immersive Internet as a gigantic, unified, persistent, and shared\nrealm. While the metaverse may seem futuristic, catalysed by emerging\ntechnologies such as Extended Reality, 5G, and Artificial Intelligence, the\ndigital `big bang' of our cyberspace is not far away. This survey paper\npresents the first effort to offer a comprehensive framework that examines the\nlatest metaverse development under the dimensions of state-of-the-art\ntechnologies and metaverse ecosystems, and illustrates the possibility of the\ndigital `big bang'. First, technologies are the enablers that drive the\ntransition from the current Internet to the metaverse. We thus examine eight\nenabling technologies rigorously - Extended Reality, User Interactivity\n(Human-Computer Interaction), Artificial Intelligence, Blockchain, Computer\nVision, IoT and Robotics, Edge and Cloud computing, and Future Mobile Networks.\nIn terms of applications, the metaverse ecosystem allows human users to live\nand play within a self-sustaining, persistent, and shared realm. Therefore, we\ndiscuss six user-centric factors -- Avatar, Content Creation, Virtual Economy,\nSocial Acceptability, Security and Privacy, and Trust and Accountability.\nFinally, we propose a concrete research agenda for the development of the\nmetaverse.", "source": "arxiv", "author": ["Lik-Hang Lee", "Tristan Braud", "Pengyuan Zhou", "Lin Wang", "Dianlei Xu", "Zijun Lin", "Abhishek Kumar", "Carlos Bermejo", "Pan Hui 0001"], "author_location": [], "link": "https://arxiv.org/abs/2110.05352", "citation": 215}
---------------------------------
{"title": "Metaverse Native Communication: A Blockchain and Spectrum Prospective.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse depicts a vista of constructing a virtual environment parallel to\nthe real world so people can communicate with others and objects through\ndigital entities. In the real world, communication relies on identities and\naddresses that are recognized by authorities, no matter the link is established\nvia post, email, mobile phone, or landline. Metaverse, however, is different\nfrom the real world, which requires a single identity belongs to the\nindividual. This identity can be an encrypted virtual address in the metaverse\nbut no one can trace or verify it. In order to achieve such addresses to hide\nindividuals in the metaverse, re-mapping the virtual address to the\nindividual's identity and a specific spectrum to support the address-based\ncommunication for the metaverse are needed. Therefore, metaverse native or\nmeta-native communications based on blockchain could be a promising solution to\ndirectly connect entities with their native encrypted addresses that gets rid\nof the existing network services based on IP, cellular, HTTP, etc. This paper\nproposes a vision of blockchain, encrypted address and address-based access\nmodel for all users, devices, services, etc. to contribute to the metaverse.\nFurthermore, the allocation architecture of a designated spectrum for the\nmetaverse is proposed to remove the barrier to access to the\nmetaverse/blockchain in response to the initiatives of metaverse and\ndecentralized Internet.", "source": "arxiv", "author": ["Hao Xu", "Zihao Li", "Zongyao Li", "Xiaoshuai Zhang", "Yao Sun", "Lei Zhang 0035"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.08355", "citation": 4}
---------------------------------
{"title": "MetaOnce: A Metaverse Framework Based on Multi-scene Relations and Entity-relation-event Game.", "publish": "CoRR", "date": "2022", "abstract": "Existing metaverse systems lack rich relation types between entities and\nevents. The challenge is that there is no portable framework to introduce rich\nconcepts, relations, events into the metaverse. This paper introduces a new\nmetaverse framework, MetaOnce. This framework proposes to build multi-scene\ngraphs. This framework not only describes rich relations in a single scene but\nalso combines multiple scene graphs into a complete graph for more\ncomprehensive analysis and inference. Prior social network systems mainly\ndescribe friend relations. They ignore the effect of entity-relation-event\ngames on the metaverse system and existing rule constraints. We propose a rule\ncontroller and impose constraints on the relations that allow the framework to\nbehave in a compliant manner. We build a metaverse system to test the features\nof the framework, and experimental results show that our framework can build a\nmulti-scene metaverse with memory and rule constraints.", "source": "arxiv", "author": ["Hongyin Zhu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.10424", "citation": 4}
---------------------------------
{"title": "When Internet of Things meets Metaverse: Convergence of Physical and Cyber Worlds.", "publish": "CoRR", "date": "2022", "abstract": "In recent years, the Internet of Things (IoT) is studied in the context of\nthe Metaverse to provide users immersive cyber-virtual experiences in mixed\nreality environments. This survey introduces six typical IoT applications in\nthe Metaverse, including collaborative healthcare, education, smart city,\nentertainment, real estate, and socialization. In the IoT-inspired Metaverse,\nwe also comprehensively survey four pillar technologies that enable augmented\nreality (AR) and virtual reality (VR), namely, responsible artificial\nintelligence (AI), high-speed data communications, cost-effective mobile edge\ncomputing (MEC), and digital twins. According to the physical-world demands, we\noutline the current industrial efforts and seven key requirements for building\nthe IoT-inspired Metaverse: immersion, variety, economy, civility,\ninteractivity, authenticity, and independence. In addition, this survey\ndescribes the open issues in the IoT-inspired Metaverse, which need to be\naddressed to eventually achieve the convergence of physical and cyber worlds.", "source": "arxiv", "author": ["Kai Li 0002", "Yingping Cui", "Weicai Li", "Tiejun Lv", "Xin Yuan 0004", "Shenghong Li 0002", "Wei Ni 0001", "Meryem Simsek", "Falko Dressler"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.13501", "citation": 0}
---------------------------------
{"title": "Blockchain for the Metaverse: A Review.", "publish": "CoRR", "date": "2022", "abstract": "Since Facebook officially changed its name to Metaverse in Oct. 2021, the\nmetaverse has become a new norm of social networks and three-dimensional (3D)\nvirtual worlds. The metaverse aims to bring 3D immersive and personalized\nexperiences to users by leveraging many pertinent technologies. Despite great\nattention and benefits, a natural question in the metaverse is how to secure\nits users' digital content and data. In this regard, blockchain is a promising\nsolution owing to its distinct features of decentralization, immutability, and\ntransparency. To better understand the role of blockchain in the metaverse, we\naim to provide an extensive survey on the applications of blockchain for the\nmetaverse. We first present a preliminary to blockchain and the metaverse and\nhighlight the motivations behind the use of blockchain for the metaverse. Next,\nwe extensively discuss blockchain-based methods for the metaverse from\ntechnical perspectives, such as data acquisition, data storage, data sharing,\ndata interoperability, and data privacy preservation. For each perspective, we\nfirst discuss the technical challenges of the metaverse and then highlight how\nblockchain can help. Moreover, we investigate the impact of blockchain on\nkey-enabling technologies in the metaverse, including Internet-of-Things,\ndigital twins, multi-sensory and immersive applications, artificial\nintelligence, and big data. We also present some major projects to showcase the\nrole of blockchain in metaverse applications and services. Finally, we present\nsome promising directions to drive further research innovations and\ndevelopments towards the use of blockchain in the metaverse in the future.", "source": "arxiv", "author": ["Thippa Reddy Gadekallu", "Thien Huynh-The", "Weizheng Wang", "Gokul Yenduri", "Pasika Ranaweera", "Quoc-Viet Pham", "Daniel Benevides da Costa", "Madhusanka Liyanage"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.09738", "citation": 17}
---------------------------------
{"title": "Metaverse Shape of Your Life for Future: A bibliometric snapshot.", "publish": "CoRR", "date": "2021", "abstract": "The metaverse was first introduced in 1992. Many people saw Metaverse as a\nnew word but the concept of Metaverse is not a new term. However, Zuckerberg's\npress release drew all the attention to the Metaverse. This study presents a\nbibliometric evaluation of metaverse technology, which has been discussed in\nthe literature since the nineties. A field study is carried out especially for\nthe metaverse, which is a new and trendy subject. In this way, descriptive\ninformation is presented on journals, institutions, prominent researchers, and\ncountries in the field, as well as extra evaluation on the prominent topics in\nthe field and researchers with heavy citations. In our study, which was carried\nout by extracting the data of all documents between the years 1990-2021 from\nthe Web of Science database, it was seen that there were few studies in the\nliterature in the historical process for the metaverse, whose popularity has\nreached its peak in recent months. In addition, it is seen that the subject is\nhandled intensively with virtual reality and augmented reality technologies,\nand the education sector and digital marketing fields show interest in the\nfield. Metaverse will probably have entered many areas of our lives in the next\n15-20 years, shape our lives by taking advantage of the opportunities of\ndeveloping technology.", "source": "arxiv", "author": ["Muhammet Damar"], "author_location": [], "link": "https://arxiv.org/abs/2112.12068", "citation": 54}
---------------------------------
{"title": "Realizing the Metaverse with Edge Intelligence: A Match Made in Heaven.", "publish": "CoRR", "date": "2022", "abstract": "Dubbed \"the successor to the mobile Internet\", the concept of the Metaverse\nhas recently exploded in popularity. While there exists lite versions of the\nMetaverse today, we are still far from realizing the vision of a seamless,\nshardless, and interoperable Metaverse given the stringent sensing,\ncommunication, and computation requirements. Moreover, the birth of the\nMetaverse comes amid growing privacy concerns among users. In this article, we\nbegin by providing a preliminary definition of the Metaverse. We discuss the\narchitecture of the Metaverse and mainly focus on motivating the convergence of\nedge intelligence and the infrastructure layer of the Metaverse. We present\nmajor edge-based technological developments and their integration to support\nthe Metaverse engine. Then, we present our research attempts through a case\nstudy of virtual city development in the Metaverse. Finally, we discuss the\nopen research issues.", "source": "arxiv", "author": ["Wei Yang Bryan Lim", "Zehui Xiong", "Dusit Niyato", "Xianbin Cao 0001", "Chunyan Miao", "Sumei Sun", "Qiang Yang 0001"], "author_location": [], "link": "https://arxiv.org/abs/2201.01634", "citation": 34}
---------------------------------
{"title": "Fusing Blockchain and AI with Metaverse: A Survey.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse as the latest buzzword has attracted great attention from both\nindustry and academia. Metaverse seamlessly integrates the real world with the\nvirtual world and allows avatars to carry out rich activities including\ncreation, display, entertainment, social networking, and trading. Thus, it is\npromising to build an exciting digital world and to transform a better physical\nworld through the exploration of the metaverse. In this survey, we dive into\nthe metaverse by discussing how Blockchain and Artificial Intelligence (AI)\nfuse with it through investigating the state-of-the-art studies across the\nmetaverse components, digital currencies, AI applications in the virtual world,\nand blockchain-empowered technologies. Further exploitation and\ninterdisciplinary research on the fusion of AI and Blockchain towards metaverse\nwill definitely require collaboration from both academia and industries. We\nwish that our survey can help researchers, engineers, and educators build an\nopen, fair, and rational future metaverse.", "source": "arxiv", "author": ["Qinglin Yang", "Yetong Zhao", "Huawei Huang", "Zehui Xiong", "Jiawen Kang", "Zibin Zheng"], "author_location": [], "link": "https://arxiv.org/abs/2201.03201", "citation": 43}
---------------------------------
{"title": "Decentralized, not Dehumanized in the Metaverse: Bringing Utility to NFTs through Multimodal Interaction.", "publish": "CoRR", "date": "2022", "abstract": "User Interaction for NFTs (Non-fungible Tokens) is gaining increasing\nattention. Although NFTs have been traditionally single-use and monolithic,\nrecent applications aim to connect multimodal interaction with human behaviour.\nThis paper reviews the related technological approaches and business practices\nin NFT art. We highlight that multimodal interaction is a currently\nunder-studied issue in mainstream NFT art, and conjecture that multimodal\ninteraction is a crucial enabler for decentralization in the NFT community. We\npropose a framework that combines a bottom-up approach with AI multimodal\nprocess. Through this framework, we put forward integrating human behaviour\ndata into generative NFT units, as \"multimodal interactive NFT\". Our work\ndisplays the possibilities of NFTs in the art world, beyond the traditional 2D\nand 3D static content.", "source": "arxiv", "author": ["Anqi Wang", "Ze Gao", "Lik-Hang Lee", "Tristan Braud", "Pan Hui 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2206.03737", "citation": 0}
---------------------------------
{"title": "MetaSID: Singer Identification with Domain Adaptation for Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse has stretched the real world into unlimited space. There will be\nmore live concerts in Metaverse. The task of singer identification is to\nidentify the song belongs to which singer. However, there has been a tough\nproblem in singer identification, which is the different live effects. The\nstudio version is different from the live version, the data distribution of the\ntraining set and the test set are different, and the performance of the\nclassifier decreases. This paper proposes the use of the domain adaptation\nmethod to solve the live effect in singer identification. Three methods of\ndomain adaptation combined with Convolutional Recurrent Neural Network (CRNN)\nare designed, which are Maximum Mean Discrepancy (MMD), gradient reversal\n(Revgrad), and Contrastive Adaptation Network (CAN). MMD is a distance-based\nmethod, which adds domain loss. Revgrad is based on the idea that learned\nfeatures can represent different domain samples. CAN is based on class\nadaptation, it takes into account the correspondence between the categories of\nthe source domain and target domain. Experimental results on the public dataset\nof Artist20 show that CRNN-MMD leads to an improvement over the baseline CRNN\nby 0.14. The CRNN-RevGrad outperforms the baseline by 0.21. The CRNN-CAN\nachieved state of the art with the F1 measure value of 0.83 on album split.", "source": "arxiv", "author": ["Xulong Zhang", "Jianzong Wang", "Ning Cheng", "Jing Xiao 0006"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2205.11821", "citation": 4}
---------------------------------
{"title": "Semantic Information Market For The Metaverse: An Auction Based Approach.", "publish": "CoRR", "date": "2022", "abstract": "In this paper, we address the networking and communications problems of\ncreating a digital copy in the Metaverse digital twin. Specifically, a virtual\nservice provider (VSP) which is responsible for creating and rendering the\nMetaverse, is required to use the data collected by IoT devices to create the\nvirtual copy of the physical world. However, due to the huge volume of the\ncollected data by IoT devices (e.g., images and videos) and the limited\nbandwidth, the VSP might become unable to retrieve all the required data from\nthe physical world. Furthermore, the Metaverse needs fast replication (e.g.,\nrendering) of the digital copy adding more restrictions on the data\ntransmission delay. To solve the aforementioned challenges, we propose to equip\nthe IoT devices with semantic information extraction algorithms to minimize the\nsize of the transmitted data over the wireless channels. Since many IoT devices\nwill be interested to sell their semantic information to the VSP, we propose a\ntruthful reverse auction mechanism that helps the VSP select only IoT devices\nthat can improve the quality of its virtual copy of objects through the\nsemantic information. We conduct extensive simulations on a dataset that\ncontains synchronized camera and radar images, and show that our novel design\nenables a fast replication of the digital copy with high accuracy.", "source": "arxiv", "author": ["Lotfi Ismail", "Dusit Niyato", "Sumei Sun", "Dong In Kim", "Melike Erol-Kantarci", "Chunyan Miao"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.04878", "citation": 1}
---------------------------------
{"title": "Exploring Attention-Aware Network Resource Allocation for Customized Metaverse Services.", "publish": "CoRR", "date": "2022", "abstract": "Emerging with the support of computing and communications technologies,\nMetaverse is expected to bring users unprecedented service experiences.\nHowever, the increase in the number of Metaverse users places a heavy demand on\nnetwork resources, especially for Metaverse services that are based on\ngraphical extended reality and require rendering a plethora of virtual objects.\nTo make efficient use of network resources and improve the\nQuality-of-Experience (QoE), we design an attention-aware network resource\nallocation scheme to achieve customized Metaverse services. The aim is to\nallocate more network resources to virtual objects in which users are more\ninterested. We first discuss several key techniques related to Metaverse\nservices, including QoE analysis, eye-tracking, and remote rendering. We then\nreview existing datasets and propose the user-object-attention level (UOAL)\ndataset that contains the ground truth attention of 30 users to 96 objects in\n1,000 images. A tutorial on how to use UOAL is presented. With the help of\nUOAL, we propose an attention-aware network resource allocation algorithm that\nhas two steps, i.e., attention prediction and QoE maximization. Specially, we\nprovide an overview of the designs of two types of attention prediction\nmethods, i.e., interest-aware and time-aware prediction. By using the predicted\nuser-object-attention values, network resources such as the rendering capacity\nof edge devices can be allocated optimally to maximize the QoE. Finally, we\npropose promising research directions related to Metaverse services.", "source": "arxiv", "author": ["Hongyang Du", "Jiacheng Wang", "Dusit Niyato", "Jiawen Kang", "Zehui Xiong", "Xuemin Shen", "Dong In Kim"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.00369", "citation": 1}
---------------------------------
{"title": "A Survey on Metaverse: the State-of-the-art, Technologies, Applications, and Challenges.", "publish": "CoRR", "date": "2021", "abstract": "Metaverse is a new type of Internet application and social form that\nintegrates a variety of new technologies. It has the characteristics of\nmulti-technology, sociality, and hyper spatiotemporality. This paper introduces\nthe development status of Metaverse, from the five perspectives of network\ninfrastructure, management technology, basic common technology, virtual reality\nobject connection, and virtual reality convergence, it introduces the technical\nframework of Metaverse. This paper also introduces the nature of Metaverse's\nsocial and hyper spatiotemporality, and discusses the first application areas\nof Metaverse and some of the problems and challenges it may face.", "source": "arxiv", "author": ["Huansheng Ning", "Hang Wang", "Yujia Lin", "Wenxi Wang", "Sahraoui Dhelim", "Fadi Farha", "Jianguo Ding", "Mahmoud Daneshmand"], "author_location": [], "link": "https://arxiv.org/abs/2111.09673", "citation": 88}
---------------------------------
{"title": "MetaAID: A Flexible Framework for Developing Metaverse Applications via AI Technology and Human Editing.", "publish": "CoRR", "date": "2022", "abstract": "Achieving the expansion of domestic demand and the economic internal\ncirculation requires balanced and coordinated support from multiple industries\n(domains) such as consumption, education, entertainment, engineering\ninfrastructure, etc., which is indispensable for maintaining economic\ndevelopment. Metaverse applications may help with this task and can make many\nindustries more interesting, more efficient, and provide a better user\nexperience. The first challenge is that metaverse application development\ninevitably requires the support of various artificial intelligence (AI)\ntechnologies such as natural language processing (NLP), knowledge graph (KG),\ncomputer vision (CV), and machine learning (ML), etc. However, existing\nmetaverse application development lacks a lightweight AI technology framework.\nThis paper proposes a flexible metaverse AI technology framework metaAID that\naims to support language and semantic technologies in the development of\ndigital twins and virtual humans. The second challenge is that the development\nprocess of metaverse applications involves both technical development tasks and\nmanual editing work, and often becomes a heavyweight multi-team collaboration\nproject, not to mention the development of metaverse applications in multiple\nindustries. Our framework summarizes common AI technologies and application\ndevelopment templates with common functional modules and interfaces. Based on\nthis framework, we have designed 5 applications for 3 industries around the\nexpansion of domestic demand and economic internal circulation. Experimental\nresults show that our framework can support AI technologies when developing\nmetaverse applications in different industries.", "source": "arxiv", "author": ["Hongyin Zhu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.01614", "citation": 8}
---------------------------------
{"title": "Applying Digital Twins in Metaverse: User Interface, Security and Privacy Challenges.", "publish": "CoRR", "date": "2022", "abstract": "Digital Twins (DTs) are a conventional and well-known concept, proposed in\n70s, that are popular in a broad spectrum of sciences, industry innovations,\nand consortium alliances. However, in the last few years, the growth of digital\nassets and online communications has attracted attention to DTs as highly\naccurate twins of physical objects. Metaverse, as a digital world, is a concept\nproposed in 1992 and has also become a popular paradigm and hot topic in public\nwhere DTs can play critical roles. This study first presents definitions,\napplications, and general challenges of DT and Metaverse. It then offers a\nthree-layer architecture linking the physical world to the Metaverse through a\nuser interface. Further, it investigates the security and privacy challenges of\nusing DTs in Metaverse. Finally, a conclusion, including possible solutions for\nmentioned challenges and future works, will be provided.", "source": "arxiv", "author": ["Saeed Banaeian Far", "Azadeh Imani Rad"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.11343", "citation": 4}
---------------------------------
{"title": "DiOS - An Extended Reality Operating System for the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Driven by the recent improvements in device and networks capabilities,\nExtended Reality (XR) is becoming more pervasive; industry and academia alike\nenvision ambitious projects such as the metaverse. However, XR is still limited\nby the current architecture of mobile systems. This paper makes the case for an\nXR-specific operating system (XROS). Such an XROS integrates hardware-support,\ncomputer vision algorithms, and XR-specific networking as the primitives\nsupporting XR technology. These primitives represent the physical-digital world\nas a single shared resource among applications. Such an XROS allows for the\ndevelopment of coherent and system-wide interaction and display methods,\nsystematic privacy preservation on sensor data, and performance improvement\nwhile simplifying application development.", "source": "arxiv", "author": ["Tristan Braud", "Lik-Hang Lee", "Ahmad Alhilal", "Carlos Bermejo Fernandez", "Pan Hui 0001"], "author_location": [], "link": "https://arxiv.org/abs/2201.03256", "citation": 5}
---------------------------------
{"title": "MetaChain: A Novel Blockchain-based Framework for Metaverse Applications.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse has recently attracted paramount attention due to its potential for\nfuture Internet. However, to fully realize such potential, Metaverse\napplications have to overcome various challenges such as massive resource\ndemands, interoperability among applications, and security and privacy\nconcerns. In this paper, we propose MetaChain, a novel blockchain-based\nframework to address emerging challenges for the development of Metaverse\napplications. In particular, by utilizing the smart contract mechanism,\nMetaChain can effectively manage and automate complex interactions among the\nMetaverse Service Provider (MSP) and the Metaverse users (MUs). In addition, to\nallow the MSP to efficiently allocate its resources for Metaverse applications\nand MUs' demands, we design a novel sharding scheme to improve the underlying\nblockchain's scalability. Moreover, to leverage MUs' resources as well as to\nattract more MUs to support Metaverse operations, we develop an incentive\nmechanism using the Stackelberg game theory that rewards MUs' contributions to\nthe Metaverse. Through numerical experiments, we clearly show the impacts of\nthe MUs' behaviors and how the incentive mechanism can attract more MUs and\nresources to the Metaverse.", "source": "arxiv", "author": ["Cong T. Nguyen", "Dinh Thai Hoang", "Diep N. Nguyen", "Eryk Dutkiewicz"], "author_location": [], "link": "https://arxiv.org/abs/2201.00759", "citation": 13}
---------------------------------
{"title": "Joint User Association and Resource Pricing for Metaverse: Distributed and Centralized Approaches.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse as the next-generation Internet provides users with\nphysical-virtual world interactions. To improve the quality of immersive\nexperience, users access to Metaverse service providers (MSPs) and purchase\nbandwidth resource to reduce the communication latency of the Metaverse\nservices. The MSPs decide selling price of the bandwidth resource to maximize\nthe revenue. This leads to a joint user association and resource pricing\nproblem between all users and MSPs. To tackle the problem, we formulate a\nStackelberg game where the MSPs are game leaders and users are game followers.\nWe resolve the Stackelberg equilibrium via the distributed and centralized\napproaches, according to different privacy requirements. In the distributed\napproach, the MSPs compete against each other to maximize the individual\nrevenue, and a user selects an MSP in a probabilistic manner. The Stackelberg\nequilibrium is achieved in a privacy-friendly way. In the centralized approach,\nall MSPs and users accept the unified management and their strategies are\ninstructed. The centralized approach acquires the superior decision-making\nperformance but sacrifices the privacy of the game players. Finally, we provide\nnumerical results to demonstrate the effectiveness and efficiency of our\nschemes.", "source": "arxiv", "author": ["Xumin Huang", "Weifeng Zhong", "Jiangtian Nie", "Qin Hu 0001", "Zehui Xiong", "Jiawen Kang", "Tony Q. S. Quek"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.06770", "citation": 0}
---------------------------------
{"title": "Rendering Spatial Sound for Interoperable Experiences in the Audio Metaverse.", "publish": "CoRR", "date": "2021", "abstract": "Interactive audio spatialization technology previously developed for video\ngame authoring and rendering has evolved into an essential component of\nplatforms enabling shared immersive virtual experiences for future co-presence,\nremote collaboration and entertainment applications. New wearable virtual and\naugmented reality displays employ real-time binaural audio computing engines\nrendering multiple digital objects and supporting the free navigation of\nnetworked participants or their avatars through a juxtaposition of\nenvironments, real and virtual, often referred to as the Metaverse. These\napplications require a parametric audio scene programming interface to\nfacilitate the creation and deployment of shared, dynamic and realistic virtual\n3D worlds on mobile computing platforms and remote servers.\n  We propose a practical approach for designing parametric 6-degree-of-freedom\nobject-based interactive audio engines to deliver the perceptually relevant\nbinaural cues necessary for audio/visual and virtual/real congruence in\nMetaverse experiences. We address the effects of room reverberation, acoustic\nreflectors, and obstacles in both the virtual and real environments, and\ndiscuss how such effects may be driven by combinations of pre-computed and\nreal-time acoustic propagation solvers. We envision an open scene description\nmodel distilled to facilitate the development of interoperable applications\ndistributed across multiple platforms, where each audio object represents, to\nthe user, a natural sound source having controllable distance, size,\norientation, and acoustic radiation properties.", "source": "arxiv", "author": ["Jean-Marc Jot", "Rémi Audfray", "Mark Hertensteiner", "Brian Schmidt"], "author_location": [], "link": "https://arxiv.org/abs/2109.12471", "citation": 17}
---------------------------------
{"title": "Advancing Education Through Extended Reality and Internet of Everything Enabled Metaverses: Applications, Challenges, and Open Issues.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse has evolved as one of the popular research agendas that let the\nusers learn, socialize, and collaborate in a networked 3D immersive virtual\nworld. Due to the rich multimedia streaming capability and immersive user\nexperience with high-speed communication, the metaverse is an ideal model for\neducation, training, and skill development tasks. To facilitate research in\nthis area, we provide a comprehensive review of the various educational use\ncases and explore how enabling technologies such as Extended reality (XR) and\nInternet of Everything (IoE) will play a major role in educational services in\nfuture metaverses. Secondly, we provide an overview of metaverse-based\neducational applications focusing on education, training, and skill development\nand analyze the technologies they are built upon. We identify common research\nproblems and future research directions in the domain. The paper also\nidentifies core ethical considerations of metaverse for education and potential\npitfalls. We believe this survey can fully demonstrate the versatility of\nmetaverse-driven education, which could serve as a potential guideline for the\nresearchers.", "source": "arxiv", "author": ["Senthil Kumar Jagatheesaperumal", "Kashif Ahmad", "Ala I. Al-Fuqaha", "Junaid Qadir 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2207.01512", "citation": 0}
---------------------------------
{"title": "When Creators Meet the Metaverse: A Survey on Computational Arts.", "publish": "CoRR", "date": "2021", "abstract": "The metaverse, enormous virtual-physical cyberspace, has brought\nunprecedented opportunities for artists to blend every corner of our physical\nsurroundings with digital creativity. This article conducts a comprehensive\nsurvey on computational arts, in which seven critical topics are relevant to\nthe metaverse, describing novel artworks in blended virtual-physical realities.\nThe topics first cover the building elements for the metaverse, e.g., virtual\nscenes and characters, auditory, textual elements. Next, several remarkable\ntypes of novel creations in the expanded horizons of metaverse cyberspace have\nbeen reflected, such as immersive arts, robotic arts, and other user-centric\napproaches fuelling contemporary creative outputs. Finally, we propose several\nresearch agendas: democratising computational arts, digital privacy, and safety\nfor metaverse artists, ownership recognition for digital artworks,\ntechnological challenges, and so on. The survey also serves as introductory\nmaterial for artists and metaverse technologists to begin creations in the\nrealm of surrealistic cyberspace.", "source": "arxiv", "author": ["Lik-Hang Lee", "Zijun Lin", "Rui Hu", "Zhengya Gong", "Abhishek Kumar", "Tangyao Li", "Sijia Li", "Pan Hui 0001"], "author_location": [], "link": "https://arxiv.org/abs/2111.13486", "citation": 23}
---------------------------------
{"title": "Being at Home in the Metaverse? Prospectus for a Social Imaginary.", "publish": "CoRR", "date": "2022", "abstract": "The metaverse has seen growing corporate and popular interest over the past\nfew years. While visions vary, the metaverse is generally seen as an extension\nof the internet that may be developed through advances in a number of digital\ntechnologies, such as augmented and virtual reality, as well as new technical\ninfrastructure and standards. The metaverse constitutes an emerging social\nimaginary, a way of both understanding and directing our shared existence. This\npaper examines this emerging social imaginary through the phenomenological\nconcept of dwelling, or being at home in the world, as developed by Martin\nHeidegger. To examine in depth one influential articulation of this social\nimaginary, this paper focuses on the metaverse as envisioned by Mark\nZuckerberg, CEO of Meta (formerly Facebook). The paper presents a thematic\nanalysis of Zuckerberg's public statements regarding the metaverse to provide a\nclose reading of this particular vision. Then, through the lens of Heidegger's\nphilosophy of dwelling, this paper identifies numerous threats to dwelling\nposed by the metaverse social imaginary. This paper explains these threats and\ntheir prognoses, and it closes with some considerations for how the metaverse\ncould be designed to better facilitate human dwelling.", "source": "arxiv", "author": ["Tim Gorichanaz"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.00559", "citation": 0}
---------------------------------
{"title": "Semantics and Non-Fungible Tokens for Copyright Management on the Metaverse and Beyond.", "publish": "CoRR", "date": "2022", "abstract": "Recent initiatives related to the Metaverse focus on better visualisation,\nlike augmented or virtual reality, but also persistent digital objects. To\nguarantee real ownership of these digital objects, open systems based on public\nblockchains and Non-Fungible Tokens (NFTs) are emerging together with a nascent\ndecentralized and open creator economy. To manage this emerging economy in a\nmore organised way, and fight the so common NFT plagiarism, we propose\nCopyrightLY, a decentralized application for authorship and copyright\nmanagement. It provides means to claim content authorship, including supporting\nevidence. Content and metadata are stored in decentralized storage and\nregistered on the blockchain. A token is used to curate these claims, and\npotential complaints, by staking it on them. Staking is incentivized by the\nfact that the token is minted using a bonding curve. The tokenomics include the\nresolution of complaints and enabling the monetization of curated claims.\nMonetization is achieved through licensing NFTs with metadata enhanced by\nsemantic technologies. Semantic data makes explicit the reuse conditions\ntransferred with the token while keeping the connection to the underlying\ncopyright claims to improve the trustability of the NFTs. Moreover, the\nsemantic metadata is flexible enough to enable licensing not just in the real\nworld. Licenses can refer to reuses in specific locations in a metaverse, thus\nfacilitating the emergence of creative economies in them.", "source": "arxiv", "author": ["Roberto García 0001", "Ana Cediel", "Mercè Teixidó", "Rosa Gil"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.14174", "citation": 0}
---------------------------------
{"title": "Exploring the Unprecedented Privacy Risks of the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Thirty study participants playtested an innocent-looking \"escape room\" game\nin virtual reality (VR). Behind the scenes, an adversarial program had\naccurately inferred over 25 personal data attributes, from anthropometrics like\nheight and wingspan to demographics like age and gender, within just a few\nminutes of gameplay. As notoriously data-hungry companies become increasingly\ninvolved in VR development, this experimental scenario may soon represent a\ntypical VR user experience. While virtual telepresence applications (and the\nso-called \"metaverse\") have recently received increased attention and\ninvestment from major tech firms, these environments remain relatively\nunder-studied from a security and privacy standpoint. In this work, we\nillustrate how VR attackers can covertly ascertain dozens of personal data\nattributes from seemingly-anonymous users of popular metaverse applications\nlike VRChat. These attackers can be as simple as other VR users without special\nprivilege, and the potential scale and scope of this data collection far exceed\nwhat is feasible within traditional mobile and web applications. We aim to shed\nlight on the unique privacy risks of the metaverse, and provide the first\nholistic framework for understanding intrusive data harvesting attacks in these\nemerging VR ecosystems.", "source": "arxiv", "author": ["Vivek Nair", "Gonzalo Munilla Garrido", "Dawn Song"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2207.13176", "citation": 0}
---------------------------------
{"title": "Matrix Syncer - A Multi-chain Data Aggregator For Supporting Blockchain-based Metaverses.", "publish": "CoRR", "date": "2022", "abstract": "Due to the rising complexity of the metaverse's business logic and the\nlow-latency nature of the metaverse, developers typically encounter the\nchallenge of effectively reading, writing, and retrieving historical on-chain\ndata in order to facilitate their functional implementations at scale. While it\nis true that accessing blockchain states is simple, more advanced real-world\noperations such as search, aggregation, and conditional filtering are not\navailable when interacting directly with blockchain networks, particularly when\ndealing with requirements for on-chain event reflection. We offer Matrix\nSyncer, the ultimate middleware that bridges the data access gap between\nblockchains and end-user applications. Matrix Syncer is designed to facilitate\nthe consolidation of on-chain information into a distributed data warehouse\nwhile also enabling customized on-chain state transformation for a scalable\nstorage, access, and retrieval. It offers a unified layer for both on- and\noff-chain state, as well as a fast and flexible atomic query. Matrix Syncer is\neasily incorporated into any infrastructure to aggregate data from various\nblockchains concurrently, such as Ethereum and Flow. The system has been\ndeployed to support several metaverse projects with a total value of more than\n$15 million USD.", "source": "arxiv", "author": ["Xinyao Sun", "Yi Lu", "Jinghan Sun", "Bohao Tang", "Kyle D. Rehak", "Shuyi Zhang"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2204.04272", "citation": 0}
---------------------------------
{"title": "Stochastic Resource Allocation for Semantic Communication-aided Virtual Transportation Networks in the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "The physical-virtual world synchronization to develop the Metaverse will\nrequire a massive transmission and exchange of data. In this paper, we\nintroduce semantic communication for the development of virtual transportation\nnetworks in the Metaverse. Leveraging the perception capabilities of edge\ndevices, virtual service providers (VSPs) can subscribe to their preferred edge\ndevices to receive the semantic data of interest. However, the demands of the\nVSPs are highly dependent on the users that they are serving. To address the\nresource allocation problem amid stochastic user demand, we propose a\nstochastic semantic transmission scheme (SSTS) based on two-stage stochastic\ninteger programming. Using real data captured by edge devices we deploy in\nSingapore, the simulation results show that SSTS can minimize the transmission\ncost of the VSPs while accounting for the users' demand uncertainties.", "source": "arxiv", "author": ["Wei Chong Ng", "Hongyang Du", "Wei Yang Bryan Lim", "Zehui Xiong", "Dusit Niyato", "Chunyan Miao"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2208.14661", "citation": 0}
---------------------------------
{"title": "Blockchain-based Federated Learning for Industrial Metaverses: Incentive Scheme with Optimal AoI.", "publish": "CoRR", "date": "2022", "abstract": "The emerging industrial metaverses realize the mapping and expanding\noperations of physical industry into virtual space for significantly upgrading\nintelligent manufacturing. The industrial metaverses obtain data from various\nproduction and operation lines by Industrial Internet of Things (IIoT), and\nthus conduct effective data analysis and decision-making, thereby enhancing the\nproduction efficiency of the physical space, reducing operating costs, and\nmaximizing commercial value. However, there still exist bottlenecks when\nintegrating metaverses into IIoT, such as the privacy leakage of sensitive data\nwith commercial secrets, IIoT sensing data freshness, and incentives for\nsharing these data. In this paper, we design a user-defined privacy-preserving\nframework with decentralized federated learning for the industrial metaverses.\nTo further improve privacy protection of industrial metaverse, a cross-chain\nempowered federated learning framework is further utilized to perform\ndecentralized, secure, and privacy-preserving data training on both physical\nand virtual spaces through a hierarchical blockchain architecture with a main\nchain and multiple subchains. Moreover, we introduce the age of information as\nthe data freshness metric and thus design an age-based contract model to\nmotivate data sensing among IIoT nodes. Numerical results indicate the\nefficiency of the proposed framework and incentive mechanism in the industrial\nmetaverses.", "source": "arxiv", "author": ["Jiawen Kang", "Dongdong Ye", "Jiangtian Nie", "Jiang Xiao", "Xianjun Deng", "Siming Wang", "Zehui Xiong", "Rong Yu", "Dusit Niyato"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2206.07384", "citation": 2}
---------------------------------
{"title": "Foundations for Grassroots Democratic Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "While the physical lives of many of us are in democracies (one person, one\nvote - e.g., the EU and the US), our digital lives are mostly in autocracies\n(one person, all votes - e.g., Facebook). Cryptocurrencies promise liberation\nbut stop short, at plutocracy (one coin, one vote). What would it take for us\nto live our digital lives in a digital democracy? This paper offers a vision, a\ntheoretical framework, and an architecture for a grassroots network of\nautonomous, people-owned, people-operated, and people-governed digital\ncommunities, namely a grassroots democratic metaverse. It also charts a roadmap\ntowards realizing it, and identifies unexplored territory for further research.", "source": "arxiv", "author": ["Ehud Shapiro", "Nimrod Talmon"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.04090", "citation": 1}
---------------------------------
{"title": "Metaverse: Security and Privacy Issues.", "publish": "CoRR", "date": "2022", "abstract": "The metaverse promises a host of bright opportunities for business,\neconomics, and society. Though, a number of critical aspects are still to be\nconsidered and the analysis of their impact is almost non-existent. In this\npaper, we provide several contributions. We start by analysing the foundations\nof the metaverse, later we focus on the novel privacy and security issues\nintroduced by this new paradigm, and finally we broaden the scope of the\ncontribution highlighting some of the far-reaching yet logical implications of\nthe metaverse on a number of domains, not all of them in tech. Throughout the\npaper, we also discuss possible research directions. We believe that the\nprovided holistic view on the foundations, technology, and issues related to\nthe metaverse-with a focus on security and privacy-, other than being an\ninteresting contribution on its own, could also pave the way for a few\nmultidisciplinary research avenues.", "source": "arxiv", "author": ["Roberto Di Pietro", "Stefano Cresci"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2205.07590", "citation": 14}
---------------------------------
{"title": "A Dynamic Resource Allocation Framework for Synchronizing Metaverse with IoT Service and Data.", "publish": "CoRR", "date": "2021", "abstract": "Spurred by the severe restrictions on mobility due to the COVID-19 pandemic,\nthere is currently intense interest in developing the Metaverse, to offer\nvirtual services/business online. A key enabler of such virtual service is the\ndigital twin, i.e., a digital replication of real-world entities in the\nMetaverse, e.g., city twin, avatars, etc. The real-world data collected by IoT\ndevices and sensors are key for synchronizing the two worlds. In this paper, we\nconsider the scenario in which a group of IoT devices are employed by the\nMetaverse platform to collect such data on behalf of virtual service providers\n(VSPs). Device owners, who are self-interested, dynamically select a VSP to\nmaximize rewards. We adopt hybrid evolutionary dynamics, in which heterogeneous\ndevice owner populations can employ different revision protocols to update\ntheir strategies. Extensive simulations demonstrate that a hybrid protocol can\nlead to evolutionary stable states.", "source": "arxiv", "author": ["Yue Han", "Dusit Niyato", "Cyril Leung", "Chunyan Miao", "Dong In Kim"], "author_location": [], "link": "https://arxiv.org/abs/2111.00431", "citation": 25}
---------------------------------
{"title": "Metaverse: Security and Privacy Concerns.", "publish": "CoRR", "date": "2022", "abstract": "The term \"metaverse\", a three-dimensional virtual universe similar to the\nreal realm, has always been full of imagination since it was put forward in the\n1990s. Recently, it is possible to realize the metaverse with the continuous\nemergence and progress of various technologies, and thus it has attracted\nextensive attention again. It may bring a lot of benefits to human society such\nas reducing discrimination, eliminating individual differences, and\nsocializing. However, everything has security and privacy concerns, which is no\nexception for the metaverse. In this article, we firstly analyze the concept of\nthe metaverse and propose that it is a super virtual-reality (VR) ecosystem\ncompared with other VR technologies. Then, we carefully analyze and elaborate\non possible security and privacy concerns from four perspectives: user\ninformation, communication, scenario, and goods, and immediately, the potential\nsolutions are correspondingly put forward. Meanwhile, we propose the need to\ntake advantage of the new buckets effect to comprehensively address security\nand privacy concerns from a philosophical perspective, which hopefully will\nbring some progress to the metaverse community.", "source": "arxiv", "author": ["Ruoyu Zhao", "Yushu Zhang", "Youwen Zhu", "Rushi Lan", "Zhongyun Hua"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2203.03854", "citation": 3}
---------------------------------
{"title": "Multi-Player Immersive Communications and Interactions in Metaverse: Challenges, Architecture, and Future Directions.", "publish": "CoRR", "date": "2022", "abstract": "The metaverse has awakened users' expectations of an immersive interaction\nthat fuses the virtual digital world and the physical world across space and\ntime. However, the metaverse is still in its infancy, typically expanding\nmulti-player applications (e.g., multi-player games) to implement a prototype\nwith the help of 5G/Beyond 5G, Artificial Intelligence, digital twin, and other\nenabling technologies. This article reviews the characteristics, key enabling\ntechnologies, and driving applications of the state-of-the-art metaverse. We\nfocus on the immersive interactions perspective of the metaverse from the\ntasks, inputs, and feedback across the users, digital world, and physical world\nand reveal the key challenges. Afterwards, we present a multi-player\ninteraction prototype platform based on a cloud-edge-device collaborative\nframework. Also, we evaluate it with centralized and device-to-device (D2D)\napproaches to verify the efficiency and flexibility of interactions. Finally,\nwe point out future research approaches and discuss potential solutions to\nenable more stable and higher quality multi-player interactions for metaverse\nservices.", "source": "arxiv", "author": ["Yakun Huang", "Xiuquan Qiao", "Haowen Wang", "Xiang Su", "Schahram Dustdar", "Ping Zhang"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.06802", "citation": 0}
---------------------------------
{"title": "A Trustless Architecture of Blockchain-enabled Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse has rekindled human beings' desire to further break space-time\nbarriers by fusing the virtual and real worlds. However, security and privacy\nthreats hinder us from building a utopia. A metaverse embraces various\ntechniques, while at the same time inheriting their pitfalls and thus exposing\nlarge attack surfaces. Blockchain, proposed in 2008, was regarded as a key\nbuilding block of metaverses. it enables transparent and trusted computing\nenvironments using tamper-resistant decentralized ledgers. Currently,\nblockchain supports Decentralized Finance (DeFi) and Non-fungible Tokens (NFT)\nfor metaverses. However, the power of a blockchain has not been sufficiently\nexploited. In this article, we propose a novel trustless architecture of\nblockchain-enabled metaverse, aiming to provide efficient resource integration\nand allocation by consolidating hardware and software components. To realize\nour design objectives, we provide an On-Demand Trusted Computing Environment\n(OTCE) technique based on local trust evaluation. Specifically, the\narchitecture adopts a hypergraph to represent a metaverse, in which each\nhyperedge links a group of users with certain relationship. Then the trust\nlevel of each user group can be evaluated based on graph analytics techniques.\nBased on the trust value, each group can determine its security plan on demand,\nfree from interference by irrelevant nodes. Besides, OTCEs enable large-scale\nand flexible application environments (sandboxes) while preserving a strong\nsecurity guarantee.", "source": "arxiv", "author": ["Minghui Xu 0001", "Yihao Guo", "Qin Hu 0001", "Zehui Xiong", "Dongxiao Yu", "Xiuzhen Cheng 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.12655", "citation": 0}
---------------------------------
{"title": "Facial Landmark Predictions with Applications to Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "This research aims to make metaverse characters more realistic by adding lip\nanimations learnt from videos in the wild. To achieve this, our approach is to\nextend Tacotron 2 text-to-speech synthesizer to generate lip movements together\nwith mel spectrogram in one pass. The encoder and gate layer weights are\npre-trained on LJ Speech 1.1 data set while the decoder is retrained on 93\nclips of TED talk videos extracted from LRS 3 data set. Our novel decoder\npredicts displacement in 20 lip landmark positions across time, using labels\nautomatically extracted by OpenFace 2.0 landmark predictor. Training converged\nin 7 hours using less than 5 minutes of video. We conducted ablation study for\nPre/Post-Net and pre-trained encoder weights to demonstrate the effectiveness\nof transfer learning between audio and visual speech data.", "source": "arxiv", "author": ["Qiao Han", "Jun Zhao 0007", "Kwok-Yan Lam"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.14698", "citation": 0}
---------------------------------
{"title": "MetaSpeech: Speech Effects Switch Along with Environment for Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse expands the physical world to a new dimension, and the physical\nenvironment and Metaverse environment can be directly connected and entered.\nVoice is an indispensable communication medium in the real world and Metaverse.\nFusion of the voice with environment effects is important for user immersion in\nMetaverse. In this paper, we proposed using the voice conversion based method\nfor the conversion of target environment effect speech. The proposed method was\nnamed MetaSpeech, which introduces an environment effect module containing an\neffect extractor to extract the environment information and an effect encoder\nto encode the environment effect condition, in which gradient reversal layer\nwas used for adversarial training to keep the speech content and speaker\ninformation while disentangling the environmental effects. From the experiment\nresults on the public dataset of LJSpeech with four environment effects, the\nproposed model could complete the specific environment effect conversion and\noutperforms the baseline methods from the voice conversion task.", "source": "arxiv", "author": ["Xulong Zhang 0001", "Jianzong Wang", "Ning Cheng", "Jing Xiao 0006"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.13811", "citation": 0}
---------------------------------
{"title": "Reducing Stress and Anxiety in the Metaverse: A Systematic Review of Meditation, Mindfulness and Virtual Reality.", "publish": "CoRR", "date": "2022", "abstract": "Meditation, or mindfulness, is widely used to improve mental health. With the\nemergence of Virtual Reality technology, many studies have provided evidence\nthat meditation with VR can bring health benefits. However, to our knowledge,\nthere are no guidelines and comprehensive reviews in the literature on how to\nconduct such research in virtual reality. In order to understand the role of VR\ntechnology in meditation and future research opportunities, we conducted a\nsystematic literature review in the IEEE and ACM databases. Our process yielded\n19 eligible papers and we conducted a structured analysis. We understand the\nstate-of-art of meditation type, design consideration and VR and technology\nthrough these papers and conclude research opportunities and challenges for the\nfuture.", "source": "arxiv", "author": ["Xian Wang", "Xiaoyu Mo", "Mingming Fan 0001", "Lik-Hang Lee", "Bertram E. Shi", "Pan Hui 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.14645", "citation": 0}
---------------------------------
{"title": "Software Product Line for Metaverse: Preliminary Results.", "publish": "CoRR", "date": "2022", "abstract": "The Metaverse is a network of eXtended Reality applications (XR apps)\nconnected to each other, over the Internet infrastructure, allowing network\nusers, systems, and devices to access them. It is very challenging to implement\nsolutions for XR apps, due to the combination of complex concerns that should\nbe addressed: multiple users with non-traditional input and output devices,\ndifferent hardware platforms that should be addressed, forceful interactive\nrates, and experimental interaction techniques, among other issues. Therefore,\nthis work aims to present a Software Product Line (SPL)-based approach to\nsupport the development of Web XR apps. More specifically, we define a features\nmodel that represents similarities and variables (domain analysis); we defined\na core composed of generic and reusable software artifacts (domain project);\nand we developed an interface to support the instantiation of a Web XR app\nfamily, named MetaSee Features Model Editor (domain implementation). This\napproach integrates with a component of the MetaSEE architecture (Metaverse for\nSoftware Engineering Education). A preliminary assessment found that Features\nModel has conceptual consistency from the point of view of the complexity of\nWeb XR Apps multimodal interaction. As future work, features model and\nartifacts will be increased with improvements and an evaluation with a\nsignificant number of participants will be made.", "source": "arxiv", "author": ["Filipe Fernandes", "Cláudia M. L. Werner"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.10967", "citation": 0}
---------------------------------
{"title": "Secure and Trustworthy Artificial Intelligence-Extended Reality (AI-XR) for Metaverses.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse is expected to emerge as a new paradigm for the next-generation\nInternet, providing fully immersive and personalised experiences to socialize,\nwork, and play in self-sustaining and hyper-spatio-temporal virtual world(s).\nThe advancements in different technologies like augmented reality, virtual\nreality, extended reality (XR), artificial intelligence (AI), and 5G/6G\ncommunication will be the key enablers behind the realization of AI-XR\nmetaverse applications. While AI itself has many potential applications in the\naforementioned technologies (e.g., avatar generation, network optimization,\netc.), ensuring the security of AI in critical applications like AI-XR\nmetaverse applications is profoundly crucial to avoid undesirable actions that\ncould undermine users' privacy and safety, consequently putting their lives in\ndanger. To this end, we attempt to analyze the security, privacy, and\ntrustworthiness aspects associated with the use of various AI techniques in\nAI-XR metaverse applications. Specifically, we discuss numerous such challenges\nand present a taxonomy of potential solutions that could be leveraged to\ndevelop secure, private, robust, and trustworthy AI-XR applications. To\nhighlight the real implications of AI-associated adversarial threats, we\ndesigned a metaverse-specific case study and analyzed it through the\nadversarial lens. Finally, we elaborate upon various open issues that require\nfurther research interest from the community.", "source": "arxiv", "author": ["Adnan Qayyum", "Muhammad Atif Butt", "Hassan Ali", "Muhammad U. Usman", "Osama Halabi", "Ala I. Al-Fuqaha", "Qammer H. Abbasi", "Muhammad Ali Imran 0001", "Junaid Qadir 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.13289", "citation": 0}
---------------------------------
{"title": "Resource Allocation and Resolution Control in the Metaverse with Mobile Augmented Reality.", "publish": "CoRR", "date": "2022", "abstract": "With the development of blockchain and communication techniques, the\nMetaverse is considered as a promising next-generation Internet paradigm, which\nenables the connection between reality and the virtual world. The key to\nrendering a virtual world is to provide users with immersive experiences and\nvirtual avatars, which is based on virtual reality (VR) technology and high\ndata transmission rate. However, current VR devices require intensive\ncomputation and communication, and users suffer from high delay while using\nwireless VR devices. To build the connection between reality and the virtual\nworld with current technologies, mobile augmented reality (MAR) is a feasible\nalternative solution due to its cheaper communication and computation cost.\nThis paper proposes an MAR-based connection model for the Metaverse, and\nproposes a communication resources allocation algorithm based on outer\napproximation (OA) to achieve the best utility. Simulation results show that\nour proposed algorithm is able to provide users with basic MAR services for the\nMetaverse, and outperforms the benchmark greedy algorithm.", "source": "arxiv", "author": ["Peiyuan Si", "Jun Zhao", "Huimei Han", "Kwok-Yan Lam", "Yang Liu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.13871", "citation": 0}
---------------------------------
{"title": "Mobile Edge Computing, Metaverse, 6G Wireless Communications, Artificial Intelligence, and Blockchain: Survey and Their Convergence.", "publish": "CoRR", "date": "2022", "abstract": "With the advances of the Internet of Things (IoT) and 5G/6G wireless\ncommunications, the paradigms of mobile computing have developed dramatically\nin recent years, from centralized mobile cloud computing to distributed fog\ncomputing and mobile edge computing (MEC). MEC pushes compute-intensive\nassignments to the edge of the network and brings resources as close to the\nendpoints as possible, addressing the shortcomings of mobile devices with\nregard to storage space, resource optimisation, computational performance and\nefficiency. Compared to cloud computing, as the distributed and closer\ninfrastructure, the convergence of MEC with other emerging technologies,\nincluding the Metaverse, 6G wireless communications, artificial intelligence\n(AI), and blockchain, also solves the problems of network resource allocation,\nmore network load as well as latency requirements. Accordingly, this paper\ninvestigates the computational paradigms used to meet the stringent\nrequirements of modern applications. The application scenarios of MEC in mobile\naugmented reality (MAR) are provided. Furthermore, this survey presents the\nmotivation of MEC-based Metaverse and introduces the applications of MEC to the\nMetaverse. Particular emphasis is given on a set of technical fusions mentioned\nabove, e.g., 6G with MEC paradigm, MEC strengthened by blockchain, etc.", "source": "arxiv", "author": ["Yitong Wang", "Jun Zhao"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.14147", "citation": 0}
---------------------------------
{"title": "Mobility Aware Optimization in the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse applications that incorporate Mobile Augmented Reality (MAR)\nprovide mixed and immersive experiences by amalgamating the virtual with the\nphysical world. Notably, due to their multi-modality such applications are\ndemanding in terms of energy consumption, computing and caching resources to\nefficiently support foreground interactions of participating users and rich\nbackground content. In this paper, the metaverse service is decomposed and\nanchored at suitable edge caching/computing nodes in 5G and beyond networks to\nenable efficient processing of background metaverse region models embedded with\ntarget AROs. To achieve that, a joint optimization problem is proposed, which\nexplicitly considers the user physical mobility, service decomposition, and the\nbalance between service delay, user perception quality and power consumption. A\nwide set of numerical investigations reveal that, the proposed scheme could\nprovide optimal decision making and outperform other nominal baseline schemes\nwhich are oblivious of user mobility as well as do not consider service\ndecomposition.", "source": "arxiv", "author": ["Zhaohui Huang", "Vasilis Friderikos"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.08899", "citation": 0}
---------------------------------
{"title": "Integrating Digital Twin and Advanced Intelligent Technologies to Realize the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "The advances in Artificial Intelligence (AI) have led to technological\nadvancements in a plethora of domains. Healthcare, education, and smart city\nservices are now enriched with AI capabilities. These technological\nadvancements would not have been realized without the assistance of fast,\nsecure, and fault-tolerant communication media. Traditional processing,\ncommunication and storage technologies cannot maintain high levels of\nscalability and user experience for immersive services. The metaverse is an\nimmersive three-dimensional (3D) virtual world that integrates fantasy and\nreality into a virtual environment using advanced virtual reality (VR) and\naugmented reality (AR) devices. Such an environment is still being developed\nand requires extensive research in order for it to be realized to its highest\nattainable levels. In this article, we discuss some of the key issues required\nin order to attain realization of metaverse services. We propose a framework\nthat integrates digital twin (DT) with other advanced technologies such as the\nsixth generation (6G) communication network, blockchain, and AI, to maintain\ncontinuous end-to-end metaverse services. This article also outlines\nrequirements for an integrated, DT-enabled metaverse framework and provides a\nlook ahead into the evolving topic.", "source": "arxiv", "author": ["Moayad Aloqaily", "Ouns Bouachir", "Fakhri Karray", "Ismaeel Al Ridhawi", "Abdulmotaleb El-Saddik"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.04606", "citation": 0}
---------------------------------
{"title": "Identity, Crimes, and Law Enforcement in the Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "With the boom in metaverse-related projects in major areas of the public's\nlife, the safety of users becomes a pressing concern. We believe that an\ninternational legal framework should be established to promote collaboration\namong nations, facilitate crime investigation, and support democratic\ngovernance. In this paper, we discuss the legal concerns of identity, crimes\nthat could occur based on incidents in existing virtual worlds, and challenges\nto unified law enforcement in the metaverse.", "source": "arxiv", "author": ["Hua Xuan Qin", "Yuyang Wang", "Pan Hui 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.06134", "citation": 0}
---------------------------------
{"title": "DHR: Distributed Hybrid Rendering for Metaverse Experiences.", "publish": "CoRR", "date": "2022", "abstract": "Classically, rasterization techniques are performed for real-time rendering\nto meet the constraint of interactive frame rates. However, such techniques do\nnot produce realistic results as compared to ray tracing approaches. Hence,\nhybrid rendering has emerged to improve the graphics fidelity of rasterization\nwith ray tracing in real-time. We explore the approach of distributed rendering\nin incorporating real-time hybrid rendering into metaverse experiences for\nimmersive graphics. In standalone extended reality (XR) devices, such ray\ntracing-enabled graphics is only feasible through pure cloud-based remote\nrendering systems that rely on low-latency networks to transmit real-time\nray-traced data in response to interactive user input. Under high network\nlatency conditions, remote rendering might not be able to maintain interactive\nframe rates for the client, adversely affecting the user experience. We adopt\nhybrid rendering via a distributed rendering approach by integrating ray\ntracing on powerful remote hardware with raster-based rendering on user access\ndevices. With this hybrid approach, our technique can help standalone XR\ndevices achieve ray tracing-incorporated graphics and maintain interactive\nframe rates even under high-latency conditions.", "source": "arxiv", "author": ["Yu Wei Tan", "Alden Tan", "Nicholas Nge", "Anand Bhojan"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.15835", "citation": 0}
---------------------------------
{"title": "Resource Allocation for Mobile Metaverse with the Internet of Vehicles over 6G Wireless Communications: A Deep Reinforcement Learning Approach.", "publish": "CoRR", "date": "2022", "abstract": "Improving the interactivity and interconnectivity between people is one of\nthe highlights of the Metaverse. The Metaverse relies on a core approach,\ndigital twinning, which is a means to replicate physical world objects, people,\nactions and scenes onto the virtual world. Being able to access scenes and\ninformation associated with the physical world, in the Metaverse in real-time\nand under mobility, is essential in developing a highly accessible, interactive\nand interconnective experience for all users. This development allows users\nfrom other locations to access high-quality real-world and up-to-date\ninformation about events happening in another location, and socialize with\nothers hyper-interactively. Nevertheless, receiving continual, smooth updates\ngenerated by others from the Metaverse is a challenging task due to the large\ndata size of the virtual world graphics and the need for low latency\ntransmission. With the development of Mobile Augmented Reality (MAR), users can\ninteract via the Metaverse in a highly interactive manner, even under mobility.\nHence in our work, we considered an environment with users in moving Internet\nof Vehicles (IoV), downloading real-time virtual world updates from Metaverse\nService Provider Cell Stations (MSPCSs) via wireless communications. We design\nan environment with multiple cell stations, where there will be a handover of\nusers' virtual world graphic download tasks between cell stations. As\ntransmission latency is the primary concern in receiving virtual world updates\nunder mobility, our work aims to allocate system resources to minimize the\ntotal time taken for users in vehicles to download their virtual world scenes\nfrom the cell stations. We utilize deep reinforcement learning and evaluate the\nperformance of the algorithms under different environmental configurations. Our\nwork provides a use case of the Metaverse over AI-enabled 6G communications.", "source": "arxiv", "author": ["Terence Jie Chua", "Wenhan Yu", "Jun Zhao"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.13425", "citation": 2}
---------------------------------
{"title": "Metaverse for Healthcare: A Survey on Potential Applications, Challenges and Future Directions.", "publish": "CoRR", "date": "2022", "abstract": "The rapid progress in digitalization and automation have led to an\naccelerated growth in healthcare, generating novel models that are creating new\nchannels for rendering treatment with reduced cost. The Metaverse is an\nemerging technology in the digital space which has huge potential in\nhealthcare, enabling realistic experiences to the patients as well as the\nmedical practitioners. The Metaverse is a confluence of multiple enabling\ntechnologies such as artificial intelligence, virtual reality, augmented\nreality, internet of medical devices, robotics, quantum computing, etc. through\nwhich new directions for providing quality healthcare treatment and services\ncan be explored. The amalgamation of these technologies ensures immersive,\nintimate and personalized patient care. It also provides adaptive intelligent\nsolutions that eliminates the barriers between healthcare providers and\nreceivers. This article provides a comprehensive review of the Metaverse for\nhealthcare, emphasizing on the state of the art, the enabling technologies for\nadopting the Metaverse for healthcare, the potential applications and the\nrelated projects. The issues in the adaptation of the Metaverse for healthcare\napplications are also identified and the plausible solutions are highlighted as\npart of future research directions.", "source": "arxiv", "author": ["Rajeswari Chengoden", "Nancy Victor", "Thien Huynh-The", "Gokul Yenduri", "Rutvij H. Jhaveri", "Mamoun Alazab", "Sweta Bhattacharya", "Pawan Hegde", "Praveen Kumar Reddy Maddikunta", "Thippa Reddy Gadekallu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.04160", "citation": 3}
---------------------------------
{"title": "Vetaverse: Technologies, Applications, and Visions toward the Intersection of Metaverse, Vehicles, and Transportation Systems.", "publish": "CoRR", "date": "2022", "abstract": "Since 2021, the term \"Metaverse\" has been the most popular one, garnering a\nlot of interest. Because of its contained environment and built-in computing\nand networking capabilities, a modern car makes an intriguing location to host\nits own little metaverse. Additionally, the travellers don't have much to do to\npass the time while traveling, making them ideal customers for immersive\nservices. Vetaverse (Vehicular-Metaverse), which we define as the future\ncontinuum between vehicular industries and Metaverse, is envisioned as a\nblended immersive realm that scales up to cities and countries, as digital\ntwins of the intelligent Transportation Systems, referred to as \"TS-Metaverse\",\nas well as customized XR services inside each Individual Vehicle, referred to\nas \"IV-Metaverse\". The two subcategories serve fundamentally different\npurposes, namely long-term interconnection, maintenance, monitoring, and\nmanagement on scale for large transportation systems (TS), and personalized,\nprivate, and immersive infotainment services (IV). By outlining the framework\nof Vetaverse and examining important enabler technologies, we reveal this\nimpending trend. Additionally, we examine unresolved issues and potential\nroutes for future study while highlighting some intriguing Vetaverse services.", "source": "arxiv", "author": ["Pengyuan Zhou", "Jinjing Zhu", "Yiting Wang", "Yunfan Lu", "Zixiang Wei", "Haolin Shi", "Yuchen Ding", "Yu Gao", "Qinglong Huang", "Yan Shi", "Ahmad Yousef Alhilal", "Lik-Hang Lee", "Tristan Braud", "Pan Hui 0001", "Lin Wang"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.15109", "citation": 0}
---------------------------------
{"title": "Metaverse: Survey, Applications, Security, and Opportunities.", "publish": "CoRR", "date": "2022", "abstract": "As a fusion of various emerging digital technologies, the Metaverse aims to\nbuild a virtual shared digital space. It is closely related to extended\nreality, digital twin, blockchain, and other technologies. Its goal is to build\na digital space based on the real world, form a virtual economic system, and\nexpand the space of human activities, which injects new vitality into the\nsocial, economic, and other fields. In this article, we make the following\ncontributions. We first introduce the basic concepts such as the development\nprocess, definition, and characteristics of the Metaverse. After that, we\nanalyze the overall framework and supporting technologies of the Metaverse and\nsummarize the status of common fields. Finally, we focus on the security and\nprivacy issues that exist in the Metaverse, and give corresponding solutions or\ndirections. We also discuss the challenges and possible research directions of\nthe Metaverse. We believe this comprehensive review can provide an overview of\nthe Metaverse and research directions for some multidisciplinary studies.", "source": "arxiv", "author": ["Jiayi Sun", "Wensheng Gan", "Han-Chieh Chao", "Philip S. Yu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.07990", "citation": 0}
---------------------------------
{"title": "Security of Virtual Reality Authentication Methods in Metaverse: An Overview.", "publish": "CoRR", "date": "2022", "abstract": "The metaverse is said to be the future Internet and will consist of several\nworlds called verses. This concept is being discussed a lot lately, however,\nthe security issues of these virtual worlds are not discussed enough. This\nstudy first discusses the privacy and security concerns of the metaverse.\nVirtual reality headsets are the main devices used to access the Metaverse. The\nuser needs to verify their identity to log in to the metaverse platforms, and\nthe security of this phase becomes vital. This paper aims to compare the\nsecurity of the main authentication methods that are used in virtual reality\nenvironments. Information-based, biometric, and multi-model methods are\ncompared and analyzed in terms of security. These methods aim to verify the\nuser with different data types such as 3D patterns, PIN systems, or biometric\ndata. The pros and cons are discussed. The paper also concludes with what work\ncan be done to improve the safety of these authentication methods and future\nwork.", "source": "arxiv", "author": ["Pinar Kürtünlüoglu", "Beste Akdik", "Enis Karaarslan"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.06447", "citation": 3}
---------------------------------
{"title": "Big Data Meets Metaverse: A Survey.", "publish": "CoRR", "date": "2022", "abstract": "We are living in the era of big data. The Metaverse is an emerging technology\nin the future, and it has a combination of big data, AI (artificial\nintelligence), VR (Virtual Reality), AR (Augmented Reality), MR (mixed\nreality), and other technologies that will diminish the difference between\nonline and real-life interaction. It has the goal of becoming a platform where\nwe can work, go shopping, play around, and socialize. Each user who enters the\nMetaverse interacts with the virtual world in a data way. With the development\nand application of the Metaverse, the data will continue to grow, thus forming\na big data network, which will bring huge data processing pressure to the\ndigital world. Therefore, big data processing technology is one of the key\ntechnologies to implement the Metaverse. In this survey, we provide a\ncomprehensive review of how Metaverse is changing big data. Moreover, we\ndiscuss the key security and privacy of Metaverse big data in detail. Finally,\nwe summarize the open problems and opportunities of Metaverse, as well as the\nfuture of Metaverse with big data. We hope that this survey will provide\nresearchers with the research direction and prospects of applying big data in\nthe Metaverse.", "source": "arxiv", "author": ["Jiayi Sun", "Wensheng Gan", "Zefeng Chen", "Junhui Li", "Philip S. Yu"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2210.16282", "citation": 2}
---------------------------------
{"title": "A Secure Authentication Framework to Guarantee the Traceability of Avatars in Metaverse.", "publish": "CoRR", "date": "2022", "abstract": "Metaverse is a vast virtual environment parallel to the physical world in\nwhich users enjoy a variety of services acting as an avatar. To build a secure\nliving habitat, it's vital to ensure the virtual-physical traceability that\ntracking a malicious player in the physical world via his avatars in virtual\nspace. In this paper, we propose a two-factor authentication framework based on\nchameleon signature and biometric-based authentication. First, aiming at\ndisguise in virtual space, we propose a chameleon collision signature algorithm\nto achieve the verifiability of the avatar's virtual identity. Second, facing\nat impersonation in physical world, we construct an avatar's identity model\nbased on the player's biometric template and the chameleon key to realize the\nverifiability of the avatar's physical identity. Finally, we design two\ndecentralized authentication protocols based on the avatar's identity model to\nensure the consistency of the avatar's virtual and physical identities.\nSecurity analysis indicates that the proposed authentication framework\nguarantees the consistency and traceability of avatar's identity. Simulation\nexperiments show that the framework not only completes the decentralized\nauthentication between avatars but also achieves the virtual-physical tracking.", "source": "arxiv", "author": ["Kedi Yang", "Zhenyong Zhang", "Youliang Tian", "Jianfeng Ma 0001"], "author_location": [], "link": "https://doi.org/10.48550/arXiv.2209.08893", "citation": 0}
---------------------------------