{"title": "Experiment of metaverse learning method using anatomical 3D object.", "date": 2009, "publish": "VRCAI", "abstract": "We created anatomical 3D objects regarding eye mechanism in Second life as learning materials. We conducted several substantiative experiments to prove how much understanding of participants of the experiments could improve their knowledge by lecturing with these objects. The 3D objects which we created provide an artificial experience which we can never have in the actual world. For instance, we can see a huge eye ball and we can enter inside of it. Enjoyment and excitement through such an artificial experience becomes a trigger of arousing our motivation for learning and bring us deep understanding.", "source": "acm", "author": ["Yayoi Itoh", "Yang Chen", "Kazuhiko Iida", "Mamoru Shiiki", "Keiji Mitsubuchi"], "author_location": ["Digital Hollywood The Graduate School", "Digital Hollywood The Graduate School", "Digital Hollywood The Graduate School", "Digital Hollywood The Graduate School"], "keywords": [], "link": "https://doi.org/10.1145/1670252.1670315\n", "country": ["jp", "jp", "jp", "jp"], "ctmighterror": [], "citation": 0}
---------------------------------
{"title": "Augmented duality: overlapping a metaverse with the real world.", "date": 2008, "publish": "Advances in Computer Entertainment Technology", "abstract": "The advent of metaverses provide exciting opportunities for augmented reality research. We have created a number of interactions between the metaverse Second Life and the real world. Camera phone image matching creates portals and triggers the metaverse to mimic real locations. Image processing, tracking, projection and 3D video sprites create varied possibilities for people and avatars to have presence in each others worlds.", "source": "acm", "author": ["Mark Wright", "Henrik Ekeus 0002", "Richard Coyne", "James Stewart", "Penny Travlou", "Robin Williams"], "author_location": ["University of Edinburgh", "University of Edinburgh", "University of Edinburgh", "University of Edinburgh", "Edinburgh College of Art", "University of Edinburgh"], "keywords": [], "link": "https://doi.org/10.1145/1501750.1501812\n", "country": ["gb", "gb", "gb", "gb", "gb", "gb"], "ctmighterror": [], "citation": 13}
---------------------------------
{"title": "H-link 3D: hyper-learning interface and navigational toolkit in 3D virtual worlds experimental interface design for cobalt, a Croquet metaverse.", "date": 2009, "publish": "SIGGRAPH Posters", "abstract": "With today's increased interest in advanced digital networking and social online communities, many higher educational institutes have been exploring online three-dimensional virtual environments as a new medium for distance learning. These technologies provide multiple features for online interaction and collaboration, a visual cyberspace for text and voice communication, the ability to manipulate multimedia in real time with a group of individuals, and the opportunity to link users to Web sites.", "source": "acm", "author": ["Saba Hashem Kawas"], "author_location": ["Arts and Design|Animation and New Media"], "keywords": [], "link": "https://doi.org/10.1145/1599301.1599316\n", "country": ["hk"], "ctmighterror": [], "citation": 0}
---------------------------------
{"title": "Survey of national/culture specific tendencies of avatars in the diversifying metaverse.", "date": 2008, "publish": "SIGGRAPH Posters", "abstract": "No abstract available.", "source": "acm", "author": ["Motoyoshi Hirata", "Keiji Mitsubuchi", "Koh Sueda"], "author_location": ["Digital Hollywood Univ.", "Digital Hollywood Univ.", "The University of Tokyo"], "keywords": [], "link": "https://doi.org/10.1145/1400885.1401031\n", "country": ["jp", "jp", "jp"], "ctmighterror": [], "citation": 0}
---------------------------------
{"title": "The Social Metaverse: Battle for Privacy.", "date": "2018", "publish": "IEEE Technol. Soc. Mag.", "abstract": "Recent advances in technology are rapidly changing the way we interact with the physical world around us. As a result, our digital footprint and digital breadcrumbs are tracked and can reveal not just our identity but also our location, age, shopping preferences, friends, favorite movies, and much more. In the worst case, such tracking may lead to hostile entities coming to know your highly sensitive information such as credit card numbers, social security identity numbers, mother\\'s maiden name, medical history, bank account information, and so on. Social engineering [1] is one of several related ways that this data becomes jeopardized. Furthermore, Internet-connected cameras allow consumers, companies, and government agencies to record animate and inanimate objects in a specific geographic area. Such recordings may be stored in cloud-based storage farms, viewed by humans, or analyzed by machines for various purposes. The information can be gathered and interpreted in multiple ways, such as by surveillance cameras, and can include activity and location inference as well as aggregation and pattern detection.", "source": "ieee", "author": ["Ben Falchuk", "Shoshana Loeb", "Ralph Neff"], "author_location": ["Vencore Labs, NJ, U.S.A.", "Open Ventures L.L.C., PA, U.S.A.", "InterDigital, Inc., DE, U.S.A."], "keywords": [], "link": "https://doi.org/10.1109/MTS.2018.2826060", "country": ["us", "us", "us"], "ctmighterror": [], "citation": 51}
---------------------------------
{"title": "Scanning the Literature - From AR/VR to Metaverse.", "date": "2021", "publish": "IEEE Netw.", "abstract": "This column provides concise summaries of selected papers that have recently been published in the field of networking. Each summary describes the paper’s main idea, methodology, and technical contributions. The purpose of the column is to bring the state of the art of networking research to readers of IEEE Network. Authors are also welcome to recommend their recently published work to the column, and papers with novel ideas, solid work, and significant contributions to the field are especially appreciated. Authors wishing to have their papers presented in the column should contact the Editor. ", "source": "ieee", "author": ["Xiaohua Tian"], "author_location": ["Shanghai Jiao Tong University"], "keywords": [], "link": "https://doi.org/10.1109/MNET.2021.9687532", "country": ["cn"], "ctmighterror": [], "citation": 0}
---------------------------------
{"title": "Digital Scent Technology: Toward the Internet of Senses and the Metaverse.", "date": "2022", "publish": "IT Prof.", "abstract": "Multisensory technologies have paved the way for the collective transfer and sharing of the senses on the Internet. The Human-Computer Interaction (HCI) community considers digital olfactory stimulation to be a helpful step in developing technology related to digital multisensory communication. This article provides a brief overview of digital scent technology through the recent electrical interfaces and past commercial efforts using chemical odors. We present the practical application of technology in the field of digital communication, marketing, and well being. We also discuss the commercial use of the Internet of Senses (IoS) and its cornerstone IMT-2030 (6G), contributing to the intimate nature of multisensory experiences from reality. Finally, we observe a symbiotic relationship between the future technologies of the IoS and the Metaverse, with 6G being the connecting link and the primary activator of the multisensory experiences.", "source": "ieee", "author": ["Dimitrios Panagiotakopoulos", "Georgios N. Marentakis", "Rossetos Metzitakos", "Ioannis Deliyannis", "Fanourios Dedes"], "author_location": ["University of West Attica, Athens, Greece", "Østfold University College, Halden, Norway", "University of West Attica, Athens, Greece", "Ionian University, Corfu, Greece", "Fanourios Dedes"], "keywords": [], "link": "https://doi.org/10.1109/MITP.2022.3177292", "country": ["gr", "no", "gr", "gr", "gr"], "ctmighterror": [], "citation": 0}
---------------------------------
{"title": "A Dynamic Resource Allocation Framework for Synchronizing Metaverse with IoT Service and Data.", "date": "2022", "publish": "ICC", "abstract": "Spurred by the severe restrictions on mobility due to the COVID-19 pandemic, there is currently intense interest in developing the Metaverse, to offer virtual services/business online. A key enabler of such virtual service is the digital twin, i.e., a digital replication of real-world entities in the Metaverse, e.g., city twin, avatars, etc. The real-world data collected by IoT devices and sensors are key for synchronizing the two worlds. In this paper, we consider the scenario in which a group of IoT devices are employed by the Metaverse platform to collect such data on behalf of virtual service providers (VSPs). Device owners, who are self-interested, dynamically select a VSP to maximize rewards. We adopt hybrid evolutionary dynamics, in which heterogeneous device owner populations can employ different revision protocols to update their strategies. Extensive simulations demonstrate that a hybrid protocol can lead to evolutionary stable states.", "source": "ieee", "author": ["Yue Han", "Dusit Niyato", "Cyril Leung", "Chunyan Miao", "Dong In Kim"], "author_location": ["SCSE, NTU", "SCSE, NTU", "The University of British Columbia", "SCSE, NTU", "Sungkyunkwan University"], "keywords": [], "link": "https://doi.org/10.1109/ICC45855.2022.9838422", "country": ["sg", "sg", "ca", "sg", "kr"], "ctmighterror": [], "citation": 25}
---------------------------------
{"title": "Scaling-up AR: University Campus as a Physical-Digital Metaverse.", "date": "2022", "publish": "VR Workshops", "abstract": "The metaverse promises large-scale and persistent environments for users to share experiences at the intersection between physical and digital. Augmented reality (AR) is one of the primary technologies that supports blending digital content with physical environments. However, most AR applications are currently single-user and present significant constraints in terms of time and location. Scaling up the technology to large-sized environments and massively multi-user experiences thus represents one of the primary challenges to achieving such a vision. Due to these constraints, current proposals for the metaverse primarily consist of virtual worlds with little duality between physical and digital. This paper studies the feasibility of a large-scale and persistent AR experience shared among all visitors on our university campus. We define an integrated framework to enable the first AR campus metaverse by considering the nature of the various environments and the available sensing platforms.", "source": "ieee", "author": ["Tristan Braud", "Carlos Bermejo Fernandez", "Pan Hui 0001"], "author_location": ["The Hong Kong University of Science and Technology", "The Hong Kong University of Science and Technology", "The Hong Kong University of Science and Technology"], "keywords": [], "link": "https://doi.org/10.1109/VRW55335.2022.00044", "country": ["hk", "hk", "hk"], "ctmighterror": [], "citation": 5}
---------------------------------
{"title": "Reading Social Media Marketing Messages as Simulated Self Within a Metaverse: An Analysis of Gaze and Social Media Engagement Behaviors within a Metaverse Platform.", "date": "2022", "publish": "VR Workshops", "abstract": "The current paper discusses how individuals will process social media content within the metaverse world. Also, the current paper will propose an exploratory study that is designed to provide preliminary evidence regarding how individuals cognitively and emotionally process social media posts embedded in a metaverse platform where they experience the simulation of becoming their desired or positive “future self”. From data obtained from the gaze tracking and social media engagement metrics that measure users\\' simulated attentional and engagement behaviors, the author will examine to what extent the different temporal distances of virtual or simulated self (present vs near- vs far-future self) and the actual self (lowly vs highly conscientious self) interactively influences the durations of attention (duration of viewing the posts) to and the engagement (i.e., clicking “like” button for the posts) in different social media posts (e.g., news feeds, positive vs negative dog pictures in native adverts, a health marketing post) seen in the virtual computer screen within the virtual room. In general, it is expected that the father the temporal distance, the longer the duration of the attention to the social media posts. This effect can be moderated by the actual self-views. That is, for participants with negative self-views, the farther the simulated temporal distance, the shorter the duration of attention to the social media posts relevant for the positive self within the metaverse environment. The opposite results are expected to be observed from individuals with positive self-views: the farther the simulated temporal distance, the longer the duration of attention to the social media posts seen within the non-real or metaverse world. The analysis and the plan for the presentation at 2022 IEEE VR workshop is provided in this paper.", "source": "ieee", "author": ["Yongwoog Andy Jeon"], "author_location": ["Department of Marketing, College of Business Northern Illinois University"], "keywords": [], "link": "https://doi.org/10.1109/VRW55335.2022.00068", "country": ["us"], "ctmighterror": [], "citation": 1}
---------------------------------
{"title": "3D Virtual worlds and the metaverse: Current status and future possibilities.", "date": 2013, "publish": "ACM Comput. Surv.", "abstract": "Moving from a set of independent virtual worlds to an integrated network of 3D virtual worlds or Metaverse rests on progress in four areas: immersive realism, ubiquity of access and identity, interoperability, and scalability. For each area, the current status and needed developments in order to achieve a functional Metaverse are described. Factors that support the formation of a viable Metaverse, such as institutional and popular interest and ongoing improvements in hardware performance, and factors that constrain the achievement of this goal, including limits in computational methods and unrealized collaboration among virtual world stakeholders and developers, are also considered.", "source": "acm", "author": ["John David N. Dionisio", "William G. Burns III", "Richard Gilbert"], "author_location": ["Loyola Marymount University", "Object Interoperability Lead for IEEE Virtual World Standard Group", "Loyola Marymount University"], "keywords": [], "link": "https://doi.org/10.1145/2480741.2480751\n", "country": ["us", "us", "us"], "ctmighterror": [], "citation": 313}
---------------------------------
{"title": " technologies for the metaverse.", "date": 2019, "publish": "SIGGRAPH Talks", "abstract": "Science-fiction notions of \"the metaverse\" are slowly becoming a reality as products such as Fortnite, Minecraft, and Roblox bring immersive social experiences to hundreds of millions of people and blur the boundaries between games and social networks. This talk will explore the foundational technologies, economies, and freedoms required to build this future medium as a force for good.", "source": "acm", "author": ["Tim Sweeney"], "author_location": ["Epic Games"], "keywords": [], "link": "https://doi.org/10.1145/3306307.3339844\n", "country": ["us"], "ctmighterror": [0], "citation": 5}
---------------------------------
{"title": "Evaluation for Students' Learning Manner Using Eye Blinking System in Metaverse.", "date": "2015", "publish": "KES", "abstract": "For a virtual problem-based learning (PBL) class in Metaverse, an eye blinking system for avatars was introduced. It correlated their eye blinking behavior with an emotional response to various problems that they were asked to discuss on behalf of their users. Three Japanese college students joined the project where they discussed a simple and difficult problem, respectively. Teachers proposed online (mathematical problems) for them. Each session was 10minutes in length. During the classes, the number of eye blinks was recorded for each student by using special software. After completing the PBL classes, the students answered questionnaires. Then the results were analyzed. All of the results suggested that the difficult question would make students’ feelings unstable and increase the number of eye blinks. Using this system, teachers could analyze students’ responses well to achieve a better outcome of virtual PBL.", "link": "https://www.sciencedirect.com/science/article/pii/S187705091502308X", "source": "elsevier", "author": ["Dana M. Barry", "Nobuyuki Ogawa", "Asanka D. Dharmawansa", "Hideyuki Kanematsu", "Yoshimi Fukumura", "Tatsuya Shirai", "Kuniaki Yajima", "Toshiro Kobayashi"], "author_location": ["Research Professor, Clarkson University, New York State, USA", "National Institute of Technology, Gifu College, Japan", "Graduate School, Nagoka University of Technology", "National Institute of Technology, Suzuka College, Japan", "Nagoka University of Technology, Japan", "National Institute of Technology, Suzuka College, Japan", "National Institute of Technology, Sendai College, Japan", "National Institute of Technology, Tsuyama College, Japan"], "keywords": ["Eye blinking system", "Metaverse", "Second Life", "active learning", "e-learning"], "country": ["us", "jp", "jp", "jp", "jp", "jp", "jp", "jp"], "ctmighterror": [6], "citation": 27}
---------------------------------
{"title": "Metaverse assisted Telesurgery in Healthcare 5.0: An interplay of Blockchain and Explainable AI.", "date": "2022", "publish": "CITS", "abstract": "Smart healthcare has transitioned towards health-care 5.0, which allows ambient tracking of patients, emotive telemedicine, telesurgery, wellness monitoring, virtual clinics, and personalized care. Thus, the metaverse is a potential tool to leverage digital connectivity via improved healthcare experience in virtual environments. However, despite its potential benefits, patient’s sensitive information is captured, and digital avatars are created that interact with healthcare stakeholders for connected virtual care. As metaverse components are decentralized, blockchain (BC) is a potential solution to induce transparency and immutability in stored transactions on metaverse. For clinical decision support in BC-assisted metaverse enabled, Healthcare 5.0, accurate and interpretable diagnosis is critical. Thus, explainable AI (xAI) forms another critical component that provides trust in the healthcare informatics front. A dual solution of trusted informatics is possible via the interplay of BC and xAI in metaverse-enabled Healthcare 5.0. The article investigates the interplay through a proposed telesurgical scheme between patients, virtual hospitals, and doctors. Next, we discuss the potential challenges and present an experimental use-case of the benefits of our proposed architecture over traditional telesurgery systems.", "source": "ieee", "author": ["Pronaya Bhattacharya", "Mohammad S. Obaidat", "Darshan Savaliya", "Sakshi Sanghavi", "Sudeep Tanwar", "Balqies Sadoun"], "author_location": ["Department of Computer Science and Engineering, Institute of Technology, Nirma University, Ahmedabad, Gujarat, India", "Amity University, Noida, UP, India", "Department of Computer Science and Engineering, Institute of Technology, Nirma University, Ahmedabad, Gujarat, India", "Department of Computer Science and Engineering, Institute of Technology, Nirma University, Ahmedabad, Gujarat, India", "Department of Computer Science and Engineering, Institute of Technology, Nirma University, Ahmedabad, Gujarat, India", "College of Engineering, Al Balqa’ Applied University, Al Salt, Jordan"], "keywords": [], "link": "https://doi.org/10.1109/CITS55221.2022.9832978", "country": ["in", "in", "in", "in", "in", "jo"], "ctmighterror": [0], "citation": 1}
---------------------------------
{"title": "Human Relationship Advice System in Metaverse World: Application Propose of CTUP Model in Future Communication.", "date": "2022", "publish": "LifeTech", "abstract": "Condition, Trend, Understanding, Prediction (CTUP) are the four key technologies in situation awareness. Except for its wide application in the military, autonomous driving, and behavior analysis, CTUP is also considered as one of the social skills in human society. With the increased integration of 5G, blockchain, artificial intelligence, and other smart technologies, Metaverse is expected to change the way we communicated with each other. While concern about how to deal with the relationship in the Metaverse world has become a hot topic. As the communication skills whether in the actual or Metaverse world share some common factors, it is considered that the CTUP model could help people to have a better relationship with some advice based on the condition, trend, understanding, and prediction.", "source": "ieee", "author": ["Tianyi Wang", "Shima Okada"], "author_location": ["Ritsumeikan Global Innovation Research Organization, Ritsumeikan University, Shiga, Japan", "Department of Robotics, College of Science and Engineering, Ritsumeikan University, Shiga, Japan"], "keywords": [], "link": "https://doi.org/10.1109/LifeTech53646.2022.9754873", "country": ["jp", "jp"], "ctmighterror": [0], "citation": 0}
---------------------------------
{"title": "Unified Resource Allocation Framework for the Edge Intelligence-Enabled Metaverse.", "date": "2022", "publish": "ICC", "abstract": "Dubbed as the next-generation Internet, the meta-verse is a virtual world that allows users to interact with each other or objects in real-time using their avatars. The metaverse is envisioned to support novel ecosystems of service provision in an immersive environment brought about by an intersection of the virtual and physical worlds. The native AI systems in metaverse will personalized user experience over time and shape the experience in a scalable, seamless, and synchronous way. However, the metaverse is characterized by diverse resource types amid a highly dynamic demand environment. In this paper, we propose the case study of virtual education in the metaverse and address the unified resource allocation problem amid stochastic user demand. We propose a stochastic optimal resource allocation scheme (SORAS) based on stochastic integer programming with the objective of minimizing the cost of the virtual service provider. The simulation results show that SORAS can minimize the cost of the virtual service provider while accounting for the users’ demands uncertainty.", "source": "ieee", "author": ["Wei Chong Ng", "Wei Yang Bryan Lim", "Jer Shyuan Ng", "Zehui Xiong", "Dusit Niyato", "Chunyan Miao"], "author_location": ["Alibaba Group", "Alibaba Group", "Alibaba Group", "Singapore University of Technology and Design, Nanyang Technological University, Singapore", "School of Computer Science and Engineering, Nanyang Technological University, Singapore", "School of Computer Science and Engineering, Nanyang Technological University, Singapore"], "keywords": [], "link": "https://doi.org/10.1109/ICC45855.2022.9838492", "country": ["sg", "sg", "sg", "sg", "sg", "sg"], "ctmighterror": [0, 1, 2], "citation": 22}
---------------------------------
{"title": "Constructing Situated Learning Platform for Japanese Language and Culture in 3D Metaverse.", "date": "2011", "publish": "Culture and Computing", "abstract": "This research aims at implementing an e-Learning platform where students from overseas can learn Japanese language and culture in 3D met averse. First, we introduce the results of preliminary survey to international students regarding their study interests related to Japanese language and culture. Second, we outline the design and implementation of our learning platform in Second Life (SL) based on the concept of situated learning that emphasizes embodied interaction with the external objects/environment in the process of learning. The platform includes traditional Japanese architecture, such as Shinto shrine, Noh stage, or Buddism pagoda. The learners can also explore those architectures in the virtual space with their avatar. Third, we elucidate the result of the analysis of our learning experiment in SL among international and Japanese student based on the interaction between learners and with objects in the virtual space. Finally, we discuss advantages and limitations of learning process in our met averse platform in terms of situated leaning of Japanese language and culture.", "source": "ieee", "author": ["Michiru Tamai", "Mitsuyuki Inaba", "Koichi Hosoi", "Ruck Thawonmas", "Masayuki Uemura", "Akinori Nakamura"], "author_location": ["Digital Humanities Center of Japanese Arts and Cultures, Ritsumeikan University, Kyoto, Japan", "Digital Humanities Center of Japanese Arts and Cultures, Ritsumeikan University, Kyoto, Japan", "Digital Humanities Center of Japanese Arts and Cultures, Ritsumeikan University, Kyoto, Japan", "Digital Humanities Center of Japanese Arts and Cultures, Ritsumeikan University, Kyoto, Japan", "Digital Humanities Center of Japanese Arts and Cultures, Ritsumeikan University, Kyoto, Japan", "Digital Humanities Center of Japanese Arts and Cultures, Ritsumeikan University, Kyoto, Japan"], "keywords": [], "link": "https://doi.org/10.1109/Culture-Computing.2011.59", "country": ["jp", "jp", "jp", "jp", "jp", "jp"], "ctmighterror": [0], "citation": 13}
---------------------------------
{"title": "Inference of Viewed Exhibits in a Metaverse Museum.", "date": "2013", "publish": "Culture and Computing", "abstract": "This paper presents how to infer viewed exhibits in a metaverse museum from a visitor\\'s movement log. This task consists of movement-state detection and viewed-exhibit inference. For the former task, we focus on visitor\\'s fast and slow movement and discuss three differences between our previous methods and new methods: an additional parameter, speed normalization, and key-input accumulation. For the latter task, our new method focuses on the distance and angle between the visitor and each involving exhibit. According to a conducted experiment, the proposed methods could improve the performance (F-measure) by 10.3% and 4.6% for movement state detection and viewed-exhibit inference, respectively.", "source": "ieee", "author": ["Yuhei Ando", "Ruck Thawonmas", "Frank J. Rinaldo"], "author_location": ["Intelligent Computer Entertainment Laboratory, Ritsumeikan University, Kusatsu, Shiga, Japan", "Department of Human and Computer Intelligence, Ritsumeikan University, Kusatsu, Shiga, Japan", "Department of Human and Computer Intelligence, Ritsumeikan University, Kusatsu, Shiga, Japan"], "keywords": [], "link": "https://doi.org/10.1109/CultureComputing.2013.73", "country": ["jp", "jp", "jp"], "ctmighterror": [0], "citation": 8}
---------------------------------
{"title": "Interference and Consultation in Virtual Public Space: The Practice of Intermedia Art in Metaverse.", "date": "2021", "publish": "MSN", "abstract": "Intermedia art is an art form that spans many fields such as digital art, biological art, interactive machinery, artificial intelligence, etc. Because of its multi-domain collaborative creation has become an inevitable choice for intermedia art creators to spread in public spaces with more complicated social relations. The public spaces can be recognized as the ones in the physical world involving the flesh of human bodies and those in the virtual world called “metaverse” in recent years. In this paper, based on the traditional intervention methods of intermedia art in physical public spaces, “interference” and “consultation,” we conclude the challenges when intermedia reveals its tendency to migrate from the physical world to the virtual world as the changing of social background. After that, we discuss the past, present and the future of metaverse serving as a new form of public space for the expression of intermedia art by analyzing the data collected from the two mainstream metaverse platforms called “CryptoVoxels” and “Decentraland.”", "source": "ieee", "author": ["Rongman Hong", "Hao He"], "author_location": ["Guangzhou Academy of Fine Arts, China", "The Chinese University of Hong Kong, Shenzhen, China"], "keywords": [], "link": "https://doi.org/10.1109/MSN53354.2021.00124", "country": ["cn", "cn"], "ctmighterror": [0], "citation": 2}
---------------------------------
{"title": "Machine Ethics for Metaverse Gambling: No Stake in a $24m Market?", "date": "2009", "publish": "VS-GAMES", "abstract": "Abstract— Online gambling produces a substantial turnover.\\xa0\\xa0Unfortunately for potential virtual world gamblers and gambling organizations alike, US law had forced the closure of gambling in the Second Life virtual world.\\xa0\\xa0However, an Open Grid Protocol could lead to the provision of off-shore gambling in this virtual world. Aside from legal issues, online gambling generally gives rise to ethical issues relating to prevention of harm.\\xa0\\xa0We considered the combined legal and ethical issues, and have proposed and begun to construct and evaluate a system with computational oversight: an ethical advisor.\\xa0\\xa0The system is grounded in recent research into Machine Ethics, which may offer insights into other legal and ethical matters, and provides a framework for responsible gambling in our EthiCasino (ethical virtual casino) in Second Life.", "source": "ieee", "author": ["Anna Vartapetiance Salmasi", "Lee Gillam"], "author_location": ["University of Surrey, Guildford, Surrey, GB", "Department of Computing, University of Surrey, Guildford, UK"], "keywords": [], "link": "https://doi.org/10.1109/VS-GAMES.2009.39", "country": ["uk", "uk"], "ctmighterror": [0], "citation": 3}
---------------------------------
{"title": "Generating Virtual Worlds from Biodiversity Information Systems: Requirements, General Process and Typology of the Metaverse's Models.", "date": "2009", "publish": "ICIW", "abstract": "With the relatively recent awareness of the fragility of the natural world environment (Rio Conference \\\\\"Earth Summit\\\\\" in 1992), Information Systems (IS) trying to identify and help to manage biodiversity have proliferated. Given the various data that they contain, they are complex applications, hardly accessible to the general public. At the same time, new communication systems allow a more natural assimilation of information: three-dimensional representations of immersive virtual worlds, also known as metaverses. By putting users in a reality reproduction built from IS, all information can be represented in a consistent virtual environment. But turning IS\\'s data in a coherent metaverse is not a trivial process. Depending the IS\\'s structure and the availability of metadata, several virtual worlds, representing several level of details, can be generated. This paper is a contribution to the analysis of the different possibilities to generate metaverses representing the information stored in the IS dedicated to biodiversity. It presents the generic process of worlds generation, the requirements, the different models of metaverses\\' structure, and the metadata that could be used to refine the level of detail.", "source": "ieee", "author": ["Didier Sébastien", "Noël Conruyt", "Rémy Courdier", "Tullio Tanzi"], "author_location": ["Département TSI-LTCI UMR 5141-CNRS, Institut Telecom-Telecom ParisTech, LTCI, Paris, France", "Département TSI-LTCI UMR 5141-CNRS, Institut Telecom-Telecom ParisTech, LTCI, Paris, France", "Département TSI-LTCI UMR 5141-CNRS, Institut Telecom-Telecom ParisTech, LTCI, Paris, France", "Département TSI-LTCI UMR 5141-CNRS, Institut Telecom-Telecom ParisTech, LTCI, Paris, France"], "keywords": [], "link": "https://doi.org/10.1109/ICIW.2009.89", "country": ["fr", "fr", "fr", "fr"], "ctmighterror": [0], "citation": 8}
---------------------------------
{"title": "Extended Reality and Internet of Things for Hyper-Connected Metaverse Environments.", "date": "2022", "publish": "VR Workshops", "abstract": "The Metaverse encompasses technologies related to the internet, virtual and augmented reality, and other domains toward smart interfaces that are hyper-connected, immersive, and engaging. However, Metaverse applications face inherent disconnects between virtual and physical components and interfaces. This work explores how an Extended Metaverse framework can be used to increase the seamless integration of interoperable agents between virtual and physical environments. It contributes an early theory and practice toward the synthesis of virtual and physical smart environments anticipating future designs and their potential for connected experiences.", "source": "ieee", "author": ["Jie Guan", "Jay Irizawa", "Alexis Morris"], "author_location": ["Adaptive Context Environments (ACE) Lab, OCAD University", "Adaptive Context Environments (ACE) Lab, OCAD University", "Adaptive Context Environments (ACE) Lab, OCAD University"], "keywords": [], "link": "https://doi.org/10.1109/VRW55335.2022.00043", "country": ["ca", "ca", "ca"], "ctmighterror": [0], "citation": 1}
---------------------------------
{"title": "Reality Check of Metaverse: A First Look at Commercial Social Virtual Reality Platforms.", "date": "2022", "publish": "VR Workshops", "abstract": "Metaverse has grasped the news headlines recently. While being heavily advocated by the industry, there are great in-terests from academia as it demands various technological support from both hardware and software research. There has been an extensive visionary discussion of metaverse lately, but there are few studies on its technical challenges and user experience in practice. To fill this critical gap, in this paper, we take a first look at Workrooms, arguably a premature metaverse product released by Meta (a.k.a. Face-book). The goal of our study is to gain an in-depth under-standing of the current state of the metaverse and identify potential issues for improvement. Through extensive meas-urement studies, we dissect the underlying network support and demand of Workrooms. Our investigation reveals sev-eral interesting findings. For example, Workrooms utilizes different network flows to transmit virtual content and real-time multimedia content separately. This might be a prin-cipled approach that should be adopted in general. On the other hand, the current design of Workrooms faces imper-ative scalability challenges that should be addressed in any large-scale metaverse platform.", "source": "ieee", "author": ["Ruizhi Cheng", "Nan Wu", "Songqing Chen", "Bo Han 0001"], ",author_location": ["George Mason University", "George Mason University", "George Mason University", "George Mason University"], "keywords": [], "link": "https://doi.org/10.1109/VRW55335.2022.00040", "country": ["us", "us", "us", "us"], "ctmighterror": [0], "citation": 4}
---------------------------------
{"title": "An empirical investigation of virtual world projects and metaverse technology capabilities.", "date": 2011, "publish": "Data Base", "abstract": "Metaverses are immersive three-dimensional virtual worlds (VWs) where people interact with each other and their environment, using the metaphor of the real world but without its physical limitations. Unique technology capabilities of metaverses have the potential to enhance the conduct of virtual projects, but little is known about virtual worlds in this context. Virtual project teams struggle in meeting stated project outcomes due to challenges related to communication, shared understanding, and coordination. One way to address these challenges is to consider the use of emerging technologies, such as metaverses, to minimize the impact on virtual project teams. Applying a theoretical foundation for virtual teams in metaverses that includes both technology capabilities and the social interaction that takes place in the metaverse environment, we conducted an empirical investigation of project teams in a virtual world setting. The study examined the interplay of communication, representation, interaction, and team process tools with behaviors that led to role clarity, shared understanding, and coordination. While each individual technology capability contributed to project execution and outcomes, much of the power of the environment emerged through the interplay of social behaviors and technology capabilities. The results have intriguing implications for how metaverse technology capabilities might provide new ways to address gaps in the current research and practice of virtual project management and virtual teams.", "source": "acm", "author": ["Dawn Owens", "Alanah Mitchell", "Deepak Khazanchi", "Ilze Zigurs"], "author_location": ["University of Nebraska at Omaha, Omaha, NE, USA", "Appalachain State University, Boone, NC, USA", "University of Nebraska at Omaha, Omaha, NE, USA", "UIniversity of Nebraska at Omaha, Omaha, NE, USA"], "keywords": [], "link": "https://doi.org/10.1145/1952712.1952717\n", "country": ["US", "US", "US", "US"], "citation": 32}
---------------------------------
{"title": "Distributed Metaverse: Creating Decentralized Blockchain-based Model for Peer-to-peer Sharing of Virtual Spaces for Mixed Reality Applications.", "date": 2018, "publish": "AH", "abstract": "Mixed reality telepresence is becoming an increasingly popular form of interaction in social and collaborative applications. We are interested in how created virtual spaces can be archived, mapped, shared, and reused among different applications. Therefore, we propose a decentralized blockchain-based peer-to-peer model of distribution, with virtual spaces represented as blocks. We demonstrate the integration of our system in a collaborative mixed reality application and discuss the benefits and limitations of our approach.", "source": "acm", "author": ["Bektur Ryskeldiev", "Yoichi Ochiai", "Michael Cohen 0002", "Jens Herder"], "author_location": ["University of Aizu, Aizu-Wakamatsu, Fukushima, Japan", "University of Tsukuba, Tsukuba, Ibaraki, Japan", "University of Aizu, Aizu-Wakamatsu, Fukushima, Japan", "Hochschule Düsseldorf, University of Applied Sciences, Düsseldorf, Germany"], "keywords": [], "link": "https://doi.org/10.1145/3174910.3174952\n", "country": ["JP", "JP", "JP", "DE"], "citation": 35}
---------------------------------
{"title": "How should metaverse augment humans with disabilities?: This paper discusses how the metaverse should augment the humans with disabilities.", "date": 2022, "publish": "AH", "abstract": "The metaverse is a new paradigm made possible by emerging technologies like virtual reality, augmented reality, and blockchains. Humans with disabilities should not be excluded from the metaverse and should have equitable access to it. However, it is unclear which options humans with physical and cognitive disabilities will have in the current metaverse to use and represent themselves – and feel included. Our research seeks to determine how humans with disabilities should be augmented in the metaverse, as well as whether the current metaverse permits such augmentations. If not, what features should be added to make the metaverse more accessible and inclusive? In this regard, we have begun to investigate one of the most well-known decentralized metaverses, namely Decentraland.", "source": "acm", "author": ["Jean-Marc Seigneur", "Mohamed-Amine Choukou"], "author_location": ["SDS, CUI, <span class=\"__cf_email__\" data-cfemail=\"6b260e0f022b272a29\">[email protected]</span>, University of Geneva, Switzerland", "College of Rehabilitation Sciences, University of Manitoba, Canada"], "keywords": [], "link": "https://doi.org/10.1145/3532525.3532534\n", "country": ["US", "CA"], "citation": 1}
---------------------------------
{"title": "Towards an Emotionally Augmented Metaverse: a Framework for Recording and Analysing Physiological Data and User Behaviour.", "date": 2022, "publish": "AH", "abstract": " Several big tech companies are currently eager of building the metaverse, mainly through virtual reality experiences. Albeit immersive, in shared virtual environments it might be difficult to have emotionally rich interactions. Indeed, current available headsets and VR applications have limited possibilities for tracking and sharing emotions. We believe that physiological signal technology could enhance future metaverse applications. In this context, this paper presents a framework for visualizing, recording and synchronizing experiences in VR with human body signals. In order to prove the effectiveness of the system, we illustrate a use case and the development of a proof-of-concept scenario. Finally, we present the results of the tests conducted on this proof-of-concept that demonstrate the validity of the proposed system. Such framework could be used to design new emotionally augmented experiences in VR.", "source": "acm", "author": ["Leonardo Angelini", "Massimo Mecella", "Hai-Ning Liang", "Maurizio Caon", "Elena Mugellini", "Omar Abou Khaled", "Danilo Bernardini"], "author_location": ["School of Management Fribourg, University of Applied Sciences and Arts Western Switzerland, Switzerland", "Department of Computer, Control and Management Engineering, Sapienza University of Rome, Italy", "Department of Computing, Xian Jiaotong-Liverpool University, China", "University of Applied Sciences and Arts Western Switzerland, Switzerland", "HumanTech Institute, University of Applied Sciences and Arts Western Switzerland, Switzerland", "HumanTech Institute, University of Applied Sciences and Arts Western Switzerland, Switzerland", "Department of Computer, Control and Management Engineering, Sapienza University of Rome, Italy"], "keywords": [], "link": "https://doi.org/10.1145/3532530.3532546\n", "country": ["CH", "IT", "CN", "CH", "CH", "CH", "IT"], "citation": 0}
---------------------------------
{"title": "Metaverse: a SIP/SIMPLE IP telephony and instant messaging compliant system.", "date": 2006, "publish": "WebMedia", "abstract": "The growing utilization of Internet Broadband access is popularizing Instant Messaging services enhanced with Voice and Video. However, despite the existence of open and standardized signaling protocols, the most popular services still use proprietary protocols and clients, hindering the interoperability among the existent solutions. This paper presents the methodology of implementation and validation of Metaverse: an IP Telephony and Instant Messaging application compliant with the Internet Engineering Task Force (IETF) open specifications, allowing its interoperability with other standards adherent solutions.A crescente utilização de Internet Banda Larga vem popularizando os serviços de Mensagens Instantâneas com recursos de conversação via voz e vídeo sobre IP. Entretanto, apesar da existência de protocolos de sinalização abertos e padronizados, os serviços mais populares utilizam protocolos e clientes propriet´rios, impedindo a interoperabilidade entre as diversas soluções. Este artigo apresenta a metodologia de implementação e validação do Metaverse: uma aplicação de Telefonia IP e Mensagens Instantâneas totalmente aderente às especificações abertas do Internet Engineering Task Force (IETF), permitindo sua interoperabilidade com outras soluções aderentes aos padrões.", "source": "acm", "author": ["Gelson Dias Santos", "Valter Roesler"], "author_location": ["Universidade do Vale do Rio dos Sinos, São Leopoldo, RS, Brasil", "Universidade do Vale do Rio dos Sinos, São Leopoldo, RS, Brasil"], "keywords": [], "link": "https://doi.org/10.1145/1186595.1186621\n", "country": ["BR", "BR"], "citation": 0}
---------------------------------
{"title": "Breaking down the Barrier between Teachers and Students by Using Metaverse Technology in Education: Based on A Survey and Analysis of Shenzhen City, China.", "date": 2022, "publish": "IC4E", "abstract": "In recent years, people have steadily grown more aware of a metaverse. Besides, the enormous business potential hidden in metaverse has drawn a significant amount of funding to conduct a study on it. Technology companies such as Facebook, Microsoft, Nvidia, and others have set out the expansion of metaverse on a global scale. As a result, metaverse research has gradually increased in various countries, becoming a heated topic in China. The reason behind the metaverse's explosion is that people recognize the enormous future business value it holds. Still, they overlook the reality that education is the largest potential field of metaverse application. The metaverse and education have a natural parallel and overlap in terms of usability. In contrast to traditional education, the shared virtual space in the metaverse allows students to better participate in education and even become teachers of teachers. However, a substantial number of people are pessimistic about the metaverse's development and implementation, believing it to be a hoax. Therefore, a questionnaire scale is designed in terms of knowledge, exposure, current technology, and confidence to count people's faith in applying metaverse in education and teaching in the near future. The obtained survey data survey is analyzed using a combination of online and field visits, using both quantitative and qualitative analysis. The lack of understanding of metaverse, lack of faith in existing technology, and lack of awareness of the application of metaverse in education were determined to be the key variables affecting people's confidence in the future use of metaverse in education. It is concluded that popularizing metaverse information, existing technological levels, and current technological development speed can notably increase people's confidence.", "source": "acm", "author": ["Kun Yue"], "author_location": ["University of Arizona Global Campus, China"], "keywords": [], "link": "https://doi.org/10.1145/3514262.3514345\n", "country": ["CN"], "citation": 1}
---------------------------------
{"title": "Searching for the metaverse.", "date": 2009, "publish": "VRST", "abstract": "We present a system for collecting content from 3D multi-user virtual worlds for use in a cross-world search engine, an enabling technology for linking virtual worlds to the wider web. We use an intelligent agent crawler designed to collect user-generated content without relying on access to private internal server databases. The agents navigate autonomously through the world and interact with content to discover regions, parcels of land within regions, user-created objects, other avatars, and user associations. The experiments we performed are the first which focus on the content within a large virtual world. Our results show that virtual worlds can be effectively crawled using autonomous agent crawlers that emulate normal user behavior. Additionally, we find that the collection of interactive content enhances our ability to identify dynamic, immersive environments within the world.", "source": "acm", "author": ["Joshua Eno", "Susan Gauch", "Craig W. Thompson"], "author_location": ["University of Arkansas", "University of Arkansas", "University of Arkansas"], "keywords": [], "link": "https://doi.org/10.1145/1643928.1643976\n", "country": ["US", "US", "US"], "citation": 12}
---------------------------------
{"title": "Metaverse for Social Good: A University Campus Prototype.", "date": 2021, "publish": "ACM Multimedia", "abstract": "In recent years, the metaverse has attracted enormous attention from around the world with the development of related technologies. The expected metaverse should be a realistic society with more direct and physical interactions, while the concepts of race, gender, and even physical disability would be weakened, which would be highly beneficial for society. However, the development of metaverse is still in its infancy, with great potential for improvement. Regarding metaverse's huge potential, industry has already come forward with advance preparation, accompanied by feverish investment, but there are few discussions about metaverse in academia to scientifically guide its development. In this paper, we highlight the representative applications for social good. Then we propose a three-layer metaverse architecture from a macro perspective, containing infrastructure, interaction, and ecosystem. Moreover, we journey toward both a historical and novel metaverse with a detailed timeline and table of specific attributes. Lastly, we illustrate our implemented blockchain-driven metaverse prototype of a university campus and discuss the prototype design and insights.", "source": "acm", "author": ["Haihan Duan", "Jiaye Li", "Sizheng Fan", "Zhonghao Lin", "Xiao Wu", "Wei Cai 0002"], "author_location": ["The Chinese University of Hong Kong &amp; Shenzhen Institute of Artificial Intelligence and Robotics for Society, Shenzhen, China", "The Chinese University of Hong Kong &amp; Shenzhen Institute of Artificial Intelligence and Robotics for Society, Shenzhen, China", "The Chinese University of Hong Kong &amp; Shenzhen Institute of Artificial Intelligence and Robotics for Society, Shenzhen, China", "The Chinese University of Hong Kong &amp; Shenzhen Institute of Artificial Intelligence and Robotics for Society, Shenzhen, China", "White Matrix Inc., Nanjing, China", "The Chinese University of Hong Kong &amp; Shenzhen Institute of Artificial Intelligence and Robotics for Society, Shenzhen, China"], "keywords": [], "link": "https://doi.org/10.1145/3474085.3479238\n", "country": ["HK", "HK", "HK", "HK", "CN", "HK"], "citation": 180}
---------------------------------
{"title": "Peer-assisted texture streaming in metaverses.", "date": 2011, "publish": "ACM Multimedia", "abstract": "User-extensible metaverses need an effective way to disseminate massive and dynamic 3D contents (i.e., meshes, textures, animations, etc.) to end users, and at the same time maintain a low consumption of server bandwidth. Peer-to-peer (or peer-assisted) technologies have been widely considered as a desirable complementary solution to efficaciously offload servers in large-scale media streaming applications. However, due to both the bandwidth constraints of heterogeneous users and unpredictable access patterns of latency-sensitive 3D contents, it is very challenging to cut the server bandwidth cost in metaverses. In this paper, we propose a peer-assisted texture streaming architecture to minimize the server bandwidth consumption without degrading the end-user satisfaction. We propose a game-theoretic peer selection strategy which achieves a good trade-off between performance and complexity. Our algorithm is light-weight, and can efficiently utilize the bandwidth of users in a fully decentralized manner by enabling each peer (i.e., user) to quickly select its content providers who can satisfy the requests of the peer within the latency constraint of the content. We evaluate our algorithm through an extensive comparison study based on simulations using realistic data (i.e., avatar mobility traces and textures) collected from Second Life. The simulation results show that the proposed algorithm can effectively reduce the server bandwidth consumption without degrading the user experience.", "source": "acm", "author": ["Ke Liang 0001", "Roger Zimmermann", "Wei Tsang Ooi"], "author_location": ["National University of Singapore, Singapore, Singapore", "National University of Singapore, Singapore, Singapore", "National University of Singapore, Singapore, Singapore"], "keywords": [], "link": "https://doi.org/10.1145/2072298.2072326\n", "country": ["SG", "SG", "SG"], "citation": 6}
---------------------------------
{"title": "Ukemochi: A Video See-through Food Overlay System for Eating Experience in the Metaverse.", "date": 2022, "publish": "CHI Extended Abstracts", "abstract": " The widespread use of Head-Mounted Displays (HMDs) allows ordinary users to interact with their friends daily in social Virtual Environments (VEs) or metaverse. However, it is not easy to eat in a metaverse while wearing an HMD because the Real Environment (RE) is not visible. Currently, users watch the RE’s food through the gap between the user’s face and the HMD (None) or superimposing a video see-through (VST) image on the VE, but these methods reduce the sense of presence. To allow natural eating in a VE, we propose Ukemochi that improves the presence and ease of eating. Ukemochi seamlessly overlays a food segmentation image inferred by deep neural networks on a VE. Ukemochi can be used simultaneously as a VE created with the OpenVR API and can be easily deployed for the metaverse. In this study, we evaluated the effectiveness of Ukemochi by comparing three visual presentation methods (None, VST, and Ukemochi) and two meal conditions (Hand condition and Plate condition). The experimental results demonstrated that Ukemochi enables users to maintain a high presence in VE and improve the ease of eating. We believe that our study will provide users with the experience of eating in the metaverse and encourage further research on eating in the metaverse.", "source": "acm", "author": ["Kizashi Nakano", "Daichi Horita", "Naoya Isoyama", "Hideaki Uchiyama", "Kiyoshi Kiyokawa"], "author_location": ["Cybernetics and Reality Engineering Laboratory, Nara Institute of Science and Technology, Japan", "Multimedia processing lab, The University of Tokyo, Japan", "Cybernetics and Reality Engineering Laboratory, Nara Institute of Science and Technology, Japan", "Cybernetics and Reality Engineering Laboratory, Nara Institute of Science and Technology, Japan", "Cybernetics and Reality Engineering Laboratory, Nara Institute of Science and Technology, Japan"], "keywords": [], "link": "https://doi.org/10.1145/3491101.3519779\n", "country": ["JP", "JP", "JP", "JP", "JP"], "citation": 0}
---------------------------------
{"title": "Metaverse: The Vision for the Future.", "date": 2022, "publish": "CHI Extended Abstracts", "abstract": " In recent years, the notion of the Metaverse has become the focus of a growing body of work in the industry. However, there is no consensus on the conceptualization in academia. To date, much of this attention has revolved around technological challenges. However, what is notably missing from these discussions is a consideration of the human factors and social aspects that are considered more critical challenges within HCI. The aims of this SIG are as follows: Firstly, to provide a platform for researchers and practitioners to engage with the various definitions and the ways in which the Metaverse is developing. Secondly, to discuss the opportunities, challenges, and future possibilities in the context of HCI. This will lay the foundations to build a network for academics interested in the field for future multidisciplinary research relating to the Metaverse.", "source": "acm", "author": ["Jiangnan Xu", "Konstantinos Papangelis", "John Dunham", "Jorge Gonçalves 0001", "Nicolas James LaLone", "Alan Chamberlain", "Ioanna Lykourentzou", "Federica Lucia Vinella", "David I. Schwartz"], "author_location": ["Rochester Institute of Technology, United States", "Rochester Institute of Technology, United States", "Niantic x RIT Geo Games and Media Lab, Rochester Institute of Technology, United States", "School of Computing and Information Systems, University of Melbourne, Australia", "Information Systems and Quantitative Analysis, University of Nebraska at Omaha, United States", "Mixed Reality Lab, University of Nottingham, United Kingdom", "Utrecht University, Netherlands", "Human Centered Computing, Utrecht University, Netherlands", "School of Interactive Games and Media, RIT, United States"], "keywords": [], "link": "https://doi.org/10.1145/3491101.3516399\n", "country": ["US", "US", "US", "US", "US", "GB", "NL", "NL", "US"], "citation": 2}
---------------------------------
{"title": "Something Personal from the Metaverse: Goals, Topics, and Contextual Factors of Self-Disclosure in Commercial Social VR.", "date": 2022, "publish": "CHI", "abstract": " Current Social VR literature provides limited insight on one of the most critical behaviors for developing and maintaining interpersonal relationships: self-disclosure. Therefore, we present an online survey (N = 126) investigating how users disclose personal information to each other in Social VR. Our results indicate that many participants see in Social VR access to authentic connections with others despite tending towards skepticism and privacy concerns. Most users disclose sexuality-related information, lifestyle preferences, and personal goals. In contrast, information that breaks anonymity, such as real names and more intimate aspects of oneself, are shared less commonly. Thereby, self-disclosure decisions depend on factors like the relationship to or age of disclosure recipients, the privacy of a virtual environment, the group size, or the activity context, and is driven by different goals, i.a., relational development or exploration of oneself. These insights advance the understanding of current Social VR users and their behavior by directing future research on self-disclosure-based relationship building in Social VR and outlying broader design implications for the future metaverse.", "source": "acm", "author": ["Philipp Sykownik", "Divine Maloney", "Guo Freeman", "Maic Masuch"], "author_location": ["Faculty of Engineering / Department for Computer Science and Cognitive Science / Entertainment Computing, University of Duisburg-Essen, Germany", "School of Computing, Human Centered Computing, Clemson University, United States", "School of Computing, Clemson University, United States", "Faculty of Engineering / Department for Computer Science and Cognitive Science / Entertainment Computing, University of Duisburg-Essen, Germany"], "keywords": [], "link": "https://doi.org/10.1145/3491102.3502008\n", "country": ["DE", "US", "US", "DE"], "citation": 4}
---------------------------------
{"title": "Co-creative game development in a participatory Metaverse.", "date": 2008, "publish": "PDC", "abstract": "In recent years a strong kind of user participation has shown up in the domain of computer games in form of game modifications and Massively Multiplayer Online Games. But in contrary to this intense user involvement, the games industry yet mainly adheres to top-down development methodology. On this note, the paper at hand discusses the approach of in-world game development in form of a serious game. This approach tries to close the userdeveloper gap by intertwining as well the concepts of development and play as also their corresponding platforms. Since the mentioned trend towards a productive kind of use and the collateral tension between conventional development and \"prod-usage\" is not solely game-specific but characteristic for the current paradigmatic change towards an upcoming Metaverse, the discussion is embedded within this context.", "source": "acm", "author": ["Daniel Volk"], "author_location": ["Universitaet der Bundeswehr Muenchen, Neubiberg, Germany"], "keywords": [], "link": "https://dl.acm.org/citation.cfm?id=1795294\n", "country": ["DE"], "citation": 15}
---------------------------------
{"title": "Building the open metaverse: part I.", "date": 2022, "publish": "SIGGRAPH Courses", "abstract": "No abstract available.", "source": "acm", "author": ["Patrick Cozzi", "Marc Petit", "Neal Stephenson", "Rev Lebaredian", "Natalya Tatarchuk"], "author_location": [], "keywords": [], "link": "https://doi.org/10.1145/3532720.3535666\n", "country": [], "citation": 0}
---------------------------------
{"title": "Archidemo: architecture in metaverse.", "date": 2008, "publish": "SIGGRAPH Posters", "abstract": "'Archidemo' is experimental demonstration and research project for enhancing of the possibility of the architecture and environmental design in the 3D-Internet (3Di) space.", "source": "acm", "author": ["Hidenori Watanave"], "author_location": ["Tokyo Metropolitan University, Tokyo, Japan"], "keywords": [], "link": "https://doi.org/10.1145/1400885.1400901\n", "country": ["JP"], "citation": 5}
---------------------------------
{"title": "Building the open metaverse: part II.", "date": 2022, "publish": "SIGGRAPH Courses", "abstract": "No abstract available.", "source": "acm", "author": ["Patrick Cozzi", "Marc Petit", "Neil Trevett", "Nadine Alameh", "Morgan McGuire", "Guido Quaroni"], "author_location": [], "keywords": [], "link": "https://doi.org/10.1145/3532720.3535668\n", "country": [], "citation": 46}
---------------------------------
{"title": "A conceptual framework for determining metaverse adoption in higher institutions of gulf area: An empirical study using hybrid SEM-ANN approach.", "date": "2022", "publish": "Comput. Educ. Artif. Intell.", "abstract": "The metaverse is a kind of imagined world with immersive digital spaces that increase, allowing a more interactive environment in educational settings. The metaverse is an expansion of the synchronous communication that embraces an effective number of users to share different experiences. The study aims to investigate the students' perceptions towards metaverse system for educational purposes in the Gulf area. The conceptual model comprises the adoption properties, namely trialability, observability, compatibility, and complexity, users' satisfaction, personal innovativeness, and Technology Acceptance Model (TAM) constructs. The novelty of the paper lies in its conceptual model that correlates both personal-based characteristics and technology-based features. In addition, the novel approach of hybrid analysis will be used in the current study to perform deep-learning-based analysis of structural equation modelling (SEM) and artificial neural network (ANN). Moreover, the importance-performance map analysis (IPMA) is used in the current study to evaluate the involved factors for their importance and performance. The study identified Perceived Usefulness (PU) to be an essential predictor of the factor of Users’ Intention to Use the Metaverse System (MS). The fact was discovered during ANN and IPMA analysis. Furthermore, this study is practically significant, as it helped the concerned authorities in educational sector in understanding the significance of each factor and allowed them to make efforts and plans according to the order of significance of factors. Another important implication of the study is methodological in nature. It validates that deep ANN architecture can offer deep insight into non-linear relationships shared by various factors of a theoretical model.", "link": "https://www.sciencedirect.com/science/article/pii/S2666920X22000078", "source": "elsevier", "author": ["Iman A. Akour", "Rana Saeed Al-Maroof", "Raghad Alfaisal", "Said A. Salloum"], "author_location": ["Information Systems Department, College of Computing & Informatics, University of Sharjah, United Arab Emirates", "English Language & Linguistics Department, Al Buraimi University College, Al Buraimi, Oman", "Faculty of Art, Computing and Creative Industries, Universiti Pendidikan Sultan Idris, Malaysia", "School of Science, Engineering, and Environment, University of Salford, UK"], "keywords": ["Artificial neural network", "Gulf area", "Metaverse system", "Technology acceptance model", "Structural equation modelling"], "country": ["US", "OM", "MY", "US"], "citation": 21}
---------------------------------
{"title": "Definition, roles, and potential research issues of the metaverse in education: An artificial intelligence perspective.", "date": "2022", "publish": "Comput. Educ. Artif. Intell.", "abstract": "The metaverse has been recognized as one of the technologies with the greatest potential today. However, the use of the metaverse for educational purposes is seldom discussed. Most educators might be unaware of the features of the metaverse, not to mention the potential applications of this emerging technology. In this position paper, we aim to provide a clear definition of the metaverse. Potential applications and research issues of the metaverse in educational settings are also presented. Moreover, the roles of AI in the metaverse as well as metaverse-based education are discussed. It is expected that, via this paper, researchers from the fields of both computer science and educational technology would have a clear picture of what the metaverse is and how it can be used for educational purposes. More importantly, it is expected that more studies related to metaverse-based education can be reported in the near future.", "link": "https://www.sciencedirect.com/science/article/pii/S2666920X22000376", "source": "elsevier", "author": ["Gwo-Jen Hwang", "Shu-Yun Chien"], "author_location": ["Graduate Institute of Digital Learning and Education, National Taiwan University of Science and Technology 43, Sec.4, Keelung Rd., Taipei, 106, Taiwan"], "keywords": ["Metaverse", "Metaverse in education", "Artificial intelligence", "Virtual reality", "Augmented reality"], "country": ["TW"], "citation": 22}
---------------------------------
{"title": "A content service deployment plan for metaverse museum exhibitions - Centering on the combination of beacons and HMDs.", "date": "2017", "publish": "Int. J. Inf. Manag.", "abstract": "Today, methods of museum exhibition are rapidly changing. While focusing on visitors’ museum experience, new display methods employ a variety of digital technologies to provide exhibition content in ways that allow visitors to better understand artifacts on display. However, the majority of such methods rely on one-way means of delivering information. The lack of interaction with visitors and the use of lighting that clearly separates real and virtual spaces have made museums inadequate as experiential spaces. To resolve those problems, this article suggests a plan to deploy content services for visitors’ museum experiences by combining beacons and HMDs. This study establishes the concept of a service, which provides a virtual world experience by connecting a beacon installed in real space, that is, an exhibition room, to an HMD (head-mounted display). Furthermore, the service also incorporates a storytelling feature to diversify user experience by presenting the characteristics of and stories about artifacts. The service design will make both online and on-site museum experiences meaningful. Ultimately, this article presents the exhibition content thus created as Metaverse exhibition content made through an effective combination of augmented reality and a virtual world.", "link": "https://www.sciencedirect.com/science/article/pii/S026840121630175X", "source": "elsevier", "author": ["Hee-soo Choi", "Sang-Heon Kim"], "author_location": ["Dept. of History and Historical Content, Sangmyung University, 20, Hongjimun 2-gil, Jongno-gu, Seoul, 03016, South Korea"], "keywords": ["Museum", "Exhibition content", "Augmented reality", "Virtual reality", "Metaverse", "Beacon", "HMD"], "country": ["KR"], "citation": 104}
---------------------------------
{"title": "The actualization of meta affordances: Conceptualizing affordance actualization in the metaverse games.", "date": "2022", "publish": "Comput. Hum. Behav.", "abstract": "", "link": "https://www.sciencedirect.com/science/article/pii/S0747563222001145", "source": "elsevier", "author": ["Donghee Shin"], "author_location": ["College of Communication and Media Science, Zayed University, P.O. Box 144534, Abu Dhabi, United Arab Emirates"], "keywords": ["Metaverse", "Extended reality", "Affordance actualization", "Enactive interaction", "Affordance process", "The duality of metaverse", "Embodied cognition"], "country": ["AE"], "citation": 7}
---------------------------------
{"title": "Immersive virtual reality in the age of the Metaverse: A hybrid-narrative review based on the technology affordance perspective.", "date": "2022", "publish": "J. Strateg. Inf. Syst.", "abstract": "Immersive virtual reality (VR) that utilizes head-mounted displays (HMD) is one of the key emerging technologies of the 21st century and has drawn keen attention from consumers, practitioners, and scholars in various disciplines. Nevertheless, the information systems (IS) discipline has neglected immersive VR, given that only a handful of studies have been published in mainstream IS journals. However, the recent advancements in immersive VR technology provide new opportunities for organizations and IS researchers. In light of these points, we reviewed the immersive VR literature to provide a holistic view of opportunities and challenges for organizations and future research directions for the IS field. By examining the technical capabilities of immersive VR and the previous literature, we identified five affordances: , , , , and . Our review of the 151 studies from the IS and related fields synthesized how these affordances were utilized in various research domains. Guided by the affordance-actualization theory, we also identified the strategic opportunities and challenges that come with implementing VR. The actualization of immersive VR affordances in organizations is indeed a fruitful area for IS scholars as there are various venues to move the IS field as well as the VR research in the organizational context forward.", "link": "https://www.sciencedirect.com/science/article/pii/S0963868722000130", "source": "elsevier", "author": ["Ersin Dincelli", "Alper Yayla"], "author_location": ["Department of Information Systems, Business School, University of Colorado Denver, 1475 Lawrence Street, 5102 Denver, CO 80202, USA", "Information and Technology Management Department, Sykes College of Business, University of Tampa, 401 W. Kennedy Blvd., Tampa, FL 33606, USA"], "keywords": ["Virtual reality", "Head-mounted display", "Immersion", "Technology affordance", "Affordance-actualization", "Human–computer interaction"], "country": ["US", "US"], "citation": 6}
---------------------------------
{"title": "BlockNet: Beyond reliable spatial Digital Twins to Parallel Metaverse.", "date": "2022", "publish": "Patterns", "abstract": "The Metaverse is the expansion of Digital Twins in the fields of people and society. Although the Metaverse existed 10 years before the emergence of Digital Twins, it is still in the concept stage, and Digital Twins has been widely used in industries and other fields. Compared with Digital Twins, the Metaverse pays more attention to the organization, coding, and reliable storage of spatial data. This paper discusses the challenge of dealing with multiscale spatial data and discusses its multidimensional coding and storage.", "link": "https://www.sciencedirect.com/science/article/pii/S2666389922000484", "source": "elsevier", "author": ["Zhihan Lv", "Liang Qiao 0003", "Yuxi Li", "Yong Yuan", "Fei-Yue Wang 0001"], "author_location": ["Department of Game Design, Faculty of Arts, Uppsala University, Visby 62167, Sweden", "College of Computer Science & Technology, Qingdao University, Qingdao 266071, China", "School of Mathematics, Renmin University of China, Beijing 100872, China", "State Key Laboratory for Management and Control of Complex Systems, Institute of Automation, Chinese Academy of Sciences, Beijing 100190, China", "Institute of Systems Engineering, Macau University of Science and Technology, Macao 999078, China"], "keywords": ["Digital Twins", "Parallel Metaverse", "Geocode", "Blockchain"], "country": ["SE", "CN", "CN", "CN", "MO"], "citation": 4}
---------------------------------
{"title": "Virtual STEM Class for Nuclear Safety Education in Metaverse.", "date": "2014", "publish": "KES", "abstract": "The blend education of e-learning and hands-on activity was carried out, using Metaverse. The topic was picked up, relating to radioactivity, nuclear safety education and STEM education. The students were six 5 and 6 graders in an elementary school. The lecture was given to them through the virtual class in Metaverse (Second Life). And then, the hands-on experiments relating to radioactivity were carried out in real life, lead and guided by the teacher in Second Life synchronistically and supported by the teacher in real life sometimes. The questionnaire given to each of students after the hands-on experiments showed very clearly that the project satisfied with the original goals very well, from both viewpoints of STEM education and nuclear safety education at early stage (pre secondary) levels. We concluded that the blend education worked well for STEM education to much extent.", "link": "https://www.sciencedirect.com/science/article/pii/S1877050914011892", "source": "elsevier", "author": ["Hideyuki Kanematsu", "Toshiro Kobayashi", "Dana M. Barry", "Yoshimi Fukumura", "Asanka D. Dharmawansa", "Nobuyuki Ogawa"], "author_location": ["Suzuka National College of Technology, Shiroko-cho, Suzuka, Mie 510-0294, Japan", "Tsuyama National College of Technology, 624-1, Numa, Tsuyama, Okayama, 708-8509, Japan", "CAMP, Clarkson University, POBox 5665, Potsdam, New York, 13699, Japan", "Nagaoka University of Technology,1603-1, Kamitomioka-cho, Nagaoka, 940-2188, Niigata", "Gifu National College of Technology, 2236-2, Kamimakuwa, Motosu, Gifu,501-0495, Japan"], "keywords": ["STEM", "virtual Class", "Metaverse", "Second Life", "Nuclear Safety"], "country": ["JP", "JP", "JP", "JP", "JP"], "citation": 29}
---------------------------------
{"title": "Virtual Experiments in Metaverse and their Applications to Collaborative Projects: The framework and its significance.", "date": "2020", "publish": "KES", "abstract": "This paper introduces and describes a learning system for analyzing devices in a virtual world and points out its significance for current research collaboration. Now we are in Society 5.0, so daily problems should be solved by IoT (Internet of Things) with a mutual collaboration without borders. The authors need to collaborate with each other among remote organizations and different nations. For such situations, we need to establish the learning system for analyzing devices which would lead to an actual sharing system in the future. In this paper, the proposed concept for the learning system in metaverse is explained. The significance of the system is described, too.", "link": "https://www.sciencedirect.com/science/article/pii/S1877050920321529", "source": "elsevier", "author": ["Shin-nosuke Suzuki", "Hideyuki Kanematsu", "Dana M. Barry", "Nobuyuki Ogawa", "Kuniaki Yajima", "Katsuko T. Nakahira", "Tatsuya Shirai", "Masashi Kawaguchi", "Toshiro Kobayashi", "Michiko Yoshitake"], "author_location": ["National Institute of Technology (KOSEN), Oyama College, 771, Ooaza-Nakakuki, Oyama, Tochigi 323-0806, Japan", "National Institute of Technology (KOSEN), Suzuka College, Shiroko-cho, Suzuka, Mie 510-0294, Japan", "Clarkson University/SUNY Canton, Potsdam/Canton, New York State, the United States of America", "National Institute of Technology (KOSEN), Gifu College, Kami-Makuwa, Motosu, Gifu, 501-0495, Japan", "National Institute of Technology (KOSEN), Sendai College, 4-16-1, Ayashi Chuou, Aoba-ku, Sendai, Miyagi 989-3128, Japan", "Nagaoka University of Technology, 1603-1, Kami-Tomioka, Nagaoka, Niigata 940-2188, Japan", "National Institute of Technology (KOSEN), 624-1, Numa, Tsuyama, Okayama 708-8509, Japan", "National Institute for Materials Science, 1-1, Namiki, Tsukuba, Igaraki 305-0044, Japan"], "keywords": ["Learning system of analyzing devices", "remote sharing system of analyzing devices", "metaverse", "Second Life"], "country": ["JP", "JP", "US", "JP", "JP", "JP", "JP", "JP"], "citation": 35}
---------------------------------
{"title": "MetaVehicles in the Metaverse: Moving to a New Phase for Intelligent Vehicles and Smart Mobility.", "date": "2022", "publish": "IEEE Trans. Intell. Veh.", "abstract": "Presents the introductory editorial for this issue of the publication.", "source": "ieee", "author": ["Fei-Yue Wang 0001"], "author_location": ["The State Key Laboratory for Management and Control of Complex Systems, Institute of Automation, Chinese Academy of Sciences, Beijing, China"], "keywords": [], "link": "https://doi.org/10.1109/TIV.2022.3154489", "country": ["CN"], "citation": 14}
---------------------------------
{"title": "Fusing Blockchain and AI With Metaverse: A Survey.", "date": "2022", "publish": "IEEE Open J. Comput. Soc.", "abstract": "Metaverse as the latest buzzword has attracted great attention from both industry and academia. Metaverse seamlessly integrates the real world with the virtual world and allows avatars to carry out rich activities including creation, display, entertainment, social networking, and trading. Thus, it is promising to build an exciting digital world and to transform a better physical world through the exploration of the metaverse. In this survey, we dive into the metaverse by discussing how Blockchain and Artificial Intelligence (AI) fuse with it through investigating the state-of-the-art studies across the metaverse components, digital currencies, AI applications in the virtual world, and blockchain-empowered technologies. Further exploitation and interdisciplinary research on the fusion of AI and Blockchain towards metaverse will definitely require collaboration from both academia and industries. We wish that our survey can help researchers, engineers, and educators build an open, fair, and rational future metaverse.", "source": "ieee", "author": ["Qinglin Yang", "Yetong Zhao", "Huawei Huang", "Zehui Xiong", "Jiawen Kang", "Zibin Zheng"], "author_location": ["School of Intelligent Systems Engineering, Sun Yat-sen University, Shenzhen, China", "School of Computer Science, Engineering, Sun Yat-sen University, Guangzhou, China", "School of Computer Science, Engineering, Sun Yat-sen University, Guangzhou, China", "Singapore University of Technology and Design, Singapore", "School of Automation, Guangdong University of Technology, Guangzhou, China", "School of Computer Science, Engineering, Sun Yat-sen University, Guangzhou, China"], "keywords": [], "link": "https://doi.org/10.1109/OJCS.2022.3188249", "country": ["CN", "CN", "CN", "SG", "CN", "CN"], "citation": 46}
---------------------------------
{"title": "MetaSocieties in Metaverse: MetaEconomics and MetaManagement for MetaEnterprises and MetaCities.", "date": "2022", "publish": "IEEE Trans. Comput. Soc. Syst.", "abstract": "Welcome to the first issue of the IEEE Transactions on Computational Social Systems (TCSS) of 2022. We would like to take this opportunity to express our sincere thanks to our associate editors, reviewers, authors, and readers for your great support and effort devoted to IEEE TCSS. Happy New Year to you all, and cheers to health, happiness, and high-producing in 2022!", "source": "ieee", "author": ["Fei-Yue Wang 0001", "Rui Qin 0002", "Xiao Wang 0002", "Bin Hu 0001"], "author_location": ["The State Key Laboratory for Management and Control of Complex Systems, Institute of Automation Chinese Academy of Sciences, Beijing, China", "The State Key Laboratory for Management and Control of Complex Systems, Institute of Automation Chinese Academy of Sciences, Beijing, China", "The State Key Laboratory for Management and Control of Complex Systems, Institute of Automation Chinese Academy of Sciences, Beijing, China", "Gansu Provincial Key Laboratory of Wearable Computing School of Information Science and Engineering, Lanzhou University, Gansu, China"], "keywords": [], "link": "https://doi.org/10.1109/TCSS.2022.3145165", "country": ["CN", "CN", "CN", "CN"], "citation": 28}
---------------------------------
{"title": "Web 3.0 and the Metaverse Shaping Organizations' Brand and Product Strategies.", "date": "2022", "publish": "IT Prof.", "abstract": "Investments in Web 3.0 and the metaverse are growing rapidly. This paper focuses on the impacts of these developments on organizations' brand and product strategies.", "source": "ieee", "author": ["Nir Kshetri"], "author_location": ["The University of North Carolina at Greensboro, Greensboro, NC, USA"], "keywords": [], "link": "https://doi.org/10.1109/MITP.2022.3157206", "country": ["US"], "citation": 3}
---------------------------------
{"title": "Policy, Ethical, Social, and Environmental Considerations of Web3 and the Metaverse.", "date": "2022", "publish": "IT Prof.", "abstract": "This editorial analyzes national, political, global geopolitical, ethical, social, and environmental issues associated with Web3 and the metaverse. It also introduces the feature articles, columns, and departments that appear in this issue.", "source": "ieee", "author": ["Nir Kshetri"], "author_location": ["The University of North Carolina at Greensboro, Greensboro, NC, USA"], "keywords": [], "link": "https://doi.org/10.1109/MITP.2022.3178509", "country": ["US"], "citation": 1}
---------------------------------
{"title": "Building a Human-Intelligent Metaverse.", "date": "2022", "publish": "Computer", "abstract": "This article describes research into computational human perception’s potential to be the core of a human-intelligent metaverse, a sensed world that interacts with our physical, emotional, and mental states.", "source": "ieee", "author": ["Michael Zyda"], "author_location": ["University of Southern California"], "keywords": [], "link": "https://doi.org/10.1109/MC.2022.3182035", "country": ["US"], "citation": 0}
---------------------------------
{"title": "Let's Rename Everything \"the Metaverse!\".", "date": "2022", "publish": "Computer", "abstract": "All of the different Metaversi currently cannot share your friends list, your avatar, or any in-game experience you have had. This needs to be engineered in from the start for the Metaverse to succeed.", "source": "ieee", "author": ["Michael Zyda"], "author_location": ["University of Southern California"], "keywords": [], "link": "https://doi.org/10.1109/MC.2021.3130480", "country": ["US"], "citation": 15}
---------------------------------
{"title": "Edge Intelligence-Based Ultra-Reliable and Low-Latency Communications for Digital Twin-Enabled Metaverse.", "date": "2022", "publish": "IEEE Wirel. Commun. Lett.", "abstract": "In this letter, we propose a novel digital twin scheme supported metaverse by jointly considering the integrated model of communications, computing, and storage through the employment of mobile edge computing (MEC) and ultra-reliable and low latency communications (URLLC). The MEC-based URLLC digital twin architecture is proposed to provide powerful computing infrastructure by exploring task offloading, and task caching techniques in nearby edge servers to reduce the latency. In addition, the proposed digital twin scheme can guarantee stringent requirements of reliability and low latency, which are highly applicable for the future networked systems of metaverse. For this first time in the literature, our paper addresses the optimal problem of the latency/reliablity in digital twins-enabled metaverse by optimizing various communication and computation variables, namely, offloading portions, edge caching policies, bandwidth allocation, transmit power, computation resources of user devices and edge servers. The proposed scheme can improve the quality-of-experience of the digital twin in terms of latency and reliability with respect to metaverse applications.", "source": "ieee", "author": ["Dang Van-Huynh", "Saeed R. Khosravirad", "Antonino Masaracchia", "Octavia A. Dobre", "Trung Q. Duong"], "author_location": ["Queen’s University Belfast, Belfast, U.K.", "Nokia Bell Labs, Chicago, IL, USA", "Queen’s University Belfast, Belfast, U.K.", "Memorial University, St. John’s, NL, Canada", "Queen’s University Belfast, Belfast, U.K."], "keywords": [], "link": "https://doi.org/10.1109/LWC.2022.3179207", "country": ["GB", "US", "GB", "CA", "GB"], "citation": 7}
---------------------------------
{"title": "Neuro-Symbolic Speech Understanding in Aircraft Maintenance Metaverse.", "date": "2021", "publish": "IEEE Access", "abstract": "In the emerging world of metaverses, it is essential for speech communication systems to be aware of context to interact with virtual assets in the 3D world. This paper proposes the metaverse for aircraft maintenance training and education of Boeing-737, supplied with legacy manuals, 3D models, 3D simulators, and aircraft maintenance knowledge. Furthermore, to navigate and control operational flow in the metaverse, which is strictly followed by maintenance manuals, the context-aware speech understanding module Neuro-Symbolic Speech Executor (NSSE) is presented. Unlike conventional speech recognition methods, NSSE applies Neuro-Symbolic AI, which combines neural networks and traditional symbolic reasoning, to understand users’ requests and reply based on context and aircraft-specific knowledge. NSSE is developed with an industrially flexible approach by applying only synthetic data for training. Nevertheless, the evaluation process performed with various automatic speech recognition metrics on real users’ data showed sustainable results with an average accuracy of 94.7%, Word Error Rate (WER) of 7.5%, and the generalization ability to handle speech requests of users with the non-native pronunciation. The proposed Aircraft Maintenance Metaverse is a cheap and scalable solution for aviation colleges since it replaces expensive physical aircraft with virtual one that can be easily modified and updated. Moreover, the Neuro-Symbolic Speech Executor, playing the role of field expert, provides technical guidance and all the resources to facilitate effective training and education of aircraft maintenance.", "source": "ieee", "author": ["Aziz Siyaev", "Geun-Sik Jo"], "author_location": ["Department of Electrical and Computer Engineering, Artificial Intelligence Laboratory, Inha University, Incheon, South Korea", "Department of Electrical and Computer Engineering, Artificial Intelligence Laboratory, Inha University, Incheon, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/ACCESS.2021.3128616", "country": ["KR", "KR"], "citation": 26}
---------------------------------
{"title": "A Metaverse: Taxonomy, Components, Applications, and Open Challenges.", "date": "2022", "publish": "IEEE Access", "abstract": "Unlike previous studies on the Metaverse based on Second Life, the current Metaverse is based on the social value of Generation Z that online and offline selves are not different. With the technological development of deep learning-based high-precision recognition models and natural generation models, Metaverse is being strengthened with various factors, from mobile-based always-on access to connectivity with reality using virtual currency. The integration of enhanced social activities and neural-net methods requires a new definition of Metaverse suitable for the present, different from the previous Metaverse. This paper divides the concepts and essential techniques necessary for realizing the Metaverse into three components (i.e., hardware, software, and contents) and three approaches (i.e., user interaction, implementation, and application) rather than marketing or hardware approach to conduct a comprehensive analysis. Furthermore, we describe essential methods based on three components and techniques to Metaverse’s representative Ready Player One, Roblox, and Facebook research in the domain of films, games, and studies. Finally, we summarize the limitations and directions for implementing the immersive Metaverse as social influences, constraints, and open challenges.", "source": "ieee", "author": ["Sang-Min Park", "Young-Gab Kim"], "author_location": ["Department of Computer Science and Engineering, Korea University, Seoul, South Korea", "Department of Computer and Information Security, and Convergence Engineering for Intelligent Drone, Sejong University, Seoul, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/ACCESS.2021.3140175", "country": ["KR", "KR"], "citation": 174}
---------------------------------
{"title": "Prediction of User's Intention to Use Metaverse System in Medical Education: A Hybrid SEM-ML Learning Approach.", "date": "2022", "publish": "IEEE Access", "abstract": "Metaverse (MS) is a digital universe accessible through a virtual environment. It is established through the merging of virtually improved physical and digital reality. Metaverse (MS) offers enhanced immersive experiences and a more interactive learning experience for students in learning and educational settings. It is an expanded and synchronous communication setting that allows different users to share their experiences. The present study aims to evaluate students’ perception of the application of MS in the United Arab Emirates (UAE) for medical-educational purposes. In this study, 1858 university students were surveyed to examine this model. The study’s conceptual framework consisted of adoption constructs including Technology Acceptance Model (TAM), Personal innovativeness (PI), Perceived Compatibility (PCO), User Satisfaction (US), Perceived Triability (PTR), and Perceived Observability (POB). The study was unique because the model correlated technology-based features and individual-based features. The study also used hybrid analyses such as Machine Learning (ML) algorithms and Structural Equation Modelling (SEM). The present study also employs the Importance Performance Map Analysis (IPMA) to assess the importance and performance factors. The study finds US as an essential determinant of users’ intention to use the metaverse (UMS). The present study’s finding is useful for stakeholders in the educational sector in understanding the importance of each factor and in making plans based on the order of significance of each factor. The study also methodologically contributes to Information Systems (IS) literature because it is one of the few studies that have used a complementary multi-analytical approach such as ML algorithms to investigate the UMS metaverse systems.", "source": "ieee", "author": ["Amina Al-Marzouqi", "Ahmad Aburayya", "Said A. Salloum"], "author_location": ["Department of Health Service Administration, College of Health Sciences, University of Sharjah, Sharjah, United Arab Emirates", "Quality and Corporate Development Office, Dubai Health Authority, Dubai, United Arab Emirates", "School of Science, Engineering, and Environment, University of Salford, Manchester, U.K."], "keywords": [], "link": "https://doi.org/10.1109/ACCESS.2022.3169285", "country": ["AE", "AE", "US"], "citation": 20}
---------------------------------
{"title": "Decentralized AI: Edge Intelligence and Smart Blockchain, Metaverse, Web3, and DeSci.", "date": "2022", "publish": "IEEE Intell. Syst.", "abstract": "Centralization has dominated classic scientific, social, and economic developments. Decentralization has also received increasing attention in management, decision, governance, and economics, despite its incomparability in AI. Going beyond centralized and distributed AI, this article reviews and delineates the conceptual map, research issues, and technical opportunities of decentralized AI and edge intelligence. The complementarity and metasynthesis between centralized and decentralized AI are also elaborated. We further assess where decentralized AI and edge intelligence can enable and promote smart blockchain, Web3, metaverse and decentralized science disciplinarily, technically, practically, and more broadly.", "source": "ieee", "author": ["Longbing Cao"], "author_location": ["University of Technology Sydney, Sydney, NSW, Australia"], "keywords": [], "link": "https://doi.org/10.1109/MIS.2022.3181504", "country": ["AU"], "citation": 7}
---------------------------------
{"title": "Parallel Intelligence in Metaverses: Welcome to Hanoi!", "date": "2022", "publish": "IEEE Intell. Syst.", "abstract": "This article outlines a journey toward the TRUE DAO System of Intelligent Systems based parallel intelligence with the help of digital twins, metaverses, web 3.0, and blockchain technology. It argues for a HANOI approach, i.e., integrated Human, Artificial, Natural, and Organizational Intelligence for achieving knowledge automation for sustainable and smart societies.", "source": "ieee", "author": ["Fei-Yue Wang 0001"], "author_location": ["The State Key Laboratory for Management and Control of Complex Systems, Chinese Academy of Sciences, Beijing, China"], "keywords": [], "link": "https://doi.org/10.1109/MIS.2022.3154541", "country": ["CN"], "citation": 22}
---------------------------------
{"title": "Research on Application of Virtual Reality Technology to Create Metaverse Podcasts.", "date": "2022", "publish": "ICCE-TW", "abstract": "This study proposes a metaverse podcast by avatar scene that combines VRM 3D Model, facial expressions and body language, by means of real-time import of face capture and motion capture into the mirror-like software, and outputs the image as a virtual camera. By faithfully presenting the process of verbal expression and behavioral response, the image of the virtual avatar is more vivid and closer to the other self. The importance of the facial expression of the virtual avatar in the expression process is studied, which also increases the possibility of development of virtual reality technology.", "source": "ieee", "author": ["Meng-Han Lee", "Ju-Chun Ko"], "author_location": ["Department of Interaction Design, National Taipei University of Technology", "Department of Interaction Design, National Taipei University of Technology"], "keywords": [], "link": "https://doi.org/10.1109/ICCE-Taiwan55306.2022.9869175", "country": ["US", "US"], "citation": 0}
---------------------------------
{"title": "A Cross-Chain Protocol based on Quantum Teleportation for Underlying Architecture of Metaverse.", "date": "2022", "publish": "ICCCS", "abstract": "In this era of technological change, metaverse has attracted extensive attention from all over the world as next-generation internet. Blockchain technology plays an indispensable role in realizing the independent digital identity and economic system which are the significant attributes of the metaverse. To achieve the cross-universe mechanism and reduce network resource consumption, this paper proposes a cross-chain protocol for the underlying architecture of metaverse that utilizes an identity information chain to guarantee the separate digital identity of users and decrease the data interaction between varied consortium blockchains. However, along with the rapid development of quantum computing, the classical cryptosystems which commonly count on mathematical complexity will not be reliable and secure. The current post-quantum cryptography technologies that increase the time complexity of algorithm will lead to quite low efficiency and high resource overhead while applying to blockchain structures. But quantum cryptography is capable of lifting both security and efficiency of blockchain. As a result, the scheme put forward in the article adopts quantum teleportation to implement secure communication. In addition, to assure the atomicity of cross-chain transactions that cross-chain asset exchanges succeed or fail simultaneously, a quantum time lock that improves the previous studies and combines quantum cryptography technology is proposed.", "source": "ieee", "author": ["Yu Cui"], "author_location": ["School of Information Engineering, North China University of Technology, Beijing, China"], "keywords": [], "link": "https://doi.org/10.1109/ICCCS55155.2022.9845967", "country": ["CN"], "citation": 0}
---------------------------------
{"title": "MetaChain: A Novel Blockchain-based Framework for Metaverse Applications.", "date": "2022", "publish": "VTC Spring", "abstract": "Metaverse has recently attracted paramount attention due to its potential for future Internet. However, to fully realize such potential, Metaverse applications have to overcome various challenges such as massive resource demands, interoperability among applications, and security and privacy concerns. In this paper, we propose MetaChain, a novel blockchain-based framework to address emerging challenges for the development of Metaverse applications. In particular, by utilizing the smart contract mechanism, MetaChain can effectively manage and automate complex interactions among the Metaverse Service Provider (MSP) and the Metaverse users (MUs). In addition, to allow the MSP to efficiently allocate its resources for Metaverse applications and MUs’ demands, we design a novel sharding scheme to improve the underlying blockchain’s scalability. Moreover, to leverage MUs’ resources as well as to attract more MUs to support Metaverse operations, we develop an incentive mechanism using the Stackelberg game theory that rewards MUs’ contributions to the Metaverse. Through numerical experiments, we clearly show the impacts of the MUs’ behaviors and how the incentive mechanism can attract more MUs and resources to the Metaverse.", "source": "ieee", "author": ["Cong T. Nguyen", "Dinh Thai Hoang", "Diep N. Nguyen", "Eryk Dutkiewicz"], "author_location": ["School of Electrical and Data Engineering, University of Technology, Sydney, Australia", "School of Electrical and Data Engineering, University of Technology, Sydney, Australia", "School of Electrical and Data Engineering, University of Technology, Sydney, Australia", "School of Electrical and Data Engineering, University of Technology, Sydney, Australia"], "keywords": [], "link": "https://doi.org/10.1109/VTC2022-Spring54318.2022.9860983", "country": ["AU", "AU", "AU", "AU"], "citation": 13}
---------------------------------
{"title": "Fuzzy Ontology-based Intelligent Agent for High-School Student Learning in AI-FML Metaverse.", "date": "2022", "publish": "FUZZ-IEEE", "abstract": "This article applies the fuzzy ontology concepts of Heart Sutra to artificial intelligence (AI) for elementary and high-school students learning English and fuzzy markup language (FML) in AI-FML Metaverse. Computational Intelligence (CI) is an imperative branch of AI and it includes fuzzy logic (FL), neural network (NN), and evolutionary computation (EC). Based on the technologies of reinforcement learning (RL), intelligent agent, ontology, and AI-FML human and machine co-learning, we propose a fuzzy ontology-based intelligent agent for young students to learn and experience CI applications, including basic concepts of FL, NN, and EC, on the AI-FML Metaverse platform. Additionally, we combine the core technologies of fuzzy ontology and AI-FML with the tenets of the Heart Sutra for constructing the intelligent agent in the AI-FML Metaverse with computational, perceptive, and cognitive intelligence. Moreover, we also apply the human semantic understanding of the Heart Sutra to explain the concept of the AI-FML Metaverse platform to elementary and high-school students to learn and experience CI. The intelligent agent interacts with the environment of the learning field and AI-FML Metaverse, it can help teachers and students evaluate learners’ interest in each episode’s learning content. Finally, it predicts their learning temperature in thermometers to present learners’ performance in the learning contents, such as English or CI application. After evaluating the implementation of AI-FML Metaverse in the elementary school (grades 5-6), junior high school (grades 7-8), and senior high school (grades 10-12) students in Taiwan, we observe that the intelligent agent can work effectively and students’ learning thermometer has an increasing tendency at the end of the 2021 fall semesters in AI-FML Metaverse and 2022 AI-FML winter camp in Taiwan.", "source": "ieee", "author": ["Chang-Shing Lee", "Mei-Hui Wang", "Sheng-Hui Huang", "Fu-Jie Yang", "Chun-Hao Tsai", "Ling-Qing Wang"], "author_location": ["Dept. of Computer Science and Information Engineering, National University of Tainan, Tainan, Taiwan", "Dept. of Computer Science and Information Engineering, National University of Tainan, Tainan, Taiwan", "Dept. of Computer Science and Information Engineering, National University of Tainan, Tainan, Taiwan", "Dept. of Computer Science and Information Engineering, National University of Tainan, Tainan, Taiwan", "Dept. of Computer Science and Information Engineering, National University of Tainan, Tainan, Taiwan", "Dept. of Computer Science and Information Engineering, National University of Tainan, Tainan, Taiwan"], "keywords": [], "link": "https://doi.org/10.1109/FUZZ-IEEE55066.2022.9882549", "country": ["TW", "TW", "TW", "TW", "TW", "TW"], "citation": 0}
---------------------------------
{"title": "Second Life Gift Registry: Bringing Retail Web Applications into the Metaverse.", "date": "2008", "publish": "SERVICES I", "abstract": "The combination of realistic virtual environments and product information offers a compelling new medium for consumers to shop for products. Specifically, by combining the experience of exploring a virtual house with retail information on items in that house, a consumer can virtually populate a house with desired items. This is particularly appealing for people, such as a couple getting married, who are looking to furnish an entire house with newly-purchased items. The system proposed in this paper provides this combination of realistic, 3D visualization and detailed product information. It uses Second Life to provide the realistic user interface, and a REST-style web-based application to create connections between this platform and publicly-available retailer APIs. In cases where a retailer API is unavailable, HTML wrapping may be used to obtain equivalent information. The economic viability of the concept is examined through a business case study.", "source": "ieee", "author": ["David Chodos", "Eleni Stroulia"], "author_location": ["Department of Computing Science, University of Alberta, Edmonton, Canada", "Department of Computing Science, University of Alberta, Edmonton, Canada"], "keywords": [], "link": "https://doi.org/10.1109/SERVICES-1.2008.72", "country": ["CA", "CA"], "citation": 2}
---------------------------------
{"title": "Wireless Edge-Empowered Metaverse: A Learning-Based Incentive Mechanism for Virtual Reality.", "date": "2022", "publish": "ICC", "abstract": "The Metaverse is regarded as the next-generation Internet paradigm that allows humans to play, work, and socialize in an alternative virtual world with an immersive experience, for instance, via head-mounted displays for Virtual Reality (VR) rendering. With the help of ubiquitous wireless connections and powerful edge computing technologies, VR users in the wireless edge-empowered Metaverse can immerse themselves in the virtual through the access of VR services offered by different providers. However, VR applications are computation- and communication-intensive. The VR service providers (SPs) have to optimize the VR service delivery efficiently and economically given their limited communication and computation resources. An incentive mechanism can be thus applied as an effective tool for managing VR services between providers and users. Therefore, in this paper, we propose a learning-based Incentive Mechanism framework for VR services in the Metaverse. First, we propose the quality of perceptual experience as the metric for VR users immersing in the virtual world. Second, for quick trading of VR services between VR users (i.e., buyers) and VR SPs (i.e., sellers), we design a double Dutch auction mechanism to determine optimal pricing and allocation rules in this market. Third, for auction information exchange cost reduction, we design a deep reinforcement learning-based auctioneer to accelerate this auction process. Experimental results demonstrate that the proposed framework can achieve near-optimal social welfare while reducing at least half of the auction information exchange cost than baseline methods.", "source": "ieee", "author": ["Minrui Xu", "Dusit Niyato", "Jiawen Kang", "Zehui Xiong", "Chunyan Miao", "Dong In Kim"], "author_location": ["School of Computer Science and Engineering, Nanyang Technological University, Singapore", "School of Computer Science and Engineering, Nanyang Technological University, Singapore", "School of Automation, Guangdong University of Technology, China", "Pillar of Information Systems Technology and Design, Singapore University of Technology and Design, Singapore", "School of Computer Science and Engineering, Nanyang Technological University, Singapore", "Department of Electrical and Computer Engineering, Sungkyunkwan University, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/ICC45855.2022.9838736", "country": ["SG", "SG", "CN", "SG", "SG", "KR"], "citation": 22}
---------------------------------
{"title": "Metaverse Native Communication: A Blockchain and Spectrum Prospective.", "date": "2022", "publish": "ICC Workshops", "abstract": "Metaverse depicts a vista of constructing a virtual environment parallel to the real world so people can communicate with others and objects through digital entities. In the real world, communication relies on identities and addresses that are recognized by authorities, no matter the link is established via post, email, mobile phone, or landline. Metaverse, however, is different from the real world, which requires a single identity belongs to the individual. This identity can be an encrypted virtual address in the metaverse but no one can trace or verify it. In order to achieve such addresses to hide individuals in the metaverse, re-mapping the virtual address to the individual\\'s identity and a specific spectrum to support the address-based communication for the metaverse are needed. Therefore, metaverse native or meta-native communications based on blockchain could be a promising solution to directly connect entities with their native encrypted addresses that gets rid of the existing network services based on IP, cellular, HTTP, etc. This paper proposes a vision of blockchain, encrypted address and address-based access model for all users, devices, services, etc. to contribute to the meta-verse. Furthermore, the allocation architecture of a designated spectrum for the metaverse is proposed to remove the barrier to access to the metaverse/blockchain in response to the initiatives of metaverse and decentralized Internet.", "source": "ieee", "author": ["Hao Xu", "Zihao Li", "Zongyao Li", "Xiaoshuai Zhang", "Yao Sun", "Lei Zhang 0035"], "author_location": ["James Watt School of Engineering, University of Glasgow, UK", "CREATe Centre, School of Law, University of Glasgow, UK", "James Watt School of Engineering, University of Glasgow, UK", "James Watt School of Engineering, University of Glasgow, UK", "James Watt School of Engineering, University of Glasgow, UK", "James Watt School of Engineering, University of Glasgow, UK"], "keywords": [], "link": "https://doi.org/10.1109/ICCWorkshops53468.2022.9814538", "country": ["US", "US", "US", "US", "US", "US"], "citation": 4}
---------------------------------
{"title": "Metaverse: Security and Privacy Issues.", "date": "2021", "publish": "TPS-ISA", "abstract": "The metaverse promises a host of bright opportunities for business, economics, and society. Though, a number of critical aspects are still to be considered and the analysis of their impact is almost non-existent. In this paper, we provide several contributions. We start by analysing the foundations of the metaverse, later we focus on the novel privacy and security issues introduced by this new paradigm, and finally we broaden the scope of the contribution highlighting some of the far-reaching yet logical implications of the metaverse on a number of domains, not all of them in tech. Throughout the paper, we also discuss possible research directions. We believe that the provided holistic view on the foundations, technology, and issues related to the metaverse-with a focus on security and privacy-, other than being an interesting contribution on its own, could also pave the way for a few multidisciplinary research avenues.", "source": "ieee", "author": ["Roberto Di Pietro", "Stefano Cresci"], "author_location": ["College of Science and Engineering (CSE), Hamad Bin Khalifa University (HBKU), Doha, Qatar", "National Research Council (CNR), Institute of Informatics and Telematics (IIT), Pisa, Italy"], "keywords": [], "link": "https://doi.org/10.1109/TPSISA52974.2021.00032", "country": ["QA", "IT"], "citation": 14}
---------------------------------
{"title": "Recent Advances in a Medical Domain Metaverse: Status, Challenges, and Perspective.", "date": "2022", "publish": "ICUFN", "abstract": "The Meta-verse is the new, innovative platform in which is being investigated by every industry. The thought of simulating reality in a digital platform was never inconceivable but seemed distant. Now, it is taking over every industry like wildfire and the possibilities seem endless. Recently, the healthcare industry is looking into implementing the qualities of the metaverse within specialties and practices of medical professionals. This space encompasses a variety of factors such as virtual reality, augmented reality, and secured spaces for communication and processes. The healthcare industry has been looking into methods to increase patient experience and broadening the accessibility of medical care. Although the concept of the metaverse is not new, the uses are still unexplored and has to many unknowns. In an industry where patient data is critical and remains at the upmost level of privacy, it is unsure that it will remain with its integrity still intact. This paper is aiming to explore the use of the meta-verse in the healthcare industry along with the current status, challenges, and perspective of applicable technology and practices. To be more specific, we focused on the outpatient telemedicine practice experience using body sensor networks and the challenges of maintaining privacy in a healthcare metaverse space.", "source": "ieee", "author": ["Jose M. Ruiz Mejia", "Danda B. Rawat"], "author_location": ["Department of Electrical Engineering and Computer Science, Howard University, Washington, D.C., USA", "Department of Electrical Engineering and Computer Science, Howard University, Washington, D.C., USA"], "keywords": [], "link": "https://doi.org/10.1109/ICUFN55119.2022.9829645", "country": ["US", "US"], "citation": 1}
---------------------------------
{"title": "Connecting Everyday Objects with the Metaverse: A Unified Recognition Framework.", "date": "2022", "publish": "COMPSAC", "abstract": "The recent Facebook rebranding to Meta has drawn renewed attention to the metaverse. Technology giants, amongst others, are increasingly embracing the vision and opportunities of a hybrid social experience that mixes physical and virtual interactions. As the metaverse gains in traction, it is expected that everyday objects may soon connect more closely with virtual elements. However, discovering this “hidden” virtual world will be a crucial first step to interacting with it in this new augmented world. In this paper, we address the problem of connecting phys-ical objects with their virtual counterparts, especially through connections built upon visual markers. We propose a unified recognition framework that guides approaches to the metaverse access points. We illustrate the use of the framework through experimental studies under different conditions, in which an interactive and visually attractive decoration pattern, an Artcode, is used as the approach to enable the connection. This paper will be of interest to, amongst others, researchers working in Interaction Design or Augmented Reality who are seeking techniques or guidelines for augmenting physical objects in an unobtrusive, complementary manner.", "source": "ieee", "author": ["Liming Xu", "Dave Towey", "Andrew P. French", "Steve Benford"], "author_location": ["Department of Engineering, University of Cambridge, Cambridge, United Kingdom", "School of Computer Science, University of Nottingham Ningbo China, Ningbo, China", "School of Computer Science, University of Nottingham, Nottingham, United Kingdom", "School of Computer Science, University of Nottingham, Nottingham, United Kingdom"], "keywords": [], "link": "https://doi.org/10.1109/COMPSAC54236.2022.00063", "country": ["US", "CN", "GB", "GB"], "citation": 0}
---------------------------------
{"title": "Toward Imagined Speech based Smart Communication System: Potential Applications on Metaverse Conditions.", "date": "2022", "publish": "BCI", "abstract": "Metaverse provides an alternative platform for human interaction in the virtual world. Since virtual platform holds few restrictions in changing the surrounding environments or the appearance of the avatars, it can serve as a platform that reflects human thoughts or even dreams at least in the metaverse world. When it is merged together with the current brain-computer interface (BCI) technology, which enables system control via brain signals, a new paradigm of human interaction through mind may be established in the metaverse conditions. Recent BCI systems are aiming to provide user-friendly and intuitive means of communication using brain signals. Imagined speech has become an alternative neuro-paradigm for communicative BCI since it relies directly on a person’s speech production process, rather than using speech-unrelated neural activity as the means of communication. In this paper, we propose a brain-to-speech (BTS) system for real-world smart communication using brain signals. Also, we show a demonstration of imagined speech based smart home control through communication with a virtual assistant, which can be one of the future applications of brain-metaverse system. We performed pseudo-online analysis using imagined speech electroencephalography data of nine subjects to investigate the potential use of virtual BTS system in the real-world. Average accuracy of 46.54 ± 9.37 % and 75.56 ± 5.83 % was acquired in the thirteen-class and binary pseudo-online analysis, respectively. Our results support the potential of imagined speech based smart communication to be applied in the metaverse world.", "source": "ieee", "author": ["Seo-Hyun Lee", "Young Eun Lee", "Seong-Whan Lee"], "author_location": ["Dept. Brain and Cognitive Engineering, Korea University, Seoul, Republic of Korea", "Dept. Brain and Cognitive Engineering, Korea University, Seoul, Republic of Korea", "Dept. Artificial Intelligence, Korea University, Seoul, Republic of Korea"], "keywords": [], "link": "https://doi.org/10.1109/BCI53720.2022.9734827", "country": ["KR", "KR", "KR"], "citation": 3}
---------------------------------
{"title": "Metaverses as a Platform for Game Based Learning.", "date": "2010", "publish": "AINA", "abstract": "This paper evaluates metaverses as a platform for game based learning. Metaverses such as Second Life are a relatively new type of Internet application. Their functionality is similar to that offered by 3D multi-player online games, but differs in that users are able to construct the environment that avatars inhabit and are not constrained by predefined goals of the type found within a game environment. From a quality of service (QoS) perspective metaverses are similar to games in that the timeliness of network communication is important, but differ in that their demands upon host server systems and network traffic are more bandwidth intensive. This paper contributes to our understanding of metaverses by presenting a case study of the application of Game Based Learning (GBL) within a metaverse environment, by situating the case study within a survey of the state of the art in GBL in metaverses and by analysing the QoS delivered by the widely used Second Life metaverse under a range of evaluator-induced network conditions.", "source": "ieee", "author": ["Kristoffer Getchell", "Iain Oliver", "Alan Miller", "Colin Allison"], "author_location": ["Information Services (Infrastructure), Kingston University, Kingston Upon Thames, Surrey, UK", "School of Computer Science, University of Saint Andrews, Saint Andrews, Fife, UK", "School of Computer Science, University of Saint Andrews, Saint Andrews, Fife, UK", "School of Computer Science, University of Saint Andrews, Saint Andrews, Fife, UK"], "keywords": [], "link": "https://doi.org/10.1109/AINA.2010.125", "country": ["CA", "US", "US", "US"], "citation": 29}
---------------------------------
{"title": "(Re) Building Proun #5A in the Metaverse.", "date": "2014", "publish": "CW", "abstract": "During the years of Suprematism, between 1919 and 1923 in Russia, one of the movement\\'s most significant contributors, architect, artist and designer El Lissitzky developed a series of works which he entitled \\\\\"Prouns\\\\\" a name the exact meaning of which El Lissitzky never fully revealed, although he later described the purpose of his creations as interchange stations from painting to architecture, i.e., From two dimensional to three dimensional visuality. The author has re-created El Lissitzky\\'s \\\\\"Proun 5A\\\\\" from 1919 in the metaverse, as an architecture for avatars. The process in which the translation from analogue drawing to three dimensional digital artifact was undertaken, the challenges encountered during its re-building, framed within a literature review that examines both El Lissitzky\\'s influence on contemporary cyber-architecture, as well as the significance of his spatial investigations and his sources of inspiration during the early decades of the twentieth century will form the contents of this text.", "source": "ieee", "author": ["Elif E. Ayiter"], "author_location": ["Sabanci University, Istanbul, Turkey"], "keywords": [], "link": "https://doi.org/10.1109/CW.2014.63", "country": ["TR"], "citation": 3}
---------------------------------
{"title": "Further Dimensions: Text, Typography and Play in the Metaverse.", "date": "2012", "publish": "CW", "abstract": "In this text I wish to delve into the creation of textual content as well as its visualization through typographic design mechanisms inside three dimensional virtual worlds, which are known as the metaverse. I am particularly focused upon the way in which such virtually three dimensional environments may place the usage of text within a context that stands in contradiction to its traditional one by creating an unexpected novel purpose which takes a marked departure from the intrinsic attribute with which text has inherently been associated - namely the attribute of readability. In such environments readability, or indeed even legibility, may often be displaced through the usage of text and typography as a playful device, as artifacts which may manifest in puzzle-like configurations, or as visual structures the contents of which are meant to be understood through means other than straightforward reading, thus bringing about states of heightened engagement, wonder and \\'play\\' through their manipulation or indeed simply by being immersed within the spaces which are brought about through their very agency. I also wish to expand upon this subject by talking about my own experiments with this material and will conclude by positing that further virtual dimensions can be instrumental in eliciting exciting alternative usages of text and typography which bring to the fore the allographic properties of text as an artistic/creative expressive media that may well bear further scrutiny and exploration.", "source": "ieee", "author": ["Elif E. Ayiter"], "author_location": ["Sabanci University, Istanbul, Turkey"], "keywords": [], "link": "https://doi.org/10.1109/CW.2012.50", "country": ["TR"], "citation": 11}
---------------------------------
{"title": "ArSL21L: Arabic Sign Language Letter Dataset Benchmarking and an Educational Avatar for Metaverse Applications.", "date": "2022", "publish": "EDUCON", "abstract": "It is complicated for the PwHL (people with hearing loss) to make a relationship with social majority, which naturally demands an interactive auto computer systems that have ability to understand sign language. With a trending Metaverse applications using augmented reality (AR) and virtual reality (VR), it is easier and interesting to teach sign language remotely using an avatar that mimics the gesture of a person using AI (Artificial Intelligence)-based system. There are various proposed methods and datasets for English SL (sign language); however, it is limited for Arabic sign language. Therefore, we present our collected and annotated Arabic Sign Language Letters Dataset (ArSL21L) consisting of 14202 images of 32 letter signs with various backgrounds collected from 50 people. We benchmarked our ArSL21L dataset on state-of-the-art object detection models, i.e., 4 versions of YOLOv5. Among the models, YOLOv5l achieved the best result with COCOmAP of 0.83. Moreover, we provide comparison results of classification task between ArSL2018 dataset, the only Arabic sign language letter dataset for classification task, and our dataset by running classification task on in-house short video. The results revealed that the model trained on our dataset has a superior performance over the model trained on ArSL2018. Moreover, we have created our prototype avatar which can mimic the ArSL (Arabic Sign Language) gestures for Metaverse applications. Finally, we believe, ArSL21L and the ArSL avatar will offer an opportunity to enhance the research and educational applications for not only the PwHL, but also in general real and virtual world applications. Our ArSL21L benchmark dataset is publicly available for research use on the Mendeley.\"", "source": "ieee", "author": ["Ganzorig Batnasan", "Munkhjargal Gochoo", "Munkh-Erdene Otgonbold", "Fady Alnajjar", "Timothy K. Shih"], "author_location": ["Computer Science and Software Engineering Department, United Arab Emirates University, Al Ain, United Arab Emirates", "Computer Science and Software Engineering Department, United Arab Emirates University, Al Ain, United Arab Emirates", "Computer Science and Software Engineering Department, United Arab Emirates University, Al Ain, United Arab Emirates", "Computer Science and Software Engineering Department, United Arab Emirates University, Al Ain, United Arab Emirates", "National Central University, Taoyuan City, Taiwan"], "keywords": [], "link": "https://doi.org/10.1109/EDUCON52537.2022.9766497", "country": ["AE", "AE", "AE", "AE", "TW"], "citation": 1}
---------------------------------
{"title": "Keynote Speaker: The Hitchhiker's Guide to the Metaverse.", "date": "2022", "publish": "VR Workshops", "abstract": "We envision in the future the virtual world will mix and co-exist with the physical world in such an immersive way that we cannot tell what is real and what is virtual. We will live and interact with the virtual objects that are blended into our environments with advanced holographic technology or with high-quality head mounted displays and lose the virtuality boundary. We call such a new reality Surreality. Our vision of “metaverse” is a multi-world. There are multiple virtual worlds developed by different technology companies and there is also the Surreality where real and virtual merged. While the metaverse may seem futuristic, catalysed by emerging technologies such as Extended Reality, 5G, and Artificial Intelligence, the digital “big bang” of our cyberspace is not far away. This talk aims to offer a comprehensive framework that examines the latest metaverse development under the dimensions of state-of-the-art technologies and metaverse ecosystems, illustrates the possibility of the digital “big bang”, and propose a concrete research agenda for the development of the metaverse. Reality will die; long live Surreality.", "source": "ieee", "author": ["Pan Hui 0001"], "author_location": ["Hong Kong University of Science and Technology"], "keywords": [], "link": "https://doi.org/10.1109/VRW55335.2022.00049", "country": ["HK"], "citation": 1}
---------------------------------
{"title": "Examining the Use of Non-fungible Tokens (NFTs) as a Trading Mechanism for the Metaverse.", "date": "2022", "publish": "EuroSPI", "abstract": "The notion of a metaverse seems hard to define but encourages the impression that it can be considered as a new virtual metaphysical landscape that somehow goes beyond our geographical locations and understanding (i.e., independent of time and space). Based on virtual reality, augmented reality, and blockchain, it is envisioned as an independent but extended world that is planned to be a digital virtuality entrenched not only in our old habits such as gaming and entertainment but also in virtual asset trade. In particular, trading is a pillar of the virtual economy, and auction houses will be crucial for Metaverse trading. This exploratory study examines the possibility of using an auction environment to improve the trading capabilities in a virtual universe. We investigate the cases of creating a virtual auction house with the potential of social trading of virtual assets with crypto coins and bartering. To this end, we built a virtual auction house and tested it initially using a set of scenarios. Our preliminary findings suggest that creating a virtual trading environment would be beneficial as an environment for buying and selling virtual assets and exploring their consequences.", "source": "springer", "author": ["Murat Yilmaz 0001", "Tuna Hacaloglu", "Paul M. Clarke"], "author_location": ["Department of Information Systems Engineering, Atilim University, Ankara, Turkey"], "keywords": ["Metaverse", " Auction theory", " Virtual reality", " NFT", " Trading mechanism"], "link": "https://doi.org/10.1007/978-3-031-15559-8_2", "country": ["TR"], "citation": 0}
---------------------------------
{"title": "Improving Emotional Intelligence in the New Normal Using Metaverse Applications for Digital Native.", "date": "2022", "publish": "HCI (1)", "abstract": "This research provides a study on analyzing emotional intelligence in the New Normal using Metaverse application for digital native generation. Coronavirus 2019 (COVID-19) outbreak has created new behavior and characterized human life to be more aware of the new digital applications. Significantly, research results show that the digital native generation, whose internet environment was typical from their birth, is optimistic in New Normal life amid COVID 19. In 2021, Metaverse set off a new generation of online interactive user behavior concepts. According to some research, the developing concept of Metaverse fits precisely in line with the future living of the digital native generation. However, some psychological side consequences should be revealed concurrently with the positive impact conceived. People's emotional intelligence argues for reduction due to the dissatisfaction of rapid adaptation to the New Normal condition. Thus, this research demonstrates an analysis to mitigate the psychological side effects of emotional intelligence when people are bound to the New Normal life. The improvement of the Web-based Extended Reality (WebXR), a critical development field of Metaverse, is proposed together to assist the immersive experience demands in addressing the problem-solution methods.", "source": "springer", "author": ["Sheng-Ming Wang", "Muhammad Ainul Yaqin", "Fu-Hsiang Hsu"], "author_location": ["Department of Interaction Design, National Taipei University of Technology, Taipei, Taiwan", "Doctoral Program in Design, College of Design, National Taipei University of Technology, Taipei, Taiwan", "Doctoral Program in Design, College of Design, National Taipei University of Technology, Taipei, Taiwan"], "keywords": ["Metaverse", " New normal", " Digital native generation", " Emotional intelligence", " Web-based extended reality"], "link": "https://doi.org/10.1007/978-3-031-05311-5_37", "country": ["TW", "TW", "TW"], "citation": 0}
---------------------------------
{"title": "Improving Emotional Intelligence in the New Normal Using Metaverse Applications for Digital Native.", "date": "2022", "publish": "HCI (1)", "abstract": "This research provides a study on analyzing emotional intelligence in the New Normal using Metaverse application for digital native generation. Coronavirus 2019 (COVID-19) outbreak has created new behavior and characterized human life to be more aware of the new digital applications. Significantly, research results show that the digital native generation, whose internet environment was typical from their birth, is optimistic in New Normal life amid COVID 19. In 2021, Metaverse set off a new generation of online interactive user behavior concepts. According to some research, the developing concept of Metaverse fits precisely in line with the future living of the digital native generation. However, some psychological side consequences should be revealed concurrently with the positive impact conceived. People's emotional intelligence argues for reduction due to the dissatisfaction of rapid adaptation to the New Normal condition. Thus, this research demonstrates an analysis to mitigate the psychological side effects of emotional intelligence when people are bound to the New Normal life. The improvement of the Web-based Extended Reality (WebXR), a critical development field of Metaverse, is proposed together to assist the immersive experience demands in addressing the problem-solution methods.", "source": "springer", "author": ["Sheng-Ming Wang", "Muhammad Ainul Yaqin", "Fu-Hsiang Hsu"], "author_location": ["Department of Interaction Design, National Taipei University of Technology, Taipei, Taiwan", "Doctoral Program in Design, College of Design, National Taipei University of Technology, Taipei, Taiwan", "Doctoral Program in Design, College of Design, National Taipei University of Technology, Taipei, Taiwan"], "keywords": ["Metaverse", " New normal", " Digital native generation", " Emotional intelligence", " Web-based extended reality"], "link": "https://doi.org/10.1007/978-3-031-05311-5_37", "country": ["TW", "TW", "TW"], "citation": 0}
---------------------------------
{"title": "From Online Games to \"Metaverse\": The Expanding Impact of Virtual Reality in Daily Life.", "date": "2022", "publish": "HCI (23)", "abstract": "Due to its wider and wider range of applications, virtual reality technology plays a very important role in expanding the field of human existence. From traditional video games to online games to “Metaverse”, human beings have made virtual reality more refined and comprehensive. Technical entertainment based on virtual reality has also caused social problems such as addictive dependence and escapism. “Metaverse”, or the so-called “virtual reality Internet”, as a representative of the next generation of Internet, contains both risks and opportunities.", "source": "springer", "author": ["Shengyu Jian", "Xin Chen", "Jiaping Yan"], "author_location": ["School of Fine Arts and Design, Yangzhou University, Yangzhou, People’s Republic of China", "School of Fine Arts and Design, Yangzhou University, Yangzhou, People’s Republic of China", "School of Fine Arts and Design, Yangzhou University, Yangzhou, People’s Republic of China"], "keywords": ["Virtual reality", " Online games", " Metaverse", " Internet", " Artificial intelligence"], "link": "https://doi.org/10.1007/978-3-031-05434-1_3", "country": ["CN", "CN", "CN"], "citation": 0}
---------------------------------
{"title": "Reality Avatar for Customer Conversation in the Metaverse.", "date": "2022", "publish": "HCI (5)", "abstract": "Much emphasis has been placed on the expansion of the metaverse space, which enables a large number of people to participate concurrently and conduct business or entertainment in their field of interest. A close connection between the metaverse and the real space is expected to significantly increase the availability of the two spaces; however, an effective method for this connection has not yet been presented. In this paper, we propose the XR (cross reality) Telexperience Portal as one method for connecting both remote real space and past space with the metaverse. Furthermore, when people communicate in the metaverse’s 3D space, they require avatars to represent themselves, for which a variety of avatar designs are used. However, highly realistic avatars that hold the identity of the participant are not yet used. In this paper, we propose a method for generating natural facial expressions of a high-reality avatar to become a reliable conversation partner.", "source": "springer", "author": ["Ryoto Kato", "Yusuke Kikuchi", "Vibol Yem", "Yasushi Ikei"], "author_location": ["Tokyo Metropolitan University, Hino, Japan", "Tokyo Metropolitan University, Hino, Japan", "Tokyo Metropolitan University, Hino, Japan", "The University of Tokyo, Bunkyo, Japan"], "keywords": ["Metaverse", " Portal", " Reality avatar", " Facial animation"], "link": "https://doi.org/10.1007/978-3-031-06509-5_10", "country": ["JP", "JP", "JP", "JP"], "citation": 0}
---------------------------------
{"title": "Immersive Entertainment Environments - From Theme Parks to Metaverse.", "date": "2022", "publish": "HCI (24)", "abstract": "This paper explores the interaction between the virtual world and the real world through the integration of the analysis of the metaverse and the theme park. At the same time, case studies of the application of the concept of metaverse in games and movies are conducted to explore the current manifestations of metaverse and critically explore the ethical issues it raises. The theme park here represents not only an IP, but also a broader cultural symbol. Under the development trend of metaverse, how real world theme parks should convey their cultural symbols, and in what form we can bring real world theme parks into the world of metaverse will become urgent issues to be solved. This paper will illustrate the process of a real theme park elements by transforming them into digital artworks through a design concept. This transformation not only enables virtualization of the real world, but also enables cultural dissemination to the world while virtualizing.", "source": "springer", "author": ["Xueying Niu", "Wei Feng"], "author_location": ["Beijing Normal University, Beijing, People’s Republic of China", "Shandong College of Tourism and Hospitality, Jinan, China"], "keywords": ["Metaverse", " Theme park", " NFT", " Case studies"], "link": "https://doi.org/10.1007/978-3-031-05463-1_27", "country": ["CN", "CN"], "citation": 0}
---------------------------------
{"title": "Method to Create a Metaverse Using Smartphone Data.", "date": "2022", "publish": "HCI (16)", "abstract": "With the development of internet technology, several IT companies and users have become interested in virtual worlds, called metaverses. However, one of the main problems for a metaverse is the number of resources required to develop it. To reduce the burden of high computing power and other related resources, we propose a method that uses mobile phone functions and data to generate a personal virtual space as there is still a research gap in this area. In this study, we propose a method to intuitively generate a personal virtual space using smartphone data. We propose the development of a new type of metaverse application using the photo data saved on a smartphone. We hypothesized that using the new metaverse application induces more happiness and excitement than using the smartphone gallery application to view memorable photos. To evaluate the new metaverse application, we measured the emotional responses of users and compared the two applications. The results indicate that using the new metaverse application results in higher happiness and excitement. ", "source": "springer", "author": ["Daehee Park", "Jeong Min Kim", "Jingi Jung", "Saemi Choi"], "author_location": ["Samsung Research, Seoul, Republic of Korea", "Samsung Research, Seoul, Republic of Korea", "Samsung Research, Seoul, Republic of Korea", "Samsung Research, Seoul, Republic of Korea"], "keywords": ["Metaverse", " Smartphones"], "link": "https://doi.org/10.1007/978-3-031-05939-1_4", "country": ["KR", "KR", "KR", "KR"], "citation": 0}
---------------------------------
{"title": "Exploring the Impacts of COVID-19 on Digital and Metaverse Games.", "date": "2022", "publish": "HCI (39)", "abstract": "The coronavirus (COVID-19) pandemic has markedly changed the ways we live and the ways we play games. This is because the situations disrupted by the virus have forced so many people to quarantine and self-isolate. These can lead to many serious problems such as mental and physical health. At the same time, the metaverse, particularly virtual reality and augmented reality, has been very popular in the fields of human-computer interaction and computer science in recent years. Therefore, in this paper, we propose a new research work for exploring recent digital games inspired during the virus outbreak to support people in various aspects, such as entertaining people during the pandemic period, enhancing awareness among people about the virus, suggesting preventive measures against the spread of the virus. Next, more specifically, the impacts of COVID-19 on recent games from virtual and augmented realities are examined. We investigate metaverse games to support people during COVID-19 and the post-pandemic period, including enhancing the healthcare education toolkit, simulating health protection protocols, and supporting healthcare workers.", "source": "springer", "author": ["Chutisant Kerdvibulvech"], "author_location": ["Graduate School of Communication Arts and Management Innovation, National Institute of Development Administration, Bangkok, Thailand"], "keywords": ["Digital game", " Metaverse", " Virtual reality game", " Augmented reality game", " Coronavirus", " COVID-19"], "link": "https://doi.org/10.1007/978-3-031-06391-6_69", "country": ["TH"], "citation": 1}
---------------------------------
{"title": "How Should We Suggest Colors to Creators in the Metaverse?", "date": "2022", "publish": "HCI (37)", "abstract": "Through surveying experienced users of metaverse platforms, we discovered that one of the challenges users face is to color new items used in the metaverse. Assisting users with coloring can be considerably effective because many metaverse platforms provide coloring and mapping development figures as a major means of creation. This method is widely used for creating new items and does not require users’ proficiency in 3D modeling. Accordingly, we tried to lower the barrier of creation by developing the effective color suggestion method. Most of prior color suggestion studies focused on the algorithm [1–6] but the method is also an important aspect of color suggestion. Therefore, we designed comprehensive evaluation criteria by collecting users’ feedback. We suggest “Kind of information”, “Value of information”, “Novelty”, and “Relevance” as criteria for evaluating the color suggestion method. In the following experiment, participants colored a virtual item using two different color suggestion methods that had previously been utilized in previous experiments and without color suggestion. After the task, participants compared three different methods using Analytic Hierarchy Process (AHP) pair-wise comparison with criteria we designed. As a result of the experiment, users preferred to be offered colors that matches the product rather than to be offered only set of colors and preferred to be offered only set of colors rather than not being offered any colors.", "source": "springer", "author": ["Junghun Lee", "Junho Yang", "Chunghun Ha"], "author_location": ["Department of Industrial Design, Hongik University, Seoul, Republic of Korea", "Department of Industrial Design, Hongik University, Seoul, Republic of Korea", "Department of Industrial Data Engineering, Hongik University, Seoul, Republic of Korea"], "keywords": ["Color suggestion", " Design assistant", " Metaverse", " User interface"], "link": "https://doi.org/10.1007/978-3-031-06417-3_29", "country": ["KR", "KR", "KR"], "citation": 0}
---------------------------------
{"title": "On the Possibilities of Light Environment Art in Digital Scenes: From the Perspective of Metaverse Research.", "date": "2022", "publish": "HCI (11)", "abstract": "This paper mainly explores the possibility of light environment art in digital scenes from the perspective of Metaverse research. Firstly, the concept of Metaverse is summarized and condensed on the basis of existing research results. The digital scene in the Metaverse is a digital society with a high degree of integration between virtual and reality. Continuous presence and a highly immersive experience. The light environment art, as the art of painting with light as the language, plays an irreplaceable role in both the real world and the digital scene. The light environment art stated in this article mainly refers to the virtual light environment art that plays a role in the digital scene. From the perspective of Metaverse research, this paper summarizes the three major characteristics of light environment art: hypermedia information transmission, surreal space construction of light images, and nonlinear light language and painting narrative mode; and further analyzes the light environment in the Metaverse space. The application of art includes: the symbol designation of the light environment in the virtual architecture, the visual presentation of the light environment in the virtual architecture, and the shaping of the light environment space in the virtual architecture.", "source": "springer", "author": ["Zihan Cui", "Kaizhong Cao", "Hantian Xu"], "author_location": ["Communication University of China, Beijing, China", "Communication University of China, Beijing, China", "Communication University of China, Beijing, China"], "keywords": ["Light environment art", " Metaverse", " Digital scenes", " Possibilities"], "link": "https://doi.org/10.1007/978-3-031-06047-2_14", "country": ["CN", "CN", "CN"], "citation": 1}
---------------------------------
{"title": "Video Game Technologies and Virtual Design: A Study of Virtual Design Teams in a Metaverse.", "date": "2007", "publish": "HCI (14)", "abstract": "Massively Multiplayer Online Games (MMOGs) are no longer just games. “Metaverses,” a variant of these games, which include Second Life and Active Worlds, represent some of the most immersive, interactive possibilities for learning, simulation, and digital design in use today. They also increasingly blur distinctions between work and play, as well as user and designer, prompting questions about the nature and practice of virtual design, that is, design that is practiced inside virtual reality by and on 3D avatars. This paper describes results from a qualitative study of collaborative design practices within Second Life, a popular metaverse and design environment. We analyze design processes, including the artifacts that avatar-designer create and use in the design activities.", "source": "springer", "author": ["Shaowen Bardzell", "Kalpana Shankar"], "author_location": ["School of HPER, Indiana University, 1025 E 7th Street, Rm 394, Bloomington, IN 47405, USA", "School of Informatics, Indiana University, 1900 E 10th Street, Rm 1032, Bloomington, IN 47406, USA"], "keywords": ["metaverse", " virtual design teams", " collaboration", " artifacts", " designers", " boundary objects"], "link": "https://doi.org/10.1007/978-3-540-73335-5_65", "country": ["US", "US"], "citation": 7}
---------------------------------
{"title": "SimuMan: A Simultaneous Real-Time Method for Representing Motions and Emotions of Virtual Human in Metaverse.", "date": "2021", "publish": "ICIOT", "abstract": "Metaverse is the next generation gaming Internet, and virtual humans play an important role in Metaverse. The simultaneous representation of motions and emotions of virtual humans attracts more attention in academics and industry, which significantly improves user experience with the vivid continuous simulation of virtual humans. Different from existing work which only focuses on either the expression of facial expressions or body motions, this paper presents a novel and real-time virtual human prototyping system, which enables a simultaneous real-time expression of motions and emotions of virtual humans (short for SimuMan). SimuMan not only enables users to generate personalized virtual humans in the metaverse world, but also enables them to naturally and simultaneously present six facial expressions and ten limb motions, and continuously generate various facial expressions by setting parameters. We evaluate SimuMan objectively and subjectively to demonstrate its fidelity, naturalness, and real-time. The experimental results show that the SimuMan system is characterized by low latency, good interactivity, easy operation, good robustness, and wide application.", "source": "springer", "author": ["Mingmin Zhang", "Yuan Wang", "Jiehan Zhou", "Zhigeng Pan"], "author_location": ["Zhejiang University, Hangzhou, China", "Hangzhou Normal University, Hangzhou, China", "University of Oulu, Oulu, Finland", "Hangzhou Normal University, Hangzhou, China"], "keywords": ["Metaverse", " Virtual human", " Facial expression", " Motion generation and synthesis", " Motion synchronization"], "link": "https://doi.org/10.1007/978-3-030-96068-1_6", "country": ["CN", "CN", "FI", "CN"], "citation": 0}
---------------------------------
{"title": "MRA: Metaverse Reference Architecture.", "date": "2021", "publish": "ICIOT", "abstract": "On the basis of introducing the metaverse and the digital economy and supporting the development trend of new technologies, the concept of service-to-service (S2S) ecosystem is defined. The metaverse is used to build a virtual digital world and link the physical world. This paper focuses on the connotation of the two words Meta and Verse of the metaverse, and proposes a management framework of metaverse resources (Non-fungible token, 3D space, experience, avatar, etc.) in scenarios that support interactions such as the management of work, life, transaction, and customers. Then the paper proposes a metaverse reference architecture (MRA) for systematically constructing metaverse solutions. Finally, this paper also looks forward to the future development trend of the metaverse.", "source": "springer", "author": ["Liang-Jie Zhang"], "author_location": ["Kingdee Research, Kingdee International Software Group Co. Ltd., Shenzhen, China"], "keywords": ["Metaverse", " Service-to-service (S2S)", " Physical world", " Virtual world", " Resource management", " Metaverse reference architecture (MRA)", " Digital economy", " Non-fungible token (NFT)"], "link": "https://doi.org/10.1007/978-3-030-96068-1_8", "country": ["CN"], "citation": 5}
---------------------------------
{"title": "Metaverse Services: Extensible Learning with Mediated Teleporting into 3D Environments.", "date": "2009", "publish": "UNISCON", "abstract": "Metaverse-enabled Learning Spaces (MeLS) offer significant improvements over traditional modes of teaching allowing for experiential learning. On the other hand, there is large number of capabilities the immersive 3D word of Metaverse-enabled spaces has to offer to traditional web-based tools for learning. Unfortunately, those capabilities are not being leveraged. We build upon a number of open source learning packages and offer an architecture for Metaverse services extending learning capabilities by offering 3D environments as services inside and in combination with more traditional web-based systems. The goal is to allow educators and students to easily move from traditional web-based systems into MeLS experiencing environments, which are not available in a traditional LMS software package, but can be offered or enhanced by the Metaverse presentation layer. This is made possible by our method for performing mediated teleporting into the MeLS.", "source": "springer", "author": ["Ioakim Marmaridis", "Sharon Griffith"], "author_location": ["University of Western Sydney, Sydney, Australia", "University of Western Sydney, Sydney, Australia"], "keywords": ["Virtual World", " Learn Management System", " Second Life", " Service Broker", " Learn Space"], "link": "https://doi.org/10.1007/978-3-642-01112-2_24", "country": ["AU", "AU"], "citation": 3}
---------------------------------
{"title": "Demystifying Metaverse as a New Paradigm of Enterprise Digitization.", "date": "2021", "publish": "BigData Congress", "abstract": "As Facebook takes on metaverse as its new business infrastructure and company image, this new development blows a swirling wind through the IT industry. However, metaverse as a new enterprise paradigm is still quite unfamiliar to many technical people, letting along most business managers. In this paper, we give an overview of metaverse as a potential business platform and propose a framework for enterprise digitization. In particular, we clarify several critical concepts such as blockchainization, gamification, tokenization, and virtualization in relation to four Ps of marketing mix: People, Place, Product, and Process; although as many as ten Ps have been proposed, four of them are sufficient for our purposes.", "source": "springer", "author": ["Yiyang Bian", "Jiewu Leng", "J. Leon Zhao"], "author_location": ["City University of Hong Kong Shenzhen Research Institute, Shenzhen, China", "School of Business and Management, Chinese University of Hong Kong (Shenzhen), Shenzhen, China"], "keywords": ["Metaverse", " Enterprise digitization", " Marketing mix", " 4Ps"], "link": "https://doi.org/10.1007/978-3-030-96282-1_8", "country": ["HK", "CN"], "citation": 3}
---------------------------------
{"title": "Evaluation of Metaverse Server in a Widely-Distributed Environment.", "date": "2010", "publish": "OTM Workshops", "abstract": "”Metaverse” is a new service that connects users to three dimensional virtual space constructed as electronic data through the Internet, which is expected to be popular in the future. Although Metaverse is expected as a promising platform for information exchange and communication among Internet users, it has several shortcomings such as a requirement of relatively high-performance client terminals and its long response time in some cases. We have analyzed the problem of the response time from a viewpoint of load of the server in order to construct an efficient and high-performance server. OpenSim server that provides the metaverse service as open source software has been constructed and evaluated. In this paper, we have made OpenSim server in grid mode to analyze distributed Metaverse service. We have evaluated Metaverse server performance during the phase of user login to Metaverse service and teleport from one region to another. That is to say, we have focused on a server side of Metaverse system, analyzed its behavior, and clarified the cause of its long response time.", "source": "springer", "author": ["Mayu Matsubara", "Masato Oguchi"], "author_location": ["Ochanomizu University, Tokyo, Japan", "Ochanomizu University, Tokyo, Japan"], "keywords": ["Virtual World", " Open Source Software", " Server Side", " Server Module", " Server Machine"], "link": "https://doi.org/10.1007/978-3-642-16961-8_49", "country": ["JP", "JP"], "citation": 6}
---------------------------------
{"title": "Fed-MT-ISAC: Federated Multi-task Inverse Soft Actor-Critic for Human-Like NPCs in the Metaverse Games.", "date": "2022", "publish": "ICIC (3)", "abstract": "Imitation Learning (IL) is a powerful approach for constructing human-like NPCs in games. Unlike general games, metaverse games tend to build up the more complex, and more diverse game characters. Data between distinct roles is not interoperable, which leads to the challenge of sparse samples. We consider transferring the information from different tasks to solve the problem of sparse samples. Unfortunately, this approach also faces two thorny issues of privacy protection and knowledge transfer across tasks. To solve a series of problems, we propose a practical approach termed Federated Multi-Task Inverse Soft Actor-Critic (Fed-MT-ISAC), which extends the Inverse Soft Actor-Critic (ISAC) to federated and multi-task cases. We compare the performance of all algorithms in multi-style tasks and multi-skill tasks. Empirical results show that the proposed algorithm successfully achieves performance improvement in all experimental settings.", "source": "springer", "author": ["Fangze Lin", "Wei Ning", "Zhengrong Zou"], "author_location": ["Guangdong University of Technology, Guangzhou, China", "Guangdong University of Technology, Guangzhou, China", "Zhaoqing University, Zhaoqing, China"], "keywords": ["Imitation learning", " Human-like non-player characters", " Reinforcement learning"], "link": "https://doi.org/10.1007/978-3-031-13832-4_41", "country": ["CN", "CN", "CN"], "citation": 0}
---------------------------------
{"title": "Multilingual Discussion in Metaverse among Students from the USA, Korea and Japan.", "date": "2010", "publish": "KES (4)", "abstract": "E-learning continues to be used as an educational tool all over the world. However, the typical e-learning systems are sometimes not enough for students to feel a close connection with others. Now engineering education needs to be carried out from a global viewpoint, since there are lots of opportunities for international collaboration in higher education organizations. In this study, we investigated multilingual discussion in Metaverse and its possibility to enhance the skills for international discussion and international characteristics. Students from Edwards-Knox high school in the USA, graduate students from Yonsei University, Korea, and Nagaoka University of Technology (NUT), Japan, participated in this discussion held on the virtual island (owned by NUT) of Second Life. A language grid system was incorporated into the Metaverse system. This made it possible for the discussion to be carried out with and without the translation system. These sessions were carried out and compared with each other. Also the effectiveness of the international discussion project in Metaverse (with the language grid system) was discussed.", "source": "springer", "author": ["Hideyuki Kanematsu", "Yoshimi Fukumura", "Dana M. Barry", "So Young Sohn", "Ryosuke Taguchi"], "author_location": ["Dept. MS & E., Suzuka National College of Technology, Suzuka, Japan", "Dept. Management & Information Systems Science, Nagaoka University of Technology, Nagaoka, Japan", "CAMP, Clarkson University, Potsdam, USA", "Dept. Information & Industrial Engineering, Yonsei University, Seoul, Korea", "Graduate Student, Nagaoka University of Technology, Nagaoka, Japan"], "keywords": [""], "link": "https://doi.org/10.1007/978-3-642-15384-6_22", "country": ["JP", "JP", "DE", "KR", "JP"], "citation": 19}
---------------------------------
{"title": "Multilingual Problem Based Learning in Metaverse.", "date": "2011", "publish": "KES (3)", "abstract": "The authors have established an e-learning system by utilizing Second life and language grid system where virtual and multilingual discussions would be possible. To investigate the possibility of PBL in virtual engineering class, the virtual infrastructure was used for PBL in materials science and engineering. In this study, a learning environment for both the lecture and PBL discussion in a virtual space was built and the effectiveness and possibility for the application of e-learning was evaluated from the viewpoint of engineering education. The questionnaire and the sentence analyses indicate that the language grid system brought the class more beneficial effects and suggest that the system could be used effectively for the virtual problem based learning in Metaverse.", "source": "springer", "author": ["Sahar Farjami", "Ryosuke Taguchi", "Katsuko T. Nakahira", "Rodrigo Nunez Rattia", "Yoshimi Fukumura", "Hideyuki Kanematsu"], "author_location": ["Department of Engineering Sciences for Electronics and Materials, Faculty of Engineering Science, Kyushu University, Japan", "Nagaoka University of Technology, Nagaoka, Japan", "Dept. Management & Information Systems Science, Nagaoka University of Technology, Nagaoka, Japan", "Nagaoka University of Technology, Nagaoka, Japan", "Dept. Management & Information Systems Science, Nagaoka University of Technology, Nagaoka, Japan", "Dept. MS & E, Suzuka National College of Technology, Suzuka, Japan"], "keywords": ["Multilingual PBL", " e-learning", " Metaverse", " Language grid", " Second Life"], "link": "https://doi.org/10.1007/978-3-642-23854-3_53", "country": ["JP", "JP", "JP", "JP", "JP", "JP"], "citation": 10}
---------------------------------
{"title": "Regulating the Metaverse, a Blueprint for the Future.", "date": "2022", "publish": "XR (1)", "abstract": "The core Immersive Media (IM) technologies of Virtual Reality (VR) and Augmented Reality (AR) have steadily advanced over the last thirty years, enabling high fidelity experiences at consumer prices. Over the same period, networking speeds have increased dramatically, culminating in the deployment of 5G networks. Combined, these advancements greatly increase the prospects for widespread adoption of virtual and augmented worlds. Recently branded “the metaverse” by Meta and other large platforms, major corporations are currently investing billions to deploy immersive worlds that target mainstream activities from socializing and shopping to education and business. With the prospect that corporate-controlled metaverse environments proliferate society over the next decade, it is important to consider the risks to consumers and plan for meaningful regulation. This is especially true in light of the unexpected negative impact that social media platforms have had on society in recent years. The dangers of the metaverse are outlined herein along with proposals for sensible regulation.", "source": "springer", "author": ["Louis B. Rosenberg"], "author_location": ["Unanimous AI, San Francisco, USA"], "keywords": ["Metaverse", " Augmented reality", " Virtual reality", " Extended reality", " Mixed reality", " XR", " VR", " AR", " MR", " Technology policy", " Regulation"], "link": "https://doi.org/10.1007/978-3-031-15546-8_23", "country": ["US"], "citation": 1}
---------------------------------
{"title": "The Open Metaverse Currency (OMC) - A Micropayment Framework for Open 3D Virtual Worlds.", "date": "2010", "publish": "EC-Web", "abstract": "Virtual worlds have become very popular recently, in particular 3D virtual worlds with a built-in virtual currency that enables providers and users to monetize their creations. Virtual Worlds based on the relatively new open-source and free-to-install “OpenSimulator” software currently lack such a virtual currency framework, in particular one that can be used across the boundaries of such virtual worlds (also known as grids). In this paper we present the design of such a micropayment system for this class of virtual worlds. The functionality expected by the users of such a 3D environment is somewhat different from what is usually expected from Web payment systems. A particular challenge is the fact that parts of the software that our system is to be integrated with cannot be trusted, as they are run by unknown parties, and can easily be modified (as it is open-source software). Transaction values in such a virtual environment are usually very small, so the cost of a transaction is also of concern. The system has already been implemented and is used by a number of such virtual worlds.", "source": "springer", "author": ["Frank Kappe", "Michael Steurer"], "author_location": ["Institute for Information Systems and Computer Media, Graz University of Technology, Austria", "Institute for Information Systems and Computer Media, Graz University of Technology, Austria"], "keywords": ["3D Virtual Worlds", " Micropayment", " Virtual Currency", " OpenSimulator", " Hypergrid", " Open Metaverse"], "link": "https://doi.org/10.1007/978-3-642-15208-5_9", "country": ["AT", "AT"], "citation": 4}
---------------------------------
{"title": "Collection and Analysis of Multimodal Interaction in Direction-Giving Dialogues: Towards an Automatic Gesture Selection Mechanism for Metaverse Avatars.", "date": "2011", "publish": "AEGS", "abstract": "With the aim of building a spatial gesture generation mechanism in Metaverse avatars, we report on an empirical study for multimodal direction-giving dialogues and propose a prototype system for gesture generation. First, we conducted an experiment in which a direction receiver asked for directions to some place on a university campus, and the direction giver gave directions. Then, using a machine learning technique, we annotated the direction giver’s right-hand gestures automatically and analyzed the distribution of the direction of the gestures. As a result, we proposed four types of proxemics and found that the distribution of gesture directions differs with the type of proxemics between the conversational participants. Finally, we implement a gesture generation mechanism into a Metaverse application and demonstrate an example.", "source": "springer", "author": ["Takeo Tsukamoto", "Yumi Muroya", "Masashi Okamoto", "Yukiko I. Nakano"], "author_location": ["Graduate School of Science and Technology, Seikei University, Tokyo, Japan", "Faculty of Science and Technology, Seikei University, Tokyo, Japan", "Faculty of Science and Technology, Seikei University, Tokyo, Japan", "Faculty of Science and Technology, Seikei University, Tokyo, Japan"], "keywords": ["Gesture", " Direction giving", " Proxemics", " Empirical study", " Metaverse"], "link": "https://doi.org/10.1007/978-3-642-32326-3_6", "country": ["JP", "JP", "JP", "JP"], "citation": 0}
---------------------------------
{"title": "The Growing Need for Metaverse Regulation.", "date": "2022", "publish": "IntelliSys (3)", "abstract": "The immersive technologies of virtual reality (VR) and augmented reality (AR) are reaching maturity levels that will soon enable widespread deployment in consumer markets. At the same time, major corporations have begun investing billions of dollars annually on immersive technologies and platforms. Combined, these conditions greatly increase prospects for broad adoption of virtual and augmented environments by large populations. Recently branded “the metaverse” by Meta and other platform providers, many major corporations have expressed plans for deploying consumer products within the next three to five years. With the prospect that the metaverse platforms gain broad adoption over the next decade, it’s important to consider the risks and plan for meaningful regulation as necessary. ", "source": "springer", "author": ["Louis B. Rosenberg"], "author_location": ["Chief Scientist, San Francisco, USA"], "keywords": ["Metaverse", " Augmented reality", " Virtual reality", " Mixed reality", " Extended reality", " Social media", " Regulation"], "link": "https://doi.org/10.1007/978-3-031-16075-2_39", "country": ["US"], "citation": 0}
---------------------------------
{"title": "Use of Metaverse in Education.", "date": "2022", "publish": "ICCSA (Workshops 1)", "abstract": "With the introduction of Metaverse, its use is increasing day by day. In this study, the factors affecting the historical development of Metaverse, the Metaverse architecture and the use of Metaverse in the field of education are discussed. The strengths and weaknesses of the use of Metaverse in the field of education are emphasized; the opportunities it will offer and the problems and threats that may be encountered are examined. Since Metaverse is a new concept, a resource for the use of Metaverse in the field of education has been tried to put forward by using the limited number of sources currently available in the literature. In this study, it is emphasized that the Metaverse environment can add a new dimension to the field of educational technologies. However, it should be taken into account that the necessary technologies and architectures in this field are not mature enough yet. Therefore, it is considered a necessity to determine appropriate strategies for the use of Metaverse in the educational field and to start determining its widespread effect until the infrastructure of Metaverse matures.", "source": "springer", "author": ["Mustafa Murat Inceoglu", "Birol Ciloglugil"], "author_location": ["Department of Computer Education and Instructional Technology, Ege University, Izmir, Turkey", "Department of Computer Engineering, Ege University, Izmir, Turkey"], "keywords": ["e-learning", " Educational technology", " Metaverse", " Metaverse in education"], "link": "https://doi.org/10.1007/978-3-031-10536-4_12", "country": ["TR", "TR"], "citation": 73}
---------------------------------
{"title": "Nuclear Energy Safety Project in Metaverse.", "date": "2012", "publish": "IIMSS", "abstract": "This project for learning nuclear energy safety was carried out through e-learning. Problem Based Learning (PBL) was selected as the educational tool and Metaverse as the class environment. The virtual classroom was built on a virtual island of Second Life owned by Nagaoka University of Technology. Three students from two National Technical Colleges in Japan joined the project. A teacher gave the students a short lecture and proposed the problem. Students understood the contents very well and solved the problem through chat-based discussions in Metaverse. Students’ clear and precise understanding, their high activeness of discussion and high interest for the safety of nuclear energy was apparent throughout this successful PBL class project. The results indicate very clearly that this kind of PBL class was obviously possible for actual e-learning in nuclear engineering and engineering education.", "source": "springer", "author": ["Hideyuki Kanematsu", "Toshiro Kobayashi", "Nobuyuki Ogawa", "Yoshimi Fukumura", "Dana M. Barry", "Hirotomo Nagai"], "author_location": ["Department of Materials Science and Engineering, Suzuka National College of Technology, Suzuka, Japan", "Department of Electronics & Control Engineering, Tsuyama National College of Technology, Tsuyama, Japan", "Department of Architecture, Gifu National College of Technology, Gifu, Japan", "Department of Management and Information Systems Science, Nagaoka University of Technology, Nagaoka, Japan", "Center for Advanced Materials Processing (CAMP), Clarkson University, Potsdam, US", "Water Cell Inc., Noda, Japan"], "keywords": [""], "link": "https://doi.org/10.1007/978-3-642-29934-6_39", "country": ["JP", "JP", "JP", "JP", "DE", "JP"], "citation": 17}
---------------------------------
{"title": "Metaverse beyond the hype: Multidisciplinary perspectives on emerging challenges, opportunities, and agenda for research, practice and policy.", "date": "2022", "publish": "Int. J. Inf. Manag.", "abstract": "", "link": "https://www.sciencedirect.com/science/article/pii/S0268401222000767", "source": "elsevier", "author": ["Yogesh K. Dwivedi", "D. Laurie Hughes", "Abdullah M. Baabdullah", "Samuel Ribeiro-Navarrete", "Mihalis Giannakis", "Mutaz M. Al-Debei", "Denis Dennehy", "Bhimaraya A. Metri", "Dimitrios Buhalis", "Christy M. K. Cheung", "Kieran Conboy", "Ronan Doyle", "Rameshwar Dubey", "Vincent Dutot", "Reto Felix", "D. P. Goyal", "Anders Gustafsson", "Chris Hinsch", "Ikram Jebabli", "Marijn Janssen 0001", "Young-Gab Kim", "Jooyoung Kim", "Stefan Koos", "David Kreps", "Nir Kshetri", "Vikram Kumar", "Keng-Boon Ooi", "Savvas Papagiannidis", "Ilias O. Pappas", "Ariana Polyviou", "Sang-Min Park", "Neeraj Pandey", "Maciel Manoel Queiroz", "Ramakrishnan Raman 0001", "Philipp A. Rauschnabel", "Anuragini Shirish", "Marianna Sigala", "Konstantina Spanaki", "Garry Wei-Han Tan", "Manoj Kumar Tiwari", "Giampaolo Viglia", "Samuel Fosso Wamba"], "author_location": ["Emerging Markets Research Centre (EMaRC), School of Management, Swansea University, Bay Campus, Fabian Bay, Swansea SA1 8EN, Wales, UK", "Department of Management, Symbiosis Institute of Business Management, Pune & Symbiosis International (Deemed University), Pune, Maharashtra, India", "Department of Management Information Systems, Faculty of Economics and Administration, King Abdulaziz University, Jeddah, Kingdom of Saudi Arabia", "ESIC Business & Marketing School, Spain", "Audencia Nantes Business School, 8 Route de La Jonelière, B.P. 31222, 44312 Cedex 3 Nantes, France", "Dean of Business School, Department of Business Analytics, Business School, Al-Ahliyya Amman University, Jordan", "Department of Management Information Systems, Business School, The University of Jordan, Jordan", "School of Management, Swansea University, Bay Campus, Fabian Bay, Swansea SA1 8EN, Wales, UK", "Director, Indian Institute of Management Nagpur, India", "Bournemouth University Business School UK and Visiting Professor, School of Hotel and Tourism Management, The Hong Kong Polytechnic University, China", "Department of Finance and Decision Sciences, Hong Kong Baptist University, Hong Kong Special Administrative Region of China", "School of Business & Economics & the Lero Software Research Centre, NUI Galway, Ireland", "Lero – The Irish Software Research Centre & National University of Ireland, Galway, Ireland", "Montpellier Business School, Montpellier Research in Management, Montpellier, France", "Liverpool Business School, Liverpool John Moores University, UK", "IPAG Business School, Department: Strategy & Management's, 184 boulevard st Germain, 75006 Paris, France", "Robert C. Vackar College of Business & Entrepreneurship, University of Texas Rio Grande Valley, 1201 W University Dr, Edinburg, TX 78539, USA", "Indian Institute of Management Shillong, Shillong, India", "Department of Marketing, BI – Norwegian Business School, Oslo, Norway", "Seidman College of Business, Grand Valley State University, 1 Campus Dr, Allendale, USA", "Université Internationale de Rabat, Rabat Business School, BEAR Lab, Morocco", "Faculty of Technology, Policy and Management, Delft University of Technology, the Netherlands", "Department of Computer and Information Security, and Convergence Engineering for Intelligent Drone, Sejong University, Seoul 05006, Republic of Korea", "Department of Advertising & Public Relations, Grady College of Journalism and Mass Communication, Institute for Artificial Intelligence, University of Georgia, USA", "Universität der Bundeswehr München, Munich, Germany", "Philosopher of Information Systems, J.E. Cairnes School of Business & Economics, NUI Galway, Ireland", "Bryan School of Business and Economics, The University of North Carolina at Greensboro, Bryan Building, Room: 368, P. O. Box 26165, Greensboro, NC 27402-6165, USA", "SRV Media Private Ltd, India", "UCSI Graduate Business School, UCSI University, No. 1 Jalan Menara Gading, UCSI Heights, 56000 Cheras, Wilayah Persekutuan, Kuala Lumpur, Malaysia", "College of Management, Chang Jung Christian University, 711, Guiren District, Tainan, Taiwan", "School of Finance and Economics, Nanchang Institute of Technology, 901 Ying Xiong Avenue, Chang Bei Economic Development Zone, Nan Chang, Jiang Xi 330034, People’s Republic of China", "Newcastle University Business School, 5 Barrack Road, Newcastle upon Tyne NE1 4SE, United Kingdom", "Department of Information Systems, University of Agder, Norway", "Department of Computer Science, Norwegian University of Science and Technology, Norway", "Department of Management, School of Business, University of Nicosia, Cyprus", "Department of Computer Science and Engineering Korea University, Seoul 02841, Republic of Korea", "National Institute of Industrial Engineering (NITIE), Mumbai, India", "FGV EAESP, São Paulo, Brazil", "Symbiosis Institute of Business Management, Pune & Symbiosis International (Deemed University), Pune, India", "Digital Marketing and Media Innovation, College of Business, Universität der Bundeswehr München, Werner-Heisenberg-Weg, 39 85577 Neubiberg, Germany", "Université Paris-Saclay, Univ Evry, IMT-BS, LITEM, 91025 Evry-Courcouronnes, France", "Professor, Department of Business Administration, University of Piraeus, Greece", "Adjunct Professor, Faculty of Business and Law, Curtin University, Australia", "Audencia Business School, Nantes, France", "UCSI Graduate Business School, UCSI University, No. 1 Jalan Menara Gading, UCSI Heights, 56000 Cheras, Wilayah Persekutuan, Kuala Lumpur, Malaysia", "School of Finance and Economics, Nanchang Institute of Technology, 901 Ying Xiong Avenue, Chang Bei Economic Development Zone, Nan Chang, Jiang Xi 330034, People’s Republic of China", "Director, National Institute of Industrial Engineering (NITIE), Mumbai, India", "Department of Industrial and Systems Engineering, Indian Institute of Technology Kharagpur, India", "University of Portsmouth, Department of Marketing, Portland Street, PO13DE, United Kingdom", "Department of Economics and Political Science, University of Aosta Valley, Aosta, Italy", "TBS Business School Information, Operations and Management Sciences, 1 Place Alphonse Jourdain, 31068 Toulouse, France"], "keywords": ["Avatars", "Augmented reality", "Extended reality", "Metaverse", "Second life", "Virtual reality", "Virtual world"], "country": ["US", "IN", "SA", "ES", "FR", "JO", "JO", "US", "IN", "CN", "HK", "IE", "IE", "FR", "GB", "FR", "US", "IN", "NO", "US", "MA", "NL", "KR", "GE", "DE", "IE", "US", "IN", "MY", "TW", "CN", "GB", "NO", "NO", "CY", "US", "IN", "BR", "IN", "DE", "FR", "GR", "AU", "FR", "MY", "CN", "IN", "IN", "US", "IT", "FR"], "citation": 11}
---------------------------------
{"title": "Metaverse: Perspectives from graphics, interactions and visualization.", "date": "2022", "publish": "Vis. Informatics", "abstract": "The metaverse is a visual world that blends the physical world and digital world. At present, the development of the metaverse is still in the early stage, and there lacks a framework for the visual construction and exploration of the metaverse. In this paper, we propose a framework that summarizes how graphics, interaction, and visualization techniques support the visual construction of the metaverse and user-centric exploration. We introduce three kinds of visual elements that compose the metaverse and the two graphical construction methods in a pipeline. We propose a taxonomy of interaction technologies based on interaction tasks, user actions, feedback and various sensory channels, and a taxonomy of visualization techniques that assist user awareness. Current potential applications and future opportunities are discussed in the context of visual construction and exploration of the metaverse. We hope this paper can provide a stepping stone for further research in the area of graphics, interaction and visualization in the metaverse.", "link": "https://www.sciencedirect.com/science/article/pii/S2468502X22000158", "source": "elsevier", "author": ["Yuheng Zhao", "Jinjing Jiang", "Yi Chen 0007", "Richen Liu", "Yalong Yang 0001", "Xiangyang Xue", "Siming Chen 0001"], "author_location": ["School of Data Science, Fudan University, China", "Beijing Key Laboratory of Big Data Technology for Food Safety, Beijing Technology and Business University, China", "School of Computer and Electronic Information, Nanjing Normal University, China", "Department of Computer Science, Virginia Tech, USA"], "keywords": ["Metaverse", "Virtual reality/Augmented reality", "Computer graphics", "User interaction", "Immersive visualization"], "country": ["CN", "CN", "CN", "US"], "citation": 0}
---------------------------------
{"title": "Physical Intelligence in the Metaverse: Mixed Reality Scale Models for Twistronics and Atomic Force Microscopy.", "date": "2022", "publish": "AIM", "abstract": "Physical intelligence (PI) is an emerging research field using new multi-functional smart materials in mechatronic designs. On the microscopic scale, PI principles give rise to unconventional transducers, which are especially useful for micro/nano-robot design with size and resource constrains. Since it is not easy to directly observe nanoscale multi-physics phenomenon, understanding their principles can be challenging. In this work, we bring PI principles into the metaverse to bridge this gap by developing two mixed reality scale models. The first example is a virtual reality (VR) 2D material twistronics visualizer to demonstrate the novel intelligent 2D materials with tunable properties as a rising field in condensed matter physics. Users can interactively control the cross-coupling multi-physics phenomena and observe the visualized material responses. The second example is centered around an Atomic Force Microscope (AFM) to illustrate its imaging and probe principles. For interaction, users can control the twist angle using atomic lattice models and feel the AFM cantilever force using custom haptic devices. We believe these tools can help precision mechatronic engineers understand and make better use of physical intelligence building blocks to design micro-electromechanical systems.", "source": "ieee", "author": ["Fangzhou Xia 0001", "Morgan P. Mayborne", "Qiong Ma", "Kamal Youcef-Toumi"], "author_location": ["Massachusetts Institute of Technology Mechatronics Research Laboratory, Cambridge, MA, USA", "Massachusetts Institute of Technology Mechatronics Research Laboratory, Cambridge, MA, USA", "Boston College QMLab, Chestnut Hill, MA, USA", "Massachusetts Institute of Technology Mechatronics Research Laboratory, Cambridge, MA, USA"], "keywords": [], "link": "https://doi.org/10.1109/AIM52237.2022.9863383", "country": ["US", "US", "US", "US"], "citation": 0}
---------------------------------
{"title": "Investigation and Research on the Negotiation Space of Mental and Mental Illness Based on Metaverse.", "date": "2021", "publish": "ICTC", "abstract": "Combining the current era background of the rapid development of related industries in metaverse and the social environment brought about by the COVID-19. As a result, there are more and more cases of receiving treatment for mental illness in the metaverse space. Therefore, in the current actual situation, the main body of this article is to use a game engine to build a high-realistic virtual diagnosis and treatment stage based on the metaverse. This project has two components: This project has two components: 1. Design a metaverse space scene. Designed to improve the discomfort of elderly users in the metaverse environment. 2. The PBR (Physically Based Rendering) rendering material processing method in the metaverse stage. This article aims to establish a digital diagnosis and treatment space based on the metaverse, which can help patients reduce the unfamiliarity of online diagnosis and treatment, provide a more active psychotherapy atmosphere, and reduce the discomfort of patients during the treatment process. Furthermore, based on metaverse, this article aims to build a more intelligent, realistic, and visualized digital therapy stage and the highly realistic performance of the digital therapy treatment content in the future under visualization.", "source": "ieee", "author": ["Yiqian Han", "Seokhee Oh"], "author_location": ["Dept. of Computer Engineering, Gachon University, Seongnam-si, Korea", "Dept. of Computer Engineering, Gachon University, Seongnam-si, Korea"], "keywords": [], "link": "https://doi.org/10.1109/ICTC52510.2021.9621118", "country": ["KR", "KR"], "citation": 9}
---------------------------------
{"title": "Unsupervised Conversion of 3D Models for Interactive Metaverses.", "date": "2012", "publish": "ICME", "abstract": "A virtual-world environment becomes a truly engaging platform when users have the ability to insert 3D content into the world. However, arbitrary 3D content is often not optimized for real-time rendering, limiting the ability of clients to display large scenes consisting of hundreds or thousands of objects. We present the design and implementation of an automatic, unsupervised conversion process that transforms 3D content into a format suitable for real-time rendering while minimizing loss of quality. The resulting progressive format includes a base mesh, allowing clients to quickly display the model, and a progressive portion for streaming additional detail as desired. Sirikata, an open virtual world platform, has processed over 700 models using this method.", "source": "ieee", "author": ["Jeff Terrace", "Ewen Cheslack-Postava", "Philip Alexander Levis", "Michael J. Freedman"], "author_location": ["Princeton University, USA", "University of Stanford, USA", "University of Stanford, USA", "Princeton University, USA"], "keywords": [], "link": "https://doi.org/10.1109/ICME.2012.186", "country": ["US", "US", "US", "US"], "citation": 11}
---------------------------------
{"title": "Retail spatial evolution: paving the way from traditional to metaverse retailing.", "date": "2009", "publish": "Electron. Commer. Res.", "abstract": "This paper examines the evolution of retailing, i.e. from traditional to electronic to metaverse retailing and sheds light on the ways metaverses influence that evolution. The spatial dimension is taken into consideration as retailers could operate simultaneously in three different, but intertwined spaces. Particular emphasis is paid to key promotional aspects and we highlight the key challenges and opportunities faced by traditional retailers, e-retailers and metaverse retailers. For the metaverse phenomenon, the authors analyse Second Life and a range of findings emerge. One key finding is that retailers need to employ a holistic and overarching approach when devising their promotional strategies, especially if they aim to operate at the metaverse stage as well. At the end, the authors recommend a range of future research avenues and note the immediate need for policy development dealing with the metaverse phenomenon.", "source": "springer", "author": ["Michael Bourlakis", "Savvas Papagiannidis", "Feng Li 0021"], "author_location": ["Business School, Elliott Jaques Building, Brunel University, Uxbridge, Middlesex, UK", "Business School, Armstrong Building, Newcastle University, Newcastle upon Tyne, UK", "Business School, Armstrong Building, Newcastle University, Newcastle upon Tyne, UK"], "keywords": ["IT in Business", "Data Structures and Information Theory", "Operations Research/Decision Theory", "Computer Communication Networks", "Business and Management", "general", "e-Commerce/e-business"], "link": "https://doi.org/10.1007/s10660-009-9030-8", "country": ["GB", "ZA", "ZA"], "citation": 103}
---------------------------------
{"title": "Are we ready for metaverse?: a measurement study of social virtual reality platforms.", "date": 2022, "publish": "IMC", "abstract": "Social virtual reality (VR) has the potential to gradually replace traditional online social media, thanks to recent advances in consumer-grade VR devices and VR technology itself. As the vital foundation for building the Metaverse, social VR has been extensively examined by the computer graphics and HCI communities. However, there has been little systematic study dissecting the network performance of social VR, other than hype in the industry. To fill this critical gap, we conduct an in-depth measurement study of five popular social VR platforms: AltspaceVR, Horizon Worlds, Mozilla Hubs, Rec Room, and VRChat. Our experimental results reveal that all these platforms are still in their early stage and face fundamental technical challenges to realize the grand vision of Metaverse. For example, their throughput, end-to-end latency, and on-device computation resource utilization increase almost linearly with the number of users, leading to potential scalability issues. We identify the platform servers' direct forwarding of avatar data for embodying users without further processing as the main reason for the poor scalability and discuss potential solutions to address this problem. Moreover, while the visual quality of the current avatar embodiment is low and fails to provide a truly immersive experience, improving the avatar embodiment will consume more network bandwidth and further increase computation overhead and latency, making the scalability issues even more pressing.", "source": "acm", "author": ["Ruizhi Cheng", "Nan Wu", "Matteo Varvello", "Songqing Chen", "Bo Han 0001"], "author_location": ["George Mason University", "George Mason University", "Nokia Bell Labs", "George Mason University", "George Mason University"], "keywords": [], "link": "https://doi.org/10.1145/3517745.3561417", "country": ["us", "us", "us", "us", "us"], "ctmighterror": [], "citation": 1}
---------------------------------
{"title": "Metaverse and Developing Economies.", "date": "2022", "publish": "IT Prof.", "abstract": "Individuals and organizations from developing economies are participating at an increasing rate in the metaverse economy. This article gives an overview of the key benefits to these economies that stem from the metaverse and highlights some challenges that need to be overcome.", "source": "ieee_unknown", "author": ["Nir Kshetri"], "author_location": ["The University of North Carolina at Greensboro, Greensboro, NC, USA"], "keywords": [], "link": "https://doi.org/10.1109/MITP.2022.3174744", "country": ["us"], "ctmighterror": [], "citation": 163}
---------------------------------
{"title": "Virtual Worlds (Metaverse): From Skepticism, to Fear, to Immersive Opportunities.", "date": "2022", "publish": "Computer", "abstract": "The advancement of human–computer interfaces and computational power enables the creation of believable virtual worlds. These were once limited to the gaming community but are now used for business purposes, including industrial applications, health, education.", "source": "ieee_unknown", "author": ["Paolo Faraboschi", "Eitan Frachtenberg", "Phil Laplante", "Dejan S. Milojicic", "Roberto Saracco"], "author_location": ["Hewlett Packard Labs", "Hewlett Packard Labs", "The Pennsylvania State University", "Hewlett Packard Labs", "University of Trento"], "keywords": [], "link": "https://doi.org/10.1109/MC.2022.3192702", "country": ["us", "us", "us", "us", "it"], "ctmighterror": [], "citation": 0}
---------------------------------
{"title": "User Recommendation in Social Metaverse with VR.", "date": 2022, "publish": "CIKM", "abstract": "Social metaverse with VR has been viewed as a paradigm shift for social media. However, most traditional VR social platforms ignore emerging characteristics in a metaverse, thereby failing to boost user satisfaction. In this paper, we explore a scenario of socializing in metaverse with VR, which brings major advantages over conventional social media: 1) leverage flexible display of users' 360-degree viewports to satisfy individual user interests, 2) ensure the user feelings of co-existence, 3) prevent view obstruction to help users find friends in crowds, and 4) support socializing with digital twins. Therefore, we formulate the Co-presence, and Occlusion-aware Metaverse User Recommendation (COMUR) problem to recommend a set of rendered players for users in social metaverse with VR. We prove COMUR is an NP-hard optimization problem and design a dual-module deep graph learning framework (COMURNet) to recommend appropriate users for viewport display. Experimental results on real social metaverse datasets and a user study with Occulus Quest 2 manifest that the proposed model outperforms baseline approaches by at least 36.7% of solution quality.", "source": "acm", "author": ["Bing-Jyue Chen", "De-Nian Yang"], "author_location": ["Academia Sinica, Taipei, Taiwan Roc", "Academia Sinica, Taipei, Taiwan Roc"], "keywords": [], "link": "https://doi.org/10.1145/3511808.3557487\n", "country": ["TW", "TW"], "citation": 0}
---------------------------------
{"title": "Vision: Usable Privacy for XR in the Era of the Metaverse.", "date": 2022, "publish": "EuroUSEC", "abstract": "Extended Reality (XR) — an umbrella term for Augmented Reality (AR), Virtual Reality (VR) and Mixed Reality (MR) — has penetrated the consumer market and is prone to increasingly impact our lives in the near future. Various devices, e.g., MR glasses, AR smartphones apps, or VR headsets, are becoming more affordable, and leader tech companies are heavily investing for a more immersive, realistic, and connected future. Lately, this vision of an interconnected virtual space for people to work, learn, play and share experiences with others has been formulated as the so-called “Metaverse”. This expected paradigm shift will heavily rely on XR, and hence implies an unprecedented amount of sensible data being collected about the users. Indeed, XR devices collect large amounts of sensitive data, including biometric data (e.g., eye gaze and body movement data) that are primarily used as Natural User Interfaces (NUIs) or for the proper functioning of technologies and services. However, research has identified a number of privacy and security threats rooting from this pervasive data collection, as well as privacy threats regarding XR inputs, outputs, user interactions and devices themselves. Still, further efforts must be made to guarantee the privacy and safety of users in a usable fashion in the future, and XR must be considered as a whole rather than as the sum of its parts to match the vision of the Metaverse. In this context, we propose to analyse the gap between user privacy perceptions in XR as a whole, and their concrete behaviour. The goal of this research is to understand the differences and similarities between AR, MR and VR in terms of user privacy perceptions. This will help us to better understand the relationships between XR variants, which, we argue, is an important requirement to approach the future evolution of these technologies, and to consider usable privacy aspects that match the entire XR spectrum. Adopting this vision early on will be beneficial for future work, and will be the foundation for the implementation of a usable privacy-preserving solution in order to raise awareness and empower users by giving them more control over their privacy in the context of these new and future technologies.", "source": "acm", "author": ["Chris Warin", "Delphine Reinhardt"], "author_location": ["Institute of Computer Science, University of Göttingen, Germany", "Institute of Computer Science, University of Göttingen, Germany and Campus Institute Data Science, Germany"], "keywords": [], "link": "https://doi.org/10.1145/3549015.3554212\n", "country": ["DE", "DE"], "citation": 0}
---------------------------------
{"title": "Blockchain-Empowered Service Management for the Decentralized Metaverse of Things.", "date": "2022", "publish": "IEEE Access", "abstract": "The future of networking will be driven by the current emerging trends of combining the physical and virtual realities in cyberspace. Considering the ambient pandemic challenges, the role of virtual and augmented reality will definitely grow over time by transforming into the paradigm of the Metaverse of Things, where each person, thing or other entity will simultaneously exist within multiple synchronized realities. In this paper, we propose a novel framework for future metaverse applications composed of multiple synchronized data flows from multiple operators through multiple wearable devices and with different quality requirements. A new service quality model is proposed based on a customizable utility function for each individual data flow. The proposed approach is based on dynamic fine-grained data flow allocation and service selection using non-fungible tokens, which can be traded over the blockchain among users and operators in a decentralized mobile network environment.", "source": "ieee_unknown", "author": ["Taras Maksymyuk", "Juraj Gazda", "Gabriel Bugár", "Vladimír Gazda", "Madhusanka Liyanage", "Mischa Dohler"], "author_location": ["Department of Telecommunications, Lviv Polytechnic National University, Lviv, Ukraine", "Department of Computers and Informatics, Technical University of Košice (TUKE), 040 01 Košice, Slovakia", "Department of Computers and Informatics, Technical University of Košice (TUKE), 040 01 Košice, Slovakia", "Faculty of Economics and Informatics, Janos Selye University, 945 01 Komárno, Slovakia", "School of Computer Science, University College Dublin, D04 V1W8 Dublin, Ireland", "Advanced Technology Group, Ericsson Inc., Santa Clara, CA 95054, USA"], "keywords": [], "link": "https://doi.org/10.1109/ACCESS.2022.3205739", "country": ["UA", "SK", "SK", "SK", "US", "US"], "citation": 0}
---------------------------------
{"title": "Design of Secure Mutual Authentication Scheme for Metaverse Environments Using Blockchain.", "date": "2022", "publish": "IEEE Access", "abstract": "During the COVID-19 pandemic, engagement in various remote activities such as online education and meetings has increased. However, since the conventional online environments typically provide simple streaming services using cameras and microphones, there have limitations in terms of physical expression and experiencing real-world activities such as cultural and economic activities. Recently, metaverse environments, three-dimensional virtual reality that use avatars, have attracted increasing attention as a means to solve these problems. Thus, many metaverse platforms such as Roblox, Minecraft, and Fortnite have been emerging to provide various services to users. However, such metaverse environments are potentially vulnerable to various security threats because the users and platform servers communicate through public channels. In addition, sensitive user data such as identity, password, and biometric information are managed by each platform server. In this paper, we design a system model that can guarantee secure communication and transparently manage user identification data in metaverse environments using blockchain technology. We also propose a mutual authentication scheme using biometric information and Elliptic Curve Cryptography (ECC) to provide secure communication between users and platform servers and secure avatar interactions between avatars and avatars. To demonstrate the security of the proposed mutual authentication scheme, we perform informal security analysis, Burrows–Abadi–Needham (BAN) logic, Real-or-Random (ROR) model, and Automated Validation of Internet Security Protocols and Applications (AVISPA). In addition, we compare the computation costs, communication costs, and security features of the proposed scheme with existing schemes in similar environments. The results demonstrate that the proposed scheme has lower computation and communication costs and can provide a wider range of security features than existing schemes. Thus, our proposed scheme can be used to provide secure metaverse environments.", "source": "ieee_unknown", "author": ["Jongseok Ryu", "Seunghwan Son", "JoonYoung Lee", "Yohan Park", "Youngho Park 0005"], "author_location": ["School of Electronic and Electrical Engineering, Kyungpook National University, Daegu, South Korea", "School of Electronic and Electrical Engineering, Kyungpook National University, Daegu, South Korea", "School of Electronic and Electrical Engineering, Kyungpook National University, Daegu, South Korea", "School of Computer Engineering, Keimyung University, Daegu, South Korea", "School of Electronic and Electrical Engineering, Kyungpook National University, Daegu, South Korea\nSchool of Electronics Engineering, Kyungpook National University, Daegu, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/ACCESS.2022.3206457", "country": ["KR", "KR", "KR", "KR", "KR"], "citation": 0}
---------------------------------
{"title": "The DAO to MetaControl for MetaSystems in Metaverses: The System of Parallel Control Systems for Knowledge Automation and Control Intelligence in CPSS.", "date": "2022", "publish": "IEEE CAA J. Autom. Sinica", "abstract": "Briefing: An investigation and outline of MetaControl and DeControl in Metaverses for control intelligence and knowledge automation are presented. Prescriptive control with prescriptive knowledge and parallel philosophy is proposed as the starting point for the new control philosophy and technology, especially for computational control of metasystems in cyber-physical-social systems. We argue that circular causality, the generalized feedback mechanism for complex and purposive systems, should be adapted as the fundamental principle for control and management of metasystems with metacomplexity in metaverses. Particularly, an interdisciplinary approach is suggested for MetaControl and DeControl as a new form of intelligent control based on five control metaverses: Meta Verses, MultiVerses, InterVerses, TransVerse, and Deep Verses.", "source": "ieee_unknown", "author": ["Fei-Yue Wang 0001"], "author_location": ["The State Key Laboratory for Management and Control of Complex Systems, Chinese Academy of Sciences, Beijing, China"], "keywords": [], "link": "https://doi.org/10.1109/JAS.2022.106022", "country": ["CN"], "citation": 0}
---------------------------------
{"title": "Metaverses and DeMetaverses: From Digital Twins in CPS to Parallel Intelligence in CPSS.", "date": "2022", "publish": "IEEE Intell. Syst.", "abstract": "A total of 12 years have been passed since this Department was created in 2010 as the first academic forum dedicated to cyber-physical-social systems (CPSS), with the first CPSS research article on the field: “The Emergence of Intelligent Enterprises: From CPS to CPSS.” What has happened and changed during the past decade? A brief reflection and review are presented here with a focus on digital twins in CPS versus parallel intelligence in CPSS, and their relationship to blockchain intelligence, smart contracts, metaverses, DAO, Web3, and decentralized science. The concept of DeMetaverses is thus introduced and interpreted as a DAO-based decentralized autonomous metaverse. The characteristics, mechanism, and impact of DeMetaverses are discussed with a vision for achieving an integrated human, artificial, natural, and organizational intelligence that would transform our world into “6S” societies.", "source": "ieee_unknown", "author": ["Xiao Wang 0002", "Jing Yang", "Jinpeng Han", "Wei Wang", "Fei-Yue Wang 0001"], "author_location": ["QAII, Qingdao, China", "Institute of Automation, Chinese Academy of Sciences, Beijing, China", "Xi'an Jiaotong University, Xi'an, China", "Beijing Jiaotong University, Beijing, China", "Macau University of Science and Technology, Macao, China"], "keywords": [], "link": "https://doi.org/10.1109/MIS.2022.3196592", "country": ["CN", "CN", "CN", "CN", "MO"], "citation": 0}
---------------------------------
{"title": "Multimedia Research Toward the Metaverse.", "date": "2022", "publish": "IEEE Multim.", "abstract": "Metaverse, a set of fully immersive digital worlds where people can interact with one another using three-dimensional (3-D) avatars, is poised to become an increasingly popular modality to communicate with others. Many in the space consider it an evolution of the Internet, with augmented and virtual reality headsets providing the hardware to both visualize and interact with it. However, creating custom 3-D content and environments for a digital world can be extremely time-consuming and costly compared to typical web pages. To this end, research in procedural content generation is required to empower the efficient creation of high-quality multimedia contents for the metaverse. One other core concern when creating a fully decentralized metaverse is the need to download relevant environments on demand as people traverse across different worlds. Further research by the multimedia community on efficient multimedia networking, storage, and compression is necessary to ensure that digital worlds remain easily accessible to others.", "source": "ieee_unknown", "author": ["Shu-Ching Chen"], "author_location": ["Florida International University, Miami, FL, USA"], "keywords": [], "link": "https://doi.org/10.1109/MMUL.2022.3156185", "country": ["US"], "citation": 1}
---------------------------------
{"title": "Quality of Experience in the Metaverse: An Initial Analysis on Quality Dimensions and Assessment.", "date": "2022", "publish": "QoMEX", "abstract": "The Metaverse provides a novel experience to the user, by opening the doors to social-based multiuser environments merging physical reality with digital virtuality. In this paper, we present an initial analysis of the Quality of Experience (QoE) in the Metaverse. We first consider traditional influence factors (human, system, and context). Then, we introduce the social and economic dimensions of the Metaverse as additional factors to be considered for QoE assessment. Finally, we discuss what QoE assessment methods can be more suitable for Metaverse applications, with a particular focus on implicit assessment methods (e.g., physiological, human cognitive, affective behaviour).", "source": "ieee_unknown", "author": ["Simone Porcu", "Alessandro Floris", "Luigi Atzori"], "author_location": ["DIEE, University of Cagliari, Cagliari, Italy", "DIEE, University of Cagliari, Cagliari, Italy", "DIEE, University of Cagliari, Cagliari, Italy"], "keywords": [], "link": "https://doi.org/10.1109/QoMEX55416.2022.9900897", "country": ["IT", "IT", "IT"], "citation": 0}
---------------------------------
{"title": "6G, Next G, and the Metaverse: Toward the Peak-Experience Machine.", "date": "2022", "publish": "CSNDSP", "abstract": "Johannes Gutenberg’s invention of the printing press in 1450 revolutionized society and heralded 300 years of renaissance. While Gutenberg’s invention gave birth to printing, the Internet’s full potential still remains to be unleashed in the years to come. We do not yet know what the Internet truly is, though its impact is anticipated to be eventually similar or even superior to that of the printing press. Measured in Gutenberg time, we stand today at about the year 1481 with the progression of disruption in society. Note that Luther was born in the year 1483. Hence, the Internet’s Martin Luther is yet to come. This paper aims at developing an overarching narrative for future 6G and Next G networks, which go beyond the incremental 6G= 5G +1G mindset of past generations of mobile networks and also involve major over-the-top Internet players, including Apple, Google, Microsoft, as well as Facebook. We focus particularly on the emerging Metaverse, the anticipated successor to today’s mobile Internet, which will be about being inside the Internet (rather than simply looking at it from a phone screen) and producing peak-experiences. This is in contrast to only printing & pamphlets about them, as Luther had to do in a pre-Internet era.", "source": "ieee_unknown", "author": ["Martin Maier"], "author_location": ["Optical Zeitgeist Laboratory, INRS, Montréal, QC, Canada"], "keywords": [], "link": "https://doi.org/10.1109/CSNDSP54353.2022.9907941", "country": ["CA"], "citation": 0}
---------------------------------
{"title": "Conceptualization of Augmented Digital Ecosystem (ADE) in context of Metaverse and The Augmented Dimension.", "date": "2022", "publish": "ENC", "abstract": "There is an increase of interest in Metaverse and Augmented Reality. This paper exposes argumentation to conceptualize an Augmented Digital Ecosystem as part of an Augmented Dimension along with other elements also described such as Cyberspace, Metaverse and Virtual Worlds (VW).", "source": "ieee_unknown", "author": ["Naomi R. Duran Torres", "Gabriel López-Morteo", "René Cruz-Flores"], "author_location": ["Institute of Engineering Autonomous University of Baja California, Mexicali, México", "Institute of Engineering Autonomous University of Baja California, Mexicali, México", "University Center of the State of Mexico, Autonomous University of Mexico State, Valle de Chalco, México"], "keywords": [], "link": "https://doi.org/10.1109/ENC56672.2022.9882956", "country": ["US", "US", "MX"], "citation": 0}
---------------------------------
{"title": "Metaverse Current Status and Prospects: Focusing on Metaverse Field Cases.", "date": "2022", "publish": "BCD", "abstract": "The purpose of this study is to examine the current status of Metaverse by reflecting Metaverses’ various field cases and national policies, and discuss the opportunities and changes that can be obtained at the Metaverse utilization plan and individual, enterprise, and government levels.", "source": "ieee_unknown", "author": ["Jina Lee", "Inmo Yeo", "Heewon Lee"], "author_location": ["Dept of Business Administration, Soongsill Univ, Seoul, South Korea", "Samsung Town Finance Center, Samsung Securities Co., Ltd, Seoul, South Korea", "Dept of IT Policy and Management, Soongsill Univ, Seoul, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/BCD54882.2022.9900579", "country": ["KR", "KR", "KR"], "citation": 0}
---------------------------------
{"title": "Metaverse Learning: The Relationship among Quality of VR-Based Education, Self-Determination, and Learner Satisfaction.", "date": "2022", "publish": "BCD", "abstract": "While online learning had traditionally been implemented to aid in-person education, it has recently evolved into a critical tool for remote education. In particular, the advent of the COVID-19 pandemic has accelerated the spread of online learning and its significance. However, this wave of innovation in the education field has revealed the lack of research on how online education should be systematically provided and which educational aspects should be considered to enhance learner satisfaction in online settings. With the recent emergence of the Metaverse, VR education is once again proposed as a major tool for online learning despite existing limitations in research which put both systematic and educational aspects into consideration. Hence, this study presents and discusses a research model that converges technology acceptance model, information systems success model, and self-determination theory with the purpose of exploring variables that affect learner satisfaction, mediating the flow theory. Results showed that most variables of both self-determination theory and information system quality within VR education impact learner satisfaction. In particular, learners’ flow – complete immersion in learning – functions as an important mediating variable for learner satisfaction. These findings suggest designing and running a systematic platform that reflects self-directed learning is imperative to bring the best educational practices into the Metaverse.", "source": "ieee_unknown", "author": ["Gina Gim", "Hoikyoung Bae", "Seona Kang"], "author_location": ["Next Generation R&D Technology Policy Institute, Soongsil University, Seoul, Korea", "Programs in Project Management, Soongsil University, Seoul, Korea", "Programs in Project Management, Soongsil University, Seoul, Korea\n"], "keywords": [], "link": "https://doi.org/10.1109/BCD54882.2022.9900629", "country": ["KR", "KR", "KR"], "citation": 0}
---------------------------------
{"title": "Developing Songjeong Metaverse Surfing Village: Development of Metaverse-based Platform Specialized for Marine Tourism.", "date": "2022", "publish": "BCD", "abstract": "This study aims to introduce and explain how to develop a metaverse based immersive and experiential tourist contents. The project plans to introduce long-term and highly scalable new concept platform by developing virtual metaverse surfing village centered on Song-Jeong beach which is popular surfing destination in South Korea. The project consists of the following 5 tasks: The first Task is to develop Metaverse-based hyper-immersive interactive content which include implementation of surfing village virtualization by identifying an analyzing the components through spatial analysis. Second Task is developing VR/AR based experiential content. In this task, AI based service contents that can provide optimized surfing posture and correction service and virtual surfing experience contents will be developed. The third task is developing contents that provide integrated information linked to local tourism and leisure infrastructure. To do that AI based smart tourism service will be developed. The fourth task is to develop business model for interactive metaverse platform. Lastly, the fifth task is demonstration stage of the platform. This task includes promotion of demonstration platform, operating expert advisory group, and establishment of longterm expansion plan.", "source": "ieee_unknown", "author": ["Tae-Hwan Yoon", "Jong Kyu Do", "Seok Chan Jeong"], "author_location": ["Dept. of Hotel & Convention Management, Dong-Eui University, Busanl, South Korea", "Dept. of Artificial Intelligence, Graduate School of Engineering, Dong-Eui University, Busan, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/BCD54882.2022.9900793", "country": ["KR", "KR"], "citation": 0}
---------------------------------
{"title": "Beauty Industry's Strategic Response to Metaverse Evolution: Focused on Generation MZ.", "date": "2022", "publish": "BCD", "abstract": "The South Korean cosmetics industry is loved by the whole world in the name of ‘K-beauty’ together with the Hallyu culture, and has been established as one of South Korea’s key export items. In particular, lots of changes occur rapidly due to the development of telecommunication and the introduction of new technologies, and also changes caused by COVID-19 have brought about great changes in all the areas of distribution and sales. In addition, the consumption of the MZ generation shows different patterns from the existing consumer generations, and a new change in distribution and sales start in earnest according as their influence grows. While metaverse platform services, which are yet in their early stages, are now used mostly by entertainment area and global large companies, it is deemed that continuous investment and technological innovation will accelerate the expansion of metaverse platforms. Currently, response to cosmetics industry in the metaverse platform market is trivial, but cosmetics industry will also have to provide services through the market of this new type before long. For this, it should understand the consumption tendency of the main consumers, and grope for marketing strategies responding to it. The strategies are as follows: First, the consumption patterns of the MZ generation, which will grow as a main consumer group in the future though they are not a current main consumption group, should be understood, and marketing methods should be developed in agreement with consumption patterns pursued by them. Second, PR and marketing embracing the values of the MZ generation, such as environment and value-based consumption should be carried out, and services of real-time communication through stories sympathized by the MZ generation should be provided. Third, while offline experience is important, the marketing of experience in metaverse platforms should be provided, and goods that enable two-way communication and simultaneous enjoyment should be provided by planning and developing goods that allow linkage between metaverse and offline, Lastly, it is deemed that strategies for attracting consumers by providing contents of amusement and fun should be used.", "source": "ieee_unknown", "author": ["Youngju Kim", "Hyeil Jung"], "author_location": ["Business Administration, SookMyung Woman’s Univ., Seoul, South Korea", "Cosmedia.co.ltd, Seoul, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/BCD54882.2022.9900806", "country": ["KR", "KR"], "citation": 0}
---------------------------------
{"title": "A Study on the Intellectual Property of Cosmetics Companies Operating on Metaverse Platform.", "date": "2022", "publish": "BCD", "abstract": "This study intends to consider problems relating to intellectual property among various problems that may occur in the metaverse platform, a major next-generation platform that links the real world and the virtual world. For this, this study investigates services currently provided by cosmetic companies in the metaverse platform, finds out possible intellectual property related problems that may occur to the cosmetic companies, and seeks solutions to the problems. Although it seems that there is not yet a great problem or issue relating to meta verse platforms because matters relating to intellectual property in metaverse platforms are at their early stages, it is supposed that they will become issues requiting seiious discussion according as their number increase. It seems necessary to conduct relevant studies and make a thorough preparation for legal regulation and procedure in advance so that intellectual property rights may be protected safely.", "source": "ieee_unknown", "author": ["Youngju Kim", "Hyeil Jung"], "author_location": ["Ph.D. in Busineos Administration, SookMyung Woman’s Univ, Seoul, South Korea", "Cosmedia. co. ltd, Seoul, South Korea"], "keywords": [], "link": "https://doi.org/10.1109/BCD54882.2022.9900614", "country": ["KR", "KR"], "citation": 0}
---------------------------------
{"title": "A Conceptual Framework for Determining Metaverse Adoption in Vietnam IT Enterprises.", "date": "2022", "publish": "BCD", "abstract": "Metaverse is an extension of synchronous communication that includes an efficient number of users to share different experiences. The study aims to investigate the acceptance of Metaverse-related projects by employees of technology companies in Vietnam, thereby finding out the characteristics that hinder the implementation of Metaverse. Moreover, the study also gives recommendations to develop Metaverse projects in Vietnam, especially in Technology companies, relying on 5 variables Perceived Compatibility, Perceived Trialability, Perceived Ease of Use, Perceived Usefulness, and Intention to Use. Authors already gained roughly 312 responses based on block simple random sampling. This study was conducted based on a survey of IT enterprises in Vietnam, thereby assessing the characteristics affecting the decision to participate in or implement Metaverse projects of enterprises.", "source": "ieee_unknown", "author": ["Hung-Trong Van", "Thin Nguyen Si", "Anh Vu Thi Quynh", "Trang Nguyen Thi Kieu", "Thi-Thanh-Thao Vo"], "author_location": ["Vietnam – Korea University of Information and Communication Technology, The University of Danang, Danang, Vietnam", "Vietnam – Korea University of Information and Communication Technology, The University of Danang, Danang, Vietnam", "Vietnam – Korea University of Information and Communication Technology, The University of Danang, Danang, Vietnam", "Vietnam – Korea University of Information and Communication Technology, The University of Danang, Danang, Vietnam", "Vietnam – Korea University of Information and Communication Technology, The University of Danang, Danang, Vietnam"], "keywords": [], "link": "https://doi.org/10.1109/BCD54882.2022.9900871", "country": ["VN", "VN", "VN", "VN", "VN"], "citation": 0}
---------------------------------
{"title": "The Rise of Metaverse and Interoperability with Split-Protocol.", "date": "2022", "publish": "IRI", "abstract": "The concept of the metaverse dates to 1992; however, the popularity of this concept has gained increased attention in 2021 following the announcement by Mark Zuckerberg to rebrand Facebook as Meta. The topic of the metaverse is not new but an attractive topic that is gaining increased insight from researchers. This research focuses on a broader evaluation of the metaverse and its key elements and features of the metaverse. Even though metaverse is expected as a promising platform for information exchange and communication among internet users, it has several shortcomings such as requiring high-performance client terminals and a long response time in some cases. We address issues by introducing an interoperable Split- protocol with role changeover ability for resiliency and high availability of metaverse systems. The paper highlights key security and privacy threats, as well as the critical challenges in security defenses and privacy preservation under the distributed metaverse architecture.\"", "source": "ieee_unknown", "author": ["Bharat S. Rawal", "Andrew Mentges", "Shakaib Ahmad"], "author_location": ["Computer Science Department, Capitol Technology University, Laurel, USA", "Computer Science Department, Capitol Technology University, Laurel, USA", "Computer Science Department, Capitol Technology University, Laurel, USA"], "keywords": [], "link": "https://doi.org/10.1109/IRI54793.2022.00051", "country": ["US", "US", "US"], "citation": 0}
---------------------------------
{"title": "Metaverse: How to Approach Its Challenges from a BISE Perspective.", "date": "2022", "publish": "Bus. Inf. Syst. Eng.", "abstract": "", "source": "springer_unknown", "author": ["Christian Peukert", "Christof Weinhardt", "Oliver Hinz", "Wil M. P. van der Aalst"], "author_location": ["Karlsruhe Institute of Technology (KIT), Institute of Information Systems and Marketing (IISM), Karlsruhe, Germany", "Karlsruhe Institute of Technology (KIT), Institute of Information Systems and Marketing (IISM), Karlsruhe, Germany", "Goethe University Frankfurt, Faculty of Economics and Business Administration, Frankfurt am Main, Germany", "RWTH Aachen, Aachen, Germany"], "keywords": ["IT in Business", "Business and Management", "general"], "link": "https://doi.org/10.1007/s12599-022-00765-9", "country": ["DE", "DE", "DE", "DE"], "citation": 0}
---------------------------------